[
    {
        "title": "Tesla Bull Ross Gerber: Elon Musk isn’t coming back, his next move is...",
        "link": "https://timesofindia.indiatimes.com/technology/tech-news/tesla-bull-ross-gerber-to-shareholders-if-you-have-any-confusion-that-elon-musk-is-coming-back-to-tesla-hes-not-his-next-move-is-/articleshow/120345189.cms",
        "description": "Ross Gerber said in an interview recently that Elon Musk “doesn’t care” about the electric car manufacturer. He also defended his criticism after a backlash from retail investors.",
        "published_date": "Wed, 16 Apr 2025 17:19:29 +0530",
        "source": "Times of India",
        "source_country": "India",
        "countries_mentioned": [
            "Australia",
            "India"
        ],
        "content": "‘Getting attacked because of Elon’s behavior: Tesla investor\n\nTesla stocks declined 33% year-to-date\n\nTesla investor Ross Gerber, who called for Elon Musk ’s exit from the company, has once again criticized him. In an interview with Bloomberg Technology, the CEO of Gerber Kawasaki Wealth & Investment Management, said that Musk “doesn’t care” about the electric car manufacturer. “It’s clear that he just doesn’t care. His next move is X AI… So if you have any confusion that he’s coming back to Tesla, he’s not,” he said during the interview.In March, Gerber said that Musk has lost focus given his widening interests and has become too ‘divisive’. Blaming social media posts and involvement with the president Donald Trump for bringing negative publicity to the company, he then said that “the company's reputation has just been destroyed by Elon Musk”.In the Bloomberg interview, Gerber also defended his criticism after a backlash from retail investors. He said “I understand why retail investors at Tesla are frustrated with me for voicing my views” adding that he’s “getting attacked because of Elon’s behavior.”However, Gerber said that his firm will continue to manage Tesla shares. He said “We still own Tesla because I do think something fixes itself at some point, and they have the best products”.While Tesla continues to lead the US EV market, the company’s stocks have declined 33% year-to-date. According to Cox Automotive data, Tesla sales fell 8.6% year over year in the first quarter of 2025, while the market expanded 11.4% as a whole.",
        "news_type": "Economics"
    },
    {
        "title": "Iran Close To Having A Nuclear Bomb, Says UN Body Chief, Heads To Tehran",
        "link": "https://www.ndtv.com/world-news/iran-close-to-having-a-nuclear-bomb-says-un-watchdog-heads-to-tehran-8181984#publisher=newsstand",
        "description": "Donald Trump is pressurising Iran to give up on its nuclear weapons programme.",
        "published_date": "Wed, 16 Apr 2025 23:29:41 +0530",
        "source": "NDTV",
        "source_country": "India",
        "countries_mentioned": [
            "Australia",
            "India"
        ],
        "content": "Iran is dangerously close to developing an atomic weapon, warned the International Atomic Energy Agency, hours before the UN watchdog's chief is expected to leave for Tehran. During his visit, the top nuclear body chief will hold talks with Iranian government officials over recent developments in its top secret nuclear programme.\n\nRafael Grossi, who heads the IAEA, likened the development of a nuclear weapon to that of solving a jigsaw puzzle. \"Iran has all the pieces now, and could well put them together eventually,\" he said.\n\nSpeaking about Tehran's nuclear weapons ambition, Mr Grossi told French newspaper Le Monde that \"Iran is not too far from having an atomic bomb\".\n\nIAEA, which is an autonomous UN body, is currently tasked with overseeing Iran's compliance with the 2015 nuclear deal that fell apart after Donald Trump withdrew from it during his first term as US President. At the time President Trump had called it a \"bad deal\".\n\n'RADICALS CANNOT HAVE NUCLEAR WEAPONS'\n\nHe now wants to completely rid Iran of its military nuclear programme. Just this week, President Trump had asserted that \"Iran has to get rid of the concept of a nuclear weapon. These are radicalised people, and they cannot have a nuclear weapon.\"\n\nHis remark came shortly after the first round of talks between Washington and Tehran which were held in Oman last weekend.\n\nAfter the first round of negotiations, US's Mideast envoy Steve Witkoff, who represented America, said that the talks were \"positive, constructive, and compelling\". Surprisingly, even Iran's Supreme Leader said the talks are \"going well\" so far. Iran however, swiftly sent a top delegation headed by the foreign minister to Moscow to consult the Kremlin.\n\nThe second round of talks are expected in Rome, though Tehran is pushing for talks to continue in Oman.\n\nExplaining Washington's outlook and objectives from these talks, Mr Witkoff told Fox News that \"This is going to be much about verification on the enrichment program, and then ultimately verification on weaponization. That includes missiles, the type of missiles that they have stockpiled there. And it includes the trigger for a bomb.\"\n\nTECHNICAL DETAILS\n\nFurther explaining his point, Mr Witkoff said that for the first time Iran had been offered a specific level of enrichment by the United States. Today, Tehran enriches uranium to up to 60 per cent - a short, technical step away from weapons-grade levels of 90 per cent.\n\nFor their limited, peaceful and civilian purpose, \"They (Iran) do not need to enrich past 3.67 per cent,\" Mr Witkoff told Fox News, adding that \"In some circumstances, they're at 60 per cent, in other circumstances, 20 per cent. That cannot be.\"\n\n\"You do not need to run, as they claim, a civil nuclear program where you're enriching past 3.67 per cent. So this is going to be much about verification on the enrichment program, and then ultimately verification on weaponisation.\"\n\nOBAMA DEAL vs TRUMP DEAL\n\nUnder then US President Barack Obama, for the 2015 Iran nuclear deal, Tehran had agreed to drastically reduce its stockpile of uranium and only enrich up to 3.67 per cent - enough for its nuclear power plant at Bushehr. In exchange, Iran received access to frozen funds around the world, and sanctions were lifted on its crucial oil industry and other sectors.\n\nIn 2018, when Donald Trump withdrew from the 2015 Iran nuclear deal, he had highlighted that Iran's ballistic missile stockpile was one of the main reasons to exit the deal. Adding to that, Mr Witkoff said that \"Any deal with Iran would have to include missiles - the type of missiles that they have stockpiled there and it also includes the trigger for a bomb.\"\n\nIn a post on social media platform X after the first round of US-Iran talks, Mr Witkoff wrote, \"A deal with Iran will only be completed if it is a Trump deal.\"\n\n",
        "news_type": "Politics"
    },
    {
        "title": "Contract assistant professors from across Telangana stage protest demanding regularisation of jobs ",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/contract-assistant-professors-from-across-telangana-stage-protest-demanding-regularisation-of-jobs/article69457342.ece",
        "description": "",
        "published_date": "Wed, 16 Apr 2025 23:58:20 +0530",
        "source": "The Hindu",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Several contract assistant professors from across Telangana staged a protest at Dharna Chowk demanding immediate regularisation of their employment before any fresh university recruitment takes place.\n\nThe demonstration, organised by the Telangana Universities Contract Assistant Professors’ Joint Action Committee (JAC), drew large number of women professors from 12 universities across the State.\n\nThe JAC has insisted that the State government fulfil long-standing promises to regularise their services, some of whom have been serving on contract since the 1990s.\n\nProfessor Haragopal, addressing the gathering, called the contract employment system a “big injustice” that has left countless educators in limbo for decades. He urged both the State and Central governments to resolve the issue through a one-time settlement, stating that the Supreme Court had already ruled in favour of equal pay for equal work, rendering the continuation of this disparity indefensible.\n\nBC Association national president and Rajya Sabha MP R. Krishnaiah pledged to raise the issue both at the State and national levels, declaring he would speak in Parliament if necessary.\n\nOpposition leaders from across party lines echoed similar sentiments.\n\nCPI Telangana secretary and MLA Kunanneni Sambasiva Rao criticised successive governments for failing to address the legitimate demands of contract educators and urged the current administration to act swiftly.\n\nLeader of the Opposition in the Legislative Council Dr. Madhusudhana Chari assured continued support until the demands are met, while BJP MLC Anji Reddy and party general secretary Kasam Venkateswarlu also backed the protest, with Venkateswarlu offering to liaise with the Centre to clear UGC-related obstacles.\n\nCongress spokesperson Harshavardhan Reddy stated that he would immediately take up the issue with the Chief Minister and press for a solution.\n\nBC Welfare Association president Jajula Srinivas Goud highlighted the financial strain faced by contract professors. “If the State government pays less salaries to contract teachers working in universities, how will they do their jobs? They also have wives, children, household expenses, monthly expenses, and health expenses. In such a situation, they should worry about whether they should work for poor salaries or face daily hardships,” he said, and called for the urgent organisation of an all-party delegation to meet with the government.",
        "news_type": "Politics"
    },
    {
        "title": "Summers Slams Trump’s ‘Wildly Extralegal’ Attacks on Harvard",
        "link": "https://www.livemint.com/politics/summers-slams-trump-s-wildly-extralegal-attacks-on-harvard-11744818063136.html",
        "description": "Former Harvard University President Larry Summers assailed President Donald Trump over his deepening attacks on the school, slamming a “wildly extralegal” federal funding freeze earlier this week.",
        "published_date": "Wed, 16 Apr 2025 21:11:02 +0530",
        "source": "Mint Politics",
        "source_country": "India",
        "countries_mentioned": [
            "Australia",
            "India"
        ],
        "content": "Former Harvard University President Larry Summers assailed President Donald Trump over his deepening attacks on the school, slamming a “wildly extralegal” federal funding freeze earlier this week.\n\n“This is not an isolated thing, what’s being done to Harvard,” Summers said in an interview Wednesday with Bloomberg Television. “This is part of a broad and sweeping effort to suppress institutions that challenge the presidential administration.”\n\nTrump is in an escalating standoff with Harvard after the government froze $2.2 billion in federal grants for the school this week. The president went on to threaten Harvard’s tax-exempt status and on Wednesday accused the school of hiring “radical left” faculty and said it “can no longer be considered even a decent place of learning.”\n\nThe Trump administration, which has accused Harvard of mishandling antisemitism on campus, stepped up its demands last week by calling for changes to admissions and hiring practices. Harvard President Alan Garber rejected the terms this week, saying they made clear that the government’s intention “is not to work with us to address antisemitism.”\n\nSummers, a former US Treasury Secretary, said he hoped Harvard would find ways to maintain important research in the face of the federal funding cut, warning of long-term damage from a protracted battle between universities and the Trump administration.\n\n“If the US government goes to war with our great universities, it means a sharp reduction in the kind of scientific progress that has caused the United States to be the envy of the world,” he said.\n\nWhile Summers said Harvard still needs to do more to combat prejudice against Jews and expand intellectual diversity, he applauded the university’s effort to stand up to Trump. Harvard is the oldest and richest US university, with a $53 billion endowment.\n\n“Harvard should not go interjecting itself into politics,” said Summers, a paid contributor to Bloomberg TV. But “if an institution like Harvard cannot resist tyranny when applied to it,” he said, “then who can?”\n\n©2025 Bloomberg L.P.",
        "news_type": "Politics"
    },
    {
        "title": "AIADMK-BJP alliance in Tamil Nadu only for polls? Edappadi K Palaniswami flexes muscles, says ‘we never said coalition…’",
        "link": "https://www.livemint.com/politics/news/aiadmk-bjp-alliance-only-for-election-in-tamil-nadu-edappadi-k-palaniswami-we-never-said-coalition-govt-11744803986633.html",
        "description": "Edappadi K Palaniswami (EPS) has hinted that the AIADMK and BJP's alliance in Tamil Nadu is only for 2026 assembly election and not to form a coalition government. ",
        "published_date": "Wed, 16 Apr 2025 18:04:05 +0530",
        "source": "Mint Politics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Less than a week after the AIADMK and BJP rekindled their alliance in Tamil Nadu, Edappadi K Palaniswami (EPS) on Wednesday hinted that the two parties have joined hands only for the election and not to form a coalition government.\n\n“We never said (about) coalition government. You have misunderstood. Leave that. It's an electoral alliance, not coalition government,” said the AIADMK chief while speaking to the media.\n\nPalaniswami also stated that Amit Shah said that for Delhi, it's the PM Narendra Modi, and for Tamil Nadu, he mentioned my name.\"\n\nOn April 11, while announcing the alliance between the two parties, Union Minister Amit Shah declared that the 2026 Tamil Nadu Assembly election will be fought under the leadership of AIADMK chief Edappadi K Palaniswami.\n\nDuring the press meet, Shah also exuded confidence that the NDA would get a massive majority and form an NDA government in Tamil Nadu. However, When Shah was asked if the NDA would form a coalition government if it won the 2026 polls in the state, he replied in the affirmative.\n\n\"Only elections will decide the strength of alliance. Votes without split should defeat the enemy. We made efforts to coordinate with parties with same thoughts, against DMK,\" reported ANI quoting EPS.\n\nHe further claimed that many other parties would join the AIADMK-BJP alliance to defeat the DMK, adding, “First, the BJP came into our alliance. Very soon, many other parties would come into our AIADMK - BJP alliance.”\n\nAlso Read | Who is Nainar Nagendran, the AIADMK turncoat all set to be Tamil Nadu BJP chief\n\nMeanwhile, so far, there is no official reaction from the Bharatiya Janata Party on EPS' comment.\n\nAIADMK and BJP revived their alliance nearly two years after parting ways in September 2023, reportedly over Annamalai's certain remarks about late party stalwarts, including Jayalalithaa.\n\nFollowing the announcement of the alliance between the two parties, Prime Minister Narendra Modi hailed the AIADMK's decision to join the BJP-led National Democratic Alliance (NDA).\n\n\"Stronger together, united towards Tamil Nadu's progress! Glad that AIADMK joins the NDA family. Together, with our other NDA partners, we will take Tamil Nadu to new heights of progress and serve the state diligently. We will ensure a government that fulfils the vision of the great MGR and Jayalalithaa Ji,\" Modi said in a post on X.",
        "news_type": "Politics"
    },
    {
        "title": "BJP takes jibe at Congress over National Herald case: 'This is Gandhi model of development'",
        "link": "https://www.livemint.com/politics/news/bjp-takes-jibe-at-congress-over-national-herald-case-this-is-gandhi-model-of-development-indira-gandhis-emergency-11744790244948.html",
        "description": "BJP leaders took a jibe at the Congress after the Enforcement Directorate named Congress leaders Sonia Gandhi and Rahul Gandhi in its chargesheet in the National Herald case.",
        "published_date": "Wed, 16 Apr 2025 13:39:07 +0530",
        "source": "Mint Politics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Bharatiya Janata Party (BJP) leader Ravi Shankar Prasad on Wednesday said that the National Herald, launched in 1937, was \"never the personal property of the Nehru family.\"\n\nHe said, \"The newspaper, which was supposed to strengthen the voice of the people fighting for independence, they turned that newspaper into a private business, an ATM!\"\n\nRavi Shankar Prasad's comments came after the Enforcement Directorate (ED) named Congress leaders Sonia Gandhi and Rahul Gandhi in its chargesheet in the National Herald case.\n\nPrasad said the law will take its own course under the Narendra Modi government and that probe agencies will not be fazed by the \"threats\" of the Congress.\n\nHe said the Congress has the right to hold 'dharnas' (to protest the ED chargesheet against Sonia Gandhi and Rahul) but that right does not extend to misappropriating public properties given by the government to the National Herald.\n\nAlso Read | ED files chargesheet against Sonia, Rahul in National Herald case\n\n\"A corporate conspiracy was hatched in a very interesting way to get this entire property into the hands of the family...,\" Prasad said.\n\n'Gandhi model of development' The BJP leader alleged that Young India wrote off the ₹90 crore loan that the Congress had given to the Associated Journals Ltd (AJL) and got ownership of the company with a paltry investment of ₹50 lakh.\n\nThe land was given to the AJL by the government, he said, adding that the National Herald was allegedly used by the Congress establishment to collect advertisement and properties.\n\n\"...using party funds for a private company is prohibited. When AJL failed to repay the loan, a corporate conspiracy was orchestrated to transfer its valuable assets to the Gandhi family,\" the BJP leader said.\n\nHe said this is the \"Gandhi model of development\" as he noted the allegation against Sonia Gandhi's son-in-law Robert Vadra of pocketing a huge profit in a land deal in Haryana with the collusion of the then Congress government in the state.\n\n\"The Gandhi family acquired assets worth ₹90 crore for just ₹50 lakh. Another member bought land for ₹3 crore and later sold it for ₹58 crore after commercialisation. This is called the ‘Gandhi model of development,’\" he said.\n\nAlso Read | ED likely to question Rahul Gandhi in National Herald case: Report\n\n'Today is not Indira Gandhi's emergency' BJP spokesperson CR Kesavan on Wednesday said that the Congress leadership should realise that \"today is not Indira Gandhi's emergency.\"\n\nHe told news agency ANI, \"...today is Modi's fair and fearless Bharat, where everybody will be made answerable and accountable for their wrongdoings...\"\n\n\"The Congress is trying to intimidate government agencies... This shows that they are trying to hide something... The Congress is resisting the law of the land... They should know that truth triumphs, but falsehoods never triumph...,\" he added.\n\nAlso Read | ED seals National Herald office, premises to not be opened without permission\n\nNational Herald case The Enforcement Directorate filed a chargesheet against Congress leaders Sonia Gandhi and Rahul Gandhi and others before a special court in the National Herald case, accusing them of laundering ₹988 crore.\n\nThe Congress described the ED's chargesheet as vendetta politics and claimed seizing assets in the case was a \"state-sponsored crime masquerading as the rule of law\".\n\nAlso Read | Mallikarjun Kharge being questioned in National Herald case, says Jairam Ramesh\n\nCongress protest The Congress launched a massive protest against the central government and investigative agencies after the ED filed a chargesheet against Congress leaders Rahul and Sonia Gandhi in connection with the National Herald.",
        "news_type": "Politics"
    },
    {
        "title": "Mamata Banerjee blames BSF, foreign elements for Murshidabad violence: ‘Isn't it BSF's duty to guard border?’",
        "link": "https://www.livemint.com/politics/news/mamata-banerjee-blames-bsf-foreign-elements-for-murshidabad-riots-isnt-it-bsfs-duty-to-guard-border-11744787926059.html",
        "description": "West Bengal Chief Minister Mamata Banerjee criticized the BSF regarding the Murshidabad violence linked to the new Waqf law. She questioned the BSF's role in border security and urged Prime Minister Modi to monitor Home Minister Amit Shah.",
        "published_date": "Wed, 16 Apr 2025 12:55:29 +0530",
        "source": "Mint Politics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "West Bengal Chief Minister Mamata Banerjee on Wednesday blamed the Border Security Force (BSF) and \"foreign elements\" for the “pre-planned” Murshidabad violence over the new Waqf Amendment Act.\n\nThree people were killed and several others injured in the Murshidabad violence.\n\nAt a meeting with imams, Mamata claimed the communal riot in Murshidabad was pre-planned. She said, “I came across news reports suggesting the involvement of elements from across the border in the Murshidabad unrest.”\n\n“Isn’t it the BSF’s duty to guard the border?” she questioned.\n\nAlso Read | Waqf Amendment Act SC Hearing LIVE: 6 BJP states move SC to support new law\n\nShe also assured the imams that she would instruct the Chief Secretary to probe the BSF firing that led to the death of a person in Murshidabad.\n\nThe Chief Minister then appealed to Prime Minister Narendra Modi not to allow any “atrocious law” and urged him to keep a check on his Home Minister, Amit Shah.\n\n“I would request the Prime Minister to keep a check on Amit Shah, he is doing harm to the nation to serve his own political agenda,” she said.\n\n“Why were you in such a hurry over the Waqf Amendment (Bill)? Didn’t you know the situation in Bangladesh?” she asked the Centre, referring to a media report citing Home Ministry sources that alleged Bangladesh’s involvement in the violence.\n\n“If that is the case, the Central government is responsible since BSF guards the borders, not us. The state government doesn't have the responsibility to guard the borders. Why did they allow BJP thugs from outside to come and create chaos before fleeing the scene? Accountability must be fixed.”\n\nMamata Banerjee also announced an ex gratia of ₹10 lakh for each of the families of the three people who died in the Murshidabad violence.\n\n‘TMC at forefront in fight against Waqf Amendment Bill’ At the same meeting, Mamata Banerjee said the Waqf Amendment Act goes against the country’s federal structure and reiterated that her party, the Trinamool Congress, is at the forefront of opposing the new law in Parliament.\n\nDismissing BJP’s claims, she said, “Had the TMC been involved in the Murshidabad violence, as alleged by the opposition, the houses of its leaders would not have been attacked.”",
        "news_type": "Politics"
    },
    {
        "title": "ED raids premises of AAP MLA Kulwant Singh, Rajasthan Congress leader Pratap Singh Khachariyawas",
        "link": "https://www.livemint.com/politics/news/ed-raids-premises-of-aap-mla-kulwant-singh-rajasthan-congress-leader-pratap-singh-khachariyawas-11744785549377.html",
        "description": "The ED raided the homes of Congress leader Pratap Singh Khachariyawas and AAP MLA Kulwant Singh as part of a  ₹48,000-crore Ponzi fraud investigation.",
        "published_date": "Wed, 16 Apr 2025 12:30:27 +0530",
        "source": "Mint Politics",
        "source_country": "India",
        "countries_mentioned": [
            "Australia",
            "India"
        ],
        "content": "The Enforcement Directorate (ED) on Tuesday raided the premises of Rajasthan Congress leader and former minister Pratap Singh Khachariyawas and Punjab AAP MLA Kulwant Singh as part of a ₹48,000-crore PACL Ponzi \"fraud\"-linked money laundering probe, official sources said.\n\nAbout 15 premises including Khachariyawas' house in Jaipur and Singh's premises in Punjab's Mohali apart from some others are being searched by the federal probe agency.\n\nA security team of the CRPF has also been deployed with the ED teams at both the locations linked to the politicians.\n\nThe 55-year-old Congress leader served as minister for transport, food and civil supplies in the cabinet of former chief minister Ashok Gehlot. He has represented the Civil Lines (Jaipur) seat in the Rajasthan assembly.\n\nSingh, 63, is the promoter of a real estate firm named Janta Land Promoters Limited (JLPL). He is reported to be Punjab's richest MLA with assets reportedly worth ₹1,000 crore.\n\nAddressing reporters outside his ancestral house here, Khachariyawas, nephew of former vice president Bhairon Singh Shekhawat, said the ED action was \"politically motivated\" because he has been speaking against the government.\n\nHe asserted he had done nothing wrong and that he was \"not afraid\" of the ED.\n\nThere was no response till evening hours from Singh or his family on the ED action.\n\nThe money laundering investigation of 2015 stems from a Central Bureau of Investigation (CBI) FIR against PACL India Limited, PGF Limited, the late PACL promoter Nirmal Singh Bhangoo and others for operating \"fraudulent\" investment schemes to deceive investors.\n\nThrough these schemes, PACL and its directors \"defrauded\" the investors of about ₹48,000 crore, according to the ED.\n\nAlleged \"proceeds of crime\" are suspected to have been diverted to various entities including those linked to Khachariyawas, the sources claimed.\n\nAs the news about the ED raids broke, supporters of Khachariyawas gathered outside his residence and raised slogans.\n\n\"They have brought a notice to search the premises. They have not given notice linking it to any company. Premises can be searched anywhere in the country, it is their right. I am neither afraid nor nervous,\" Khachariyawas told reporters.\n\n\"If there is any issue, I will respond. There are six lawyers from my side,\" he said.\n\nThe ED had carried out raids in this case in March against Bhangoo's daughter Barinder Kaur, her husband Harsatinder Pal Singh Hayer and her \"close associate\" Manoj Kumar. Before these searches, it arrested Hayer.\n\nBhangoo died in August last year.\n\nThe agency has attached assets worth ₹706 crore, including two immovable properties worth ₹462 crore in Australia, and filed two charge sheets against PACL, Bhangoo and others.\n\nKhachariyawas claimed that the ED had come to search his house to scare him.\n\n\"The BJP is arrogant. It has been in power at the Centre for 11 years and it is also in power in Rajasthan. I have been speaking against them and therefore they have taken this action, but I am not going to get scared,\" he said, adding that he will continue raising his voice against the government.\n\nKhachariyawas alleged the ED takes action without any reason.\n\n\"They called our leader Rahul Gandhi. When they give a reason, I will respond. So far, the ED has not given any reason for the search,\" he said.\n\nHe said the BJP government should not do politics through the ED.\n\nThe former minister also said he has nothing to do with any company.\n\nKhachariyawas said he lives in a joint family and such actions disturb the entire family.\n\n\"I will now build a new house, name it 'Kranti House' and start a revolt from there so that my family is not disturbed,\" he said.\n\nCondemning the raids, Gehlot claimed the action is because Khachariyawas remains vocal against the BJP government.\n\nLeader of Opposition in the Rajasthan Assembly Tikaram Jully termed the action against Khachariyawas “political revenge”.\n\n\"Former minister and senior Congress leader Pratap Singh Khachariyawas has been raising his voice against the BJP government. Fearing this, the BJP government has sent central agencies to his house,\" Jully posted on X.\n\n\"In 2020 also, an attempt was made to harass him in a similar manner. This action being taken against Pratap Singh Khachariyawas in the spirit of political revenge is condemnable,\" he said.\n\nRajasthan's Parliamentary Affairs Minister Jogaram Patel, however, dismissed the Congress allegations as baseless.",
        "news_type": "Politics"
    },
    {
        "title": "Farooq Abdullah slams AS Dulat’s Article 370 abrogation claim as ‘cheap stunt’; Ex-R&amp;AW chief defends memoir",
        "link": "https://www.livemint.com/news/farooq-abdullah-slams-dulat-s-article-370-claims-as-cheap-stunt-ex-r-aw-chief-defends-memoir-full-of-praise-11744819126288.html",
        "description": "Farooq Abdullah rejected Amarjit Singh Dulat's claims of private support for Article 370's abrogation, calling them a cheap stunt for his memoir. Abdullah emphasized his opposition to the move and criticized Dulat's portrayal of their relationship and the accuracy of the memoir.",
        "published_date": "Wed, 16 Apr 2025 22:58:20 +0530",
        "source": "Mint News",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Former Jammu and Kashmir chief minister Farooq Abdullah has fiercely rejected claims by ex-R&AW chief Amarjit Singh Dulat that he had “privately backed” the abrogation of Article 370, describing them as a “cheap stunt” designed to boost sales of Dulat’s forthcoming memoir, The Chief Minister and the Spy, due for release on 18 April.\n\nIn response, the ex R&AW chief has claimed that he has been ‘misquoted’. “My book is full of praise for Farooq Abdullah, there is nothing against him,”, Dulat said.\n\nDulat’s Allegations and Abdullah’s Response Dulat’s book alleges that Abdullah and his National Conference (NC) might have supported the removal of Jammu and Kashmir’s special status had they been consulted, and that the party would have helped pass a resolution in the assembly if taken into confidence.\n\nAbdullah, now 87, dismissed these assertions as “fiction” and “a figment of the author’s imagination,” insisting that both he and his son Omar Abdullah were detained for months at the time of the abrogation in August 2019 precisely because their opposition to the move was well known.\n\nNo Assembly, No Resolution Farooq Abdullah was scathing about the suggestion that the NC could have facilitated the passage of a resolution to revoke Article 370. He pointed out that there was no legislative assembly in 2018, as it had already been dissolved. “A benchmark of common sense should have been adopted by the author while penning the so-called memoirs\", the ex J&K CM said.\n\n\"He should have remembered that there was no assembly in 2018, which could have been dissolved,” Abdullah remarked.\n\nChampioning Special Status for Kashmir Farooq Abdullah reiterated his consistent stance in defence of Jammu and Kashmir’s special status. He highlighted his role in bringing together major political forces in the region to form the People’s Alliance for Gupkar Declaration (PAGD), a coalition committed to restoring the state’s autonomy.\n\nAbdullah emphasised that his record, including passing a resolution for greater autonomy when he held a two-thirds majority in 1996, contradicts Dulat’s claims.\n\nOn Relationship with Dulat and the BJP Abdullah also refuted Dulat’s portrayal of their relationship, rejecting the notion that he was easily influenced by the former spy chief. “The author claims that Abdullah would always listen to his advice, which is yet another example of underestimating me. I am a man of my own mind, and I only decide. I am not anyone’s puppet,” he asserted.\n\nHe further dismissed suggestions that the NC sought closer ties with the BJP, calling it “an absolute lie” and reaffirming his unwillingness to associate with a party he accuses of seeking to “destroy” his own.\n\nDisputing the Memoir’s Accuracy Farooq Abdullah described Dulat’s memoir as riddled with inaccuracies, likening it to “fiction” and stating he abandoned reading it partway through. He also challenged specific claims, such as Dulat’s alleged advice on cabinet size in 1996, pointing out factual errors in the account.\n\n“Wound That Lasts a Lifetime” Expressing disappointment, Abdullah said Dulat’s actions had left a lasting wound: “The worst is that he claims to be my friend, and as has been said, ‘Stab the body and it heals, but injure the heart, and the wound lasts a lifetime.’ I guess his inaccuracies just for cheap publicity would last a lifetime now”.\n\n‘My Book is Full of Praise’ Amid a political storm in Jammu and Kashmir over some mentions concerning Farooq Abdullah in his new book 'The Chief Minister and the Spy', former RAW Chief Amarjit Singh Dulat has said that the \"book is full of praise\" for the former Jammu and Kashmir Chief Minister and has \"nothing against him\".",
        "news_type": "Politics"
    },
    {
        "title": "Congress holds nationwide protest over ED chargesheet against Gandhis in National Herald case | Watch",
        "link": "https://www.cnbctv18.com/india/politics/congress-holds-nationwide-protest-over-ed-chargesheet-against-gandhis-in-national-herald-case-watch-19589609.htm",
        "description": "ED filed a chargesheet against congress leaders Rahul Gandhi and Sonia Gandhi alleging money laundering in the National Herald Case, at Rouse Avenue Court in Delhi, on April 9, which was examined by special judge Vishal Gogne on April 15. The judge posted the next hearing for the matter on April 25.",
        "published_date": "Wed, 16 Apr 2025 14:31:51 +0530",
        "source": "CNBC Politics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "\n\n#WATCH | Congress workers hold a protest against the central government at their 24, Akbar Road party office in Delhi.\n\nThe party is holding a nationwide protest in front of Enforcement Directorate offices at the State Headquarters and in front of Central Government offices at… pic.twitter.com/Yj1aAKDGry\n\n\n\n— ANI (@ANI) April 16, 2025\n\n\n\n#WATCH | Heavy security deployed outside Congress Office in Delhi's Akbar Road\n\nCongress to hold a nationwide protest in front of Enforcement Directorate offices at the State Headquarters and in front of Central Government offices at the district level in the respective states… pic.twitter.com/82sAjAvHeO\n\n\n\n— ANI (@ANI) April 16, 2025\n\n\n\nVIDEO | Police detain Delhi Congress president Devender Yadav (@devendrayadvinc) and other party workers during protest against the Centre over the Enforcement Directorate filing a chargesheet against Sonia Gandhi, Rahul Gandhi and others on charges of money laundering in the… pic.twitter.com/In8wnCFp7C\n\n— Press Trust of India (@PTI_News) April 16, 2025\n\n\n\nVIDEO | Delhi: Police remove Congress workers protesting against the Centre over the Enforcement Directorate filing a chargesheet against Sonia Gandhi, Rahul Gandhi and others on charges of money laundering in the National Herald case.#NationalHeraldCase #DelhiNews\n\n(Full video… pic.twitter.com/an4sfJVU4E\n\n\n\n— Press Trust of India (@PTI_News) April 16, 2025\n\n\n\nThe Modi-Shah regime’s vendetta against the Opposition knows no bounds. The witch hunt against Smt. Sonia Gandhi ji and LOP Sh. @RahulGandhi ji, using the frivolous, politically motivated & fabricated National Herald case, is a clear example of their attempt at intimidation and…\n\n— K C Venugopal (@kcvenugopalmp) April 15, 2025\n\n₹\n\n₹\n\n\n\n#WATCH | Delhi | On ED's prosecution complaint against Rahul Gandhi, Sonia Gandhi and others in alleged National Herald money laundering case, BJP MP Ravi Shankar Prasad says, \"One thing should be kept in mind that Rahul Gandhi and Sonia Gandhi are out on bail. They knocked on… pic.twitter.com/FNZCAPdS4w\n\n— ANI (@ANI) April 16, 2025\n\nCongress leaders and partyworkers held nationwide protest on Wednesday (April 16) opposing the chargesheet filed by the Enforcement Directorate (ED) against senior leaders Sonia Gandhi, Rahul Gandhi in the National Herald Case.Congress slammed the Bharatiya Janata Party (BJP)-led Central government, for misusing the central agency to suppress the Opposition party in the country.Congress members started protests outside the party office at Akbar Road in New Delhi, with demonstrations gradually spreading out to the ED office and party offices across the country.ED filed a chargesheet against Congress leaders Rahul Gandhi and Sonia Gandhi alleging money laundering in the National Herald Case, at Rouse Avenue Court in Delhi, on April 9, which was examined by special judge Vishal Gogne on April 15. The judge posted the next hearing for the matter on April 25.The ED chargesheet also named Congress members Sam Pitroda and Suman Dubey as accused.The Congress, on April 15, called for nationwide protests against the BJP government and the ED action.The protests have sparked debate over the agency's position as being a puppet of the Union government, and a spar between the BJP and Congress workers along with their supporters online.With Congress leaders accusing the BJP of misusing the agency for its political gains, BJP members stated that Congress was afraid of the action due to its role in the case.Congress national spokesperson Jairam Ramesh called the action \"political vendetta\" and a \"state-sponsored crime\".\"Seizing the assets of the National Herald is a state-sponsored crime masquerading as the rule of law. Filing chargesheets against Smt. Sonia Gandhi, Rahul Gandhi, and some others is nothing but the politics of vendetta and intimidation by the PM and the HM gone completely berserk. The INC and its leadership will not be silenced. Satyameva Jayate,\" Ramesh wrote on X (formerly Twitter).BJP spokesperson CR Kesavan said the protests against the agency's action only raised more suspicion on the role of Congress leaders.\"Rahul Gandhi and Sonia Gandhi, who are out on bail in the National Herald case, may be above the rules and constitution of the dynastic Congress party but they are not above Dr Babasaheb Ambedkar's Constitution where everybody is equal before the law of the land,\" Kesavan told PTI.\"Protest against the chargesheet by the Congress party today in an effort to intimidate the agencies only raises more serious suspicions about the integrity of the Congress leadership in the National Herald case,\" he added.Congress MP KC Venugopal slammed Prime Minister Narendra Modi and Home Minister Amit Shah for the ED action by calling it a witch-hunt against the Congress leaders to silence the opposition.\"The Modi-Shah regime’s vendetta against the Opposition knows no bounds. The witch hunt against Smt. Sonia Gandhi ji and LOP Sh. @RahulGandhi ji, using the frivolous, politically motivated & fabricated National Herald case, is a clear example of their attempt at intimidation and silencing of opposition voices,\" he wrote on X.Meanwhile, BJP MP Ravi Shankar Prasad said the Congress does not have a right to misappropriate government funds accusing the party leaders of money laundering.\"Congress party has the right to protest, but it does not have the right to misappropriate government properties and give it to the National Herald... A corporate conspiracy was hatched in a very interesting way to get this entire property into the hands of the family...\" Prasad told reporters at a press conference.\"And what are these properties- one property on Bahadur Shah Zafar Marg in Delhi, properties in Mumbai, Lucknow, Bhopal, and Patna. Young India Limited was supposed to be a charitable organisation, but till now, it is not known what charity it did... Writing off90 crores for50 lakhs and acquiring property worth thousands of crores...\" he added.(With agency inputs)",
        "news_type": "Politics"
    },
    {
        "title": "CM Mamata says Murshidabad violence was pre-planned, appeals to PM to keep a check on Amit Shah",
        "link": "https://www.cnbctv18.com/india/politics/cm-mamata-says-murshidabad-violence-was-pre-planned-appeals-to-pm-to-keep-a-check-on-amit-shah-19589714.htm",
        "description": "Violent protests erupted on April 11 and 12 in pockets of the district, including Suti, Dhulian, and Jangipur, following anger over the amended Waqf Act. The demonstrations soon escalated into clashes, leaving at least three people dead and several injured.",
        "published_date": "Wed, 16 Apr 2025 14:08:59 +0530",
        "source": "CNBC Politics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "#WATCH | During her meeting with Muslim clerics, West Bengal CM Mamata Banerjee says \"Yesterday, I saw a tweet from ANI quoting the Home Ministry that Bangladesh is involved in this (Murshidabad violence). If this is true, the Central Govt is responsible for it. BSF takes care of… https://t.co/yEW3bqGqrB pic.twitter.com/ubcrMMuTVP — ANI (@ANI) April 16, 2025\n\nWest Bengal Chief Minister Mamata Banerjee on Wednesday (April 16) said the communal riot in the Murshidabad district was pre-planned. She accused the Bharatiya Janata Party (BJP) of planning to engineer riots during Ram Navami.The Trinamool Congress supremo appealed to Prime Minister Narendra Modi not to allow any 'atrocious law' and to also keep a check on Union Home Minister Amit Shah. The remarks came during her meeting with Muslim clerics and religious leaders of the Muslim community regarding the Waqf Amendment Act.\"BJP planned to engineer riots during Ram Navami, but failed; I will not allow division of people, I want unity. We will recall all anti-people Bills passed by BJP after dislodging it from power at Centre,\" Mamata said.Security has been tightened outside Netaji Indoor Stadium in Kolkata where the meeting was held. Violent protests erupted on April 11 and 12 in pockets of the district, including Suti, Dhulian, and Jangipur, following anger over the amended Waqf Act. The demonstrations soon escalated into clashes, leaving at least three people dead and several injured.Personnel of the BSF, CRPF, state police and RAF have been deployed in large numbers in Jangipur, Dhuliyan, Suti and Shamsherganj, where no new incident of violence was reported in the past 48 hours, officials said.On reports of Bangladeshi radicals involved in the violence, she asked, \"Isn’t it BSF's duty to guard boundary?\"Reports said Bangladeshi radicals, allegedly aided by local leaders of a political party, were \"involved\" in the recent violence triggered by anti-Waqf law agitations in Murshidabad. Report said members of two Bangladesh-based radical outfits — Jamaat-ul Mujahideen Bangladesh (JMB) and Ansarullah Bangla Team (ABT) — were allegedly involved in the violence in Murshidabad, which left three persons dead.The Chief Minister announces ₹10 lakh as ex gratia for each family of three persons who died in the violence.Meanwhile, the National Commission for Women (NCW) has constituted an inquiry committee to investigate alleged molestation and displacement of women during the recent communal violence in Murshidabad. It said NCW Chairperson Vijaya Rahatkar has taken suo motu cognisance of the incident and will visit the affected areas to assess the situation and meet victims.",
        "news_type": "Politics"
    },
    {
        "title": "Maharashtra reduces payout to ₹500 for nearly 8 lakh women under Ladki Bahin Yojana",
        "link": "https://www.cnbctv18.com/india/politics/maharashtra-reduces-payout-to-rs-500-for-nearly-8-lakh-women-under-ladki-bahin-yojana-19589507.htm",
        "description": "State Minister Aditi Tatkare said in line with the policy, the difference of ₹500 is being paid to 7,74,148 women who are receiving ₹1,000 per month under the Namo Shetkari Samman Yojana.",
        "published_date": "Wed, 16 Apr 2025 09:20:20 +0530",
        "source": "CNBC Politics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "₹\n\n₹\n\n₹\n\n₹\n\n₹\n\n₹\n\n₹\n\nMaharashtra's flagship Mukhyamantri Majhi Ladki Bahin Yojana, a key welfare scheme has once again found itself at the centre of political controversy. The state government has reduced the number of active beneficiaries by 17 lakh, and cut monthly financial benefits for another 7.7 lakh women.According to the government data, these 7.7 lakh women were earlier receiving1,500 per month under the scheme, but are now receiving only500. The state clarified that this adjustment is because these beneficiaries are receiving1,000 per month under the Namo Shetkari Mahasamman Nidhi, and the Ladki Bahin scheme allows for a maximum combined monthly benefit of1,500.Maharashtra Women and Child Development Minister Aditi Tatkare said in line with the policy, the difference of500 is being paid to 7,74,148 women who are receiving1,000 per month under the Namo Shetkari Samman Yojana.\"No eligible woman has been excluded from the Ladki Bahin scheme, and no change has been made in the said process after July 3, 2024,\" said the Nationalist Congress Party leader, adding that she has clarified about the same during the budget session of the state legislature.The process of scrutinising the list of beneficiaries began soon after the formation of the new government. In December 2024, the government had announced that all beneficiaries would be re-evaluated and anyone found ineligible would be removed from the scheme. Disqualification criteria include owning a four-wheeler or having a family income exceeding2.5 lakh per annum.Before this re-evaluation, the scheme had 2.63 crore beneficiaries. However, for the months of February and March 2025, benefits were transferred to only 2.46 crore women, a drop of 17 lakh recipients.The move has sparked criticism from the Opposition, which alleges that the BJP-led Mahayuti government used the scheme to secure votes before the elections and is now withdrawing benefits. The Opposition claimed the move is a betrayal of women voters, accusing the government of vote-buying tactics followed by post-election rollbacks.\"On the eve of the elections, the Mahayuti coalition promised a farm loan waiver, and after forming a government, it asked farmers to repay their loans. Women are being removed from the list of beneficiaries of the Ladki Bahin scheme citing various reasons. The corrupt Mahayuti government is betraying the trust of the people,\" said State Congress president Harshwardhan Sapkal.",
        "news_type": "Politics"
    },
    {
        "title": "Commerce Ministry plans support scheme for e-commerce exporters’ short-term credit needs",
        "link": "https://www.cnbctv18.com/economy/commerce-ministry-proposal-e-commerce-exporter-short-term-credit-ws-l-19590040.htm",
        "description": "India's Commerce Ministry is preparing a proposal to address short-term credit needs of e-commerce exporters amid minimal export growth in FY25, with total exports rising by just 0.08% to $437.42 billion.",
        "published_date": "Wed, 16 Apr 2025 22:59:00 +0530",
        "source": "CNBC Economics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Amid minimal year-on-year growth in overall exports for the 2024-25 financial year (FY25), sources have indicated that the Commerce Ministry is preparing a proposal to address the short-term credit requirements of e-commerce exporters.India’s total exports in FY25 rose by just 0.08% year-on-year, reaching $437.42 billion.According to sources, discussions are ongoing between the Commerce Ministry and the Reserve Bank of India (RBI) to expedite the reconciliation of export payments. This forms part of a broader government effort to boost e-commerce exports.The proposal includes support for exporters with overseas warehouses through lower borrowing costs. A note is also being prepared for approval by the Expenditure Finance Committee to further encourage exports.At present, India’s e-commerce exports stand at approximately $5 billion, in sharp contrast to China’s $250 billion.Earlier this year, the government stated that joint efforts were being made by the Department of Revenue, the Ministry of Commerce and Industry, and the Bureau of Civil Aviation Security (BCAS) to develop a Standard Operating Procedure (SOP) for the establishment of e-commerce export hubs.",
        "news_type": "Economics"
    },
    {
        "title": "View | Fentanyl and Trump tariffs",
        "link": "https://www.cnbctv18.com/world/view-fentanyl-and-trump-tariffs-19589972.htm",
        "description": "Trump’s fentanyl-linked tariffs on China escalate US trade tensions. How an opioid crisis triggered global economic risks and a 145% (now 245%) tariff shock.",
        "published_date": "Wed, 16 Apr 2025 20:27:12 +0530",
        "source": "CNBC Economics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Who would have thought that an opioid drug could trigger a global trade disruption—one that now threatens to push the world’s largest economy into a recession?It may be recalled that President Trump, in his executive order dated February 1, 2025 (Imposing Duties to Address the Synthetic Opioid Supply Chain in the People’s Republic of China (PRC)), determined that the People's Republic of China (PRC) had failed to stem the sustained influx of synthetic opioids, including fentanyl. The order stated that these drugs posed an unusual and extraordinary threat to the national security, foreign policy, and economy of the United States.The executive order concluded that the PRC had not taken adequate steps to alleviate the drug crisis; fentanyl continued to be illegally imported under false invoices, fraudulent postage, and deceptive packaging. This had resulted in the seizure of over 500,000 pounds of drugs and the deaths of thousands of Americans. The order declared a national emergency under the National Emergencies Act and invoked powers under the International Emergency Economic Powers Act. This Act authorises the President to regulate international commerce in response to such threats. An additional 10% ad valorem duty was imposed on all products from the PRC entering the USA.Subsequent executive orders—culminating in the latest on 9 April—shifted focus towards addressing the large and persistent annual US goods trade deficits. Tariffs were imposed on imports from all countries. With regard to the PRC, the dual conclusion—that the PRC had not done enough to curb the production and smuggling of fentanyl, and that the trade deficit with the PRC remained vast—resulted in an unprecedented 145% (now 245%) levy on all goods imported from China. Further, the de minimis exemption (normally applicable to imports valued under $800) was withdrawn for PRC-origin goods. All e-commerce shipments from China are now subject to elevated tariffs.What then is fentanyl, and why is it of such concern to the United States?Fentanyl is a potent synthetic opioid, approved by the US Food and Drug Administration (FDA) as an analgesic and anaesthetic. The Drug Enforcement Administration (DEA) has stated that it is 100 times more potent than morphine and 50 times more potent than heroin—and extremely addictive. Just 2 milligrams—the size of a few grains of sand—can lead to overdose. It can be injected, snorted, smoked, taken as a pill, spiked onto blotter paper, and is often sold alone or in even more lethal combinations. Its effects include rapid relaxation, euphoria, dizziness, nausea, respiratory depression—and frequently, death.First developed in 1959, fentanyl was used widely for medical purposes before its potency and addictive potential were discovered by drug traffickers. It is often called the trafficker’s perfect drug—unlike cocaine or opium, it does not require land for cultivation. A small clandestine lab can produce massive quantities undetected. As profits soared, illicit manufacturing units flourished. Addicts became akin to zombies; the collateral social cost included crime committed to fund addiction, and rising drug overdose deaths.According to the DEA, over 75,000 deaths occur annually in the US from fentanyl overdoses—a figure which rose to 90,000 by August 2024. A vast majority are linked directly to fentanyl. In this light, President Trump’s claim that \"these drugs are threatening the fabric of our society\" may not be entirely exaggerated.The US has long believed that illegal fentanyl supplies originate primarily from China and Mexico. While China claims to have placed all fentanyl-type substances under regulatory control, the US contends enforcement has been lax. There is little visibility of China's effort to curb illicit production. Chinese criminal groups have entered the trade, lured by enormous profits and a vast US market.The Biden administration initiated measures placing China on the US list of major drug-producing and transit countries. Enforcement actions and sanctions were taken against designated individuals and entities. However, Trump has now weaponised the fentanyl issue, imposing a 145% tariff to counter the crisis. Whether this approach addresses the problem is debatable. After all, where there is demand, there will be supply—licit or otherwise. Drug abuse stems from deep social and psychological pressures that must also be addressed.The DEA has also stated that India is a source of finished fentanyl powder and precursor chemicals. However, the website of India’s Narcotics Control Bureau (NCB)—the nodal anti-drug agency—does not list fentanyl among its drugs of concern. The Directorate of Revenue Intelligence (DRI), which has made significant seizures of methamphetamine, mephedrone, and pseudoephedrine in recent years, has not reported any fentanyl seizures.Yet, earlier this year, the US Attorney’s Office released a statement regarding legal action taken against two Surat-based companies, including their founder and a senior executive, for criminal conspiracy to distribute and import fentanyl precursor chemicals. The charge sheet alleged a false declaration in the manifest—describing the contents as vitamin C, which were actually found to be piperidone, a fentanyl precursor.Indian enforcement agencies must take note of these developments and crack down strongly on the manufacture and export of fentanyl or its precursors. As India already grapples with the impact of 10% tariffs, the last thing it needs is further tariffs imposed for perceived laxity in drug enforcement.— The author, Najib Shah, is former Chairman, Central Board of Indirect Taxes & Customs. The views expressed are personal.Read his previous articles here",
        "news_type": "Politics"
    },
    {
        "title": "Explained | How Trump's 'up to 245%' China tariffs affect different goods",
        "link": "https://www.cnbctv18.com/business/trump-tariffs-us-china-trade-tensions-new-rates-explained-245-pc-tariff-ws-l-19589970.htm",
        "description": "Donald Trump imposed new tariffs on Chinese imports, up to 245%, in response to China's export controls on raw materials, affecting products like medical devices, electronics, and clothing. Here's a deep dive into the different products the new tariffs will affect.",
        "published_date": "Wed, 16 Apr 2025 20:12:04 +0530",
        "source": "CNBC Economics",
        "source_country": "India",
        "countries_mentioned": [
            "Australia",
            "India"
        ],
        "content": "Product Category Tariff Imposed Syringes and needles 245% Lithium-ion batteries 173% Squid (seafood) 170% Wool sweaters 169% Plastic dishes 159% Toasters 150% Electric vehicles 148% Toys, dolls, puzzles 145% Vitamin C 145% Aluminium foil 75% Car wheels 73% Semiconductors 70% Metal furniture 70% Car door hinges 67% Laptops 20% Children’s books 0%\n\nDuties explained\n\n\n\n0% base tariff.\n\n\n\n20% “fentanyl-related” penalty tariff.\n\n\n\n125% “reciprocal” tariff in response to China’s trade barriers.\n\n\n\n\n\n16% base tariff.\n\n\n\n7.5% pre-2025 Section 301 tariff.\n\n\n\n20% “fentanyl-related” penalty tariff.\n\n\n\n125% “reciprocal” tariff aimed at matching China’s trade restrictions.\n\n\n\nDonald Trump has cranked up the trade tensions between the United States and China by imposing sweeping new tariffs on Chinese imports. Some of the US president's latest tariffs on his favourite bugbear touch 245%. This move is part of Trump's 'America First' trade policy and is the latest in a series of tit-for-tat tariffs imposed by each nation on the other.A White House factsheet, released on Tuesday (April 15) night, described these tariffs as a direct response to China’s recent export controls on critical raw materials and its retaliatory tariffs targeting American exports.The Trump administration accused Beijing of weaponising its control over supply chains by restricting the export of key minerals such as gallium, germanium, and antimony, as well as, more recently, rare earth magnets and six heavy rare earth elements vital to aerospace, defence, and semiconductor manufacturing.“China now faces up to a 245% tariff on imports to the United States as a result of its retaliatory actions,” the White House stated.In response to the intensifying tariff war, White House Press Secretary Karoline Leavitt said President Trump remains open to a trade deal with China, but Beijing must take the first step. Meanwhile, China said it is open to a trade deal only if the US treats it with respect, and appointed a new point-person for whenever these negotiations take place.The impact is extensive, affecting a wide range of products from medical devices to electronics and clothing. Here is a table summarising the new tariff structure, as reported by the New York Times:According to the US Department of Commerce, a significant proportion of China’s exports to the United States are electronics, including smartphones and accessories. In 2022, mechanical appliances, recorders, and televisions accounted for 46.4% of all imports from China.As per the New York Times, in 2024, the United States imported approximately $52 billion worth of smartphones, with over 80% sourced from China. While smartphones from China were initially subject to tariffs of up to 145%, recent customs guidance has exempted laptops and smartphones from the 125% reciprocal tariff on most Chinese goods. However, these devices remain subject to new import taxes introduced earlier in the year.0% base tariff + 20% fentanyl tariff = 20% total tariff rateSyringes and needles now face some of the highest tariff rates, having been targeted by both the previous Trump administration and the Biden administration. In September 2024, the Biden administration imposed a 100% tariff on these items to protect American manufacturing and adopt a firm stance against China.Tariffs on Chinese goods can range from 7.5% to 100%, affecting a variety of products such as clothing, solar panels, and electric vehicles. The latest round of tariffs means American importers will now contend with a 245% tariff on syringes and needles, more than doubling the cost of these products.China remains a leading supplier of textiles, furniture, and various consumer goods. According to the Commerce Department, nearly 30% of textile imports into the United States originate from China. Additionally, over 50% of imports in categories such as furniture and bedding, lamps, toys and games, sports equipment, and miscellaneous manufactured goods are sourced from Chinese producers.Until recently, items such as tricycles, stuffed animals, dolls, and puzzles entered the United States duty-free, keeping prices affordable for American consumers. That is no longer the case.The new tariff rate on toy imports from China is 145%, comprising:Clothing imports have also been affected. Sweaters now face a total tariff of 168.5%, composed of:The tariff structure is not uniform — it varies according to material origin, product category, and any specific exemptions. Businesses will need to undertake detailed supply chain analyses to determine whether their products are affected, and how much of the increased cost can be absorbed or passed on to consumers.The high tariff on lithium-ion batteries (173%), for example, will directly affect electric vehicle manufacturers, electronics brands, and battery storage companies, especially those sourcing from Chinese factories. Meanwhile, the 70% duty on semiconductors could increase cost pressures on US technology firms already struggling with chip shortages.",
        "news_type": "Politics"
    },
    {
        "title": "Andhra Pradesh eyes 15% annual growth, $2.4-trillion economy by 2047: Nara Lokesh",
        "link": "https://www.cnbctv18.com/economy/andhra-pradesh-eyes-15-pc-annual-growth-usd-2-4-trillion-economy-by-2047-it-minister-nara-lokesh-20-lakh-jobs-it-jobs-19589935.htm",
        "description": "Speaking to CNBC-TV18 in an exclusive interview on the state’s fiscal position, Lokesh acknowledged that the current administration had inherited significant liabilities from the previous government. 'Yes, we had huge spending obligations and inherited payments, but we are now the second fastest-growing state in the country,' he said.",
        "published_date": "Wed, 16 Apr 2025 19:54:45 +0530",
        "source": "CNBC Economics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Despite a mounting debt burden of nearly ₹10 lakh crore, Andhra Pradesh is targeting rapid economic expansion with an ambitious vision of becoming a $2.4-trillion economy by 2047, said Nara Lokesh, Andhra Pradesh Minister for IT and Electronics\n\nSpeaking to CNBC-TV18 in an exclusive interview on the state’s fiscal position, Lokesh acknowledged that the current administration had inherited significant liabilities from the previous government. “Yes, we had huge spending obligations and inherited payments, but we are now the second fastest-growing state in the country,” he said.\n\nOutlining the roadmap ahead, Lokesh said the government is committed to achieving a 15% year-on-year growth rate by prioritising ease of doing business and aggressively attracting investments. “The only way we can achieve all this is through speed of doing business and aligning all ministries toward the singular goal of job creation,” he said.\n\nAlso Read: Andhra Pradesh to revamp IT policy, companies must create 500 jobs per acre for land subsidy\n\nHe noted that this focused approach would not only accelerate growth but also create the fiscal space needed to fulfil electoral promises. “With this singular focus, we believe we can grow faster than any other state, which will enable us to deliver on our poll commitments to the people of Andhra Pradesh,” Lokesh added.\n\nLokesh confirmed that the state intends to formalise this approach through policy, inviting more IT companies to set up operations in Visakhapatnam with similar incentives. “This is going to come about as a policy and we are going to encourage more and more IT companies to come and set up shop in Visakhapatnam and give favourable terms for them too,” he said.\n\nThe government’s focus is firmly on job creation in the city. “If you look at it as one of our promises to create 20 lakh jobs in the state of Andhra Pradesh, both in the private and the government sector, the cornerstone of that is creating IT jobs. We are not going to leave any stone unturned in terms of attracting investments,” Lokesh said.\n\nAlso Read: Andhra Pradesh sells 21.16 acres land to TCS for 99 paise to boost Vizag’s IT ambitions",
        "news_type": "Politics"
    },
    {
        "title": "US Vice President JD Vance to visit India next week amid trade tensions",
        "link": "https://www.cnbctv18.com/world/us-vice-president-jd-vance-to-visit-india-next-week-amid-trade-tensions-19590011.htm",
        "description": "The visit, scheduled from April 18 to 24, will take the Second Family to New Delhi, Jaipur, and Agra, the US vice president’s office said in a statement. The couple will be accompanied by their three children — Ewan, Vivek, and Mirabel — and are expected to take part in cultural and official events across India.",
        "published_date": "Wed, 16 Apr 2025 21:09:22 +0530",
        "source": "CNBC World",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "US Vice President JD Vance and his wife Usha Vance, the first Indian-American Second Lady, will visit India next week for a series of engagements that include bilateral talks with Prime Minister Narendra Modi, as Washington and New Delhi navigate turbulent trade relations amid escalating tariff tensions.The visit, scheduled from April 18 to 24, will take the Second Family to New Delhi, Jaipur, and Agra, the US vice president’s office said in a statement. The couple will be accompanied by their three children — Ewan, Vivek, and Mirabel — and are expected to take part in cultural and official events across India.“In India, the Vice President will hold meetings with Prime Minister Modi and discuss shared economic and geopolitical priorities,” the statement said.The trip comes as President Donald Trump’s administration continues to ratchet up tariffs on Chinese imports, igniting fears of a global economic slowdown. Trump recently announced a 90-day pause on the new reciprocal tariffs for most countries — excluding China — following mounting international pressure.Vance’s visit to India is expected to have both official and personal components, people familiar with the planning said. His meeting with Modi, likely to take place on April 21, is expected to cover various dimensions of the India–US relationship, including ongoing negotiations for a bilateral trade agreement (BTA) and concerns related to recent tariff policies.Vance’s stop in India follows a visit by US Director of National Intelligence Tulsi Gabbard, who met senior Indian leaders, including Prime Minister Modi, Defence Minister Rajnath Singh, External Affairs Minister S. Jaishankar, and National Security Adviser Ajit Doval.A planned visit by US National Security Adviser Michael Waltz has been postponed, sources said, though it was initially expected to coincide with the Vice President's travel.Before arriving in India, Vance will travel to Italy, where he will meet Prime Minister Giorgia Meloni in Rome and hold discussions with Vatican Secretary of State Cardinal Pietro Parolin. He will also take part in ceremonial events in the lead-up to Easter Sunday at the Vatican.The high-level engagements reflect deepening cooperation between India and the United States amid shifting global trade alignments and geopolitical tensions.",
        "news_type": "Politics"
    },
    {
        "title": "View | Fentanyl and Trump tariffs",
        "link": "https://www.cnbctv18.com/world/view-fentanyl-and-trump-tariffs-19589972.htm",
        "description": "Trump’s fentanyl-linked tariffs on China escalate US trade tensions. How an opioid crisis triggered global economic risks and a 145% (now 245%) tariff shock.",
        "published_date": "Wed, 16 Apr 2025 20:27:12 +0530",
        "source": "CNBC World",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Who would have thought that an opioid drug could trigger a global trade disruption—one that now threatens to push the world’s largest economy into a recession?It may be recalled that President Trump, in his executive order dated February 1, 2025 (Imposing Duties to Address the Synthetic Opioid Supply Chain in the People’s Republic of China (PRC)), determined that the People's Republic of China (PRC) had failed to stem the sustained influx of synthetic opioids, including fentanyl. The order stated that these drugs posed an unusual and extraordinary threat to the national security, foreign policy, and economy of the United States.The executive order concluded that the PRC had not taken adequate steps to alleviate the drug crisis; fentanyl continued to be illegally imported under false invoices, fraudulent postage, and deceptive packaging. This had resulted in the seizure of over 500,000 pounds of drugs and the deaths of thousands of Americans. The order declared a national emergency under the National Emergencies Act and invoked powers under the International Emergency Economic Powers Act. This Act authorises the President to regulate international commerce in response to such threats. An additional 10% ad valorem duty was imposed on all products from the PRC entering the USA.Subsequent executive orders—culminating in the latest on 9 April—shifted focus towards addressing the large and persistent annual US goods trade deficits. Tariffs were imposed on imports from all countries. With regard to the PRC, the dual conclusion—that the PRC had not done enough to curb the production and smuggling of fentanyl, and that the trade deficit with the PRC remained vast—resulted in an unprecedented 145% (now 245%) levy on all goods imported from China. Further, the de minimis exemption (normally applicable to imports valued under $800) was withdrawn for PRC-origin goods. All e-commerce shipments from China are now subject to elevated tariffs.What then is fentanyl, and why is it of such concern to the United States?Fentanyl is a potent synthetic opioid, approved by the US Food and Drug Administration (FDA) as an analgesic and anaesthetic. The Drug Enforcement Administration (DEA) has stated that it is 100 times more potent than morphine and 50 times more potent than heroin—and extremely addictive. Just 2 milligrams—the size of a few grains of sand—can lead to overdose. It can be injected, snorted, smoked, taken as a pill, spiked onto blotter paper, and is often sold alone or in even more lethal combinations. Its effects include rapid relaxation, euphoria, dizziness, nausea, respiratory depression—and frequently, death.First developed in 1959, fentanyl was used widely for medical purposes before its potency and addictive potential were discovered by drug traffickers. It is often called the trafficker’s perfect drug—unlike cocaine or opium, it does not require land for cultivation. A small clandestine lab can produce massive quantities undetected. As profits soared, illicit manufacturing units flourished. Addicts became akin to zombies; the collateral social cost included crime committed to fund addiction, and rising drug overdose deaths.According to the DEA, over 75,000 deaths occur annually in the US from fentanyl overdoses—a figure which rose to 90,000 by August 2024. A vast majority are linked directly to fentanyl. In this light, President Trump’s claim that \"these drugs are threatening the fabric of our society\" may not be entirely exaggerated.The US has long believed that illegal fentanyl supplies originate primarily from China and Mexico. While China claims to have placed all fentanyl-type substances under regulatory control, the US contends enforcement has been lax. There is little visibility of China's effort to curb illicit production. Chinese criminal groups have entered the trade, lured by enormous profits and a vast US market.The Biden administration initiated measures placing China on the US list of major drug-producing and transit countries. Enforcement actions and sanctions were taken against designated individuals and entities. However, Trump has now weaponised the fentanyl issue, imposing a 145% tariff to counter the crisis. Whether this approach addresses the problem is debatable. After all, where there is demand, there will be supply—licit or otherwise. Drug abuse stems from deep social and psychological pressures that must also be addressed.The DEA has also stated that India is a source of finished fentanyl powder and precursor chemicals. However, the website of India’s Narcotics Control Bureau (NCB)—the nodal anti-drug agency—does not list fentanyl among its drugs of concern. The Directorate of Revenue Intelligence (DRI), which has made significant seizures of methamphetamine, mephedrone, and pseudoephedrine in recent years, has not reported any fentanyl seizures.Yet, earlier this year, the US Attorney’s Office released a statement regarding legal action taken against two Surat-based companies, including their founder and a senior executive, for criminal conspiracy to distribute and import fentanyl precursor chemicals. The charge sheet alleged a false declaration in the manifest—describing the contents as vitamin C, which were actually found to be piperidone, a fentanyl precursor.Indian enforcement agencies must take note of these developments and crack down strongly on the manufacture and export of fentanyl or its precursors. As India already grapples with the impact of 10% tariffs, the last thing it needs is further tariffs imposed for perceived laxity in drug enforcement.— The author, Najib Shah, is former Chairman, Central Board of Indirect Taxes & Customs. The views expressed are personal.Read his previous articles here",
        "news_type": "Politics"
    },
    {
        "title": "Explained: Why the US runs into trade deficits",
        "link": "https://www.cnbctv18.com/world/explained-why-the-us-runs-into-trade-deficits-19589933.htm",
        "description": "Why the United States consistently runs trade deficits, the role of the US dollar as the global reserve currency, and how historical policies—from Bretton Woods to Trump's tariffs—shaped global trade dynamics.",
        "published_date": "Wed, 16 Apr 2025 19:24:45 +0530",
        "source": "CNBC World",
        "source_country": "India",
        "countries_mentioned": [
            "United Kingdom",
            "India"
        ],
        "content": "While the world is still reeling from the high reciprocal tariffs announced by US President Donald Trump, he is not the first president to try solving America’s widening trade deficit by disturbing the global order. He is the third president to do so. But first, let us see why the US repeatedly runs into large trade deficits. The reason lies partly in the US dollar being the world’s reserve currency.India needs dollars to pay for imports from the US. But we also need dollars to pay for imports from Europe, China, the Middle East—indeed, from almost everywhere. So does nearly every country. As a result, we try to run a trade surplus with the US, or we attempt to attract dollars through capital investments from foreign funds. And so do other countries.The net result is that the US is forced into a deficit with most countries. This doesn’t mean the US is an injured party suffering to promote world trade. Quite the opposite—the US enjoys a unique privilege. When it runs a deficit, it merely prints dollars. After all, countries don’t hold their dollars as cash. They invest them in US government bonds.Thus, the US government runs up a fiscal deficit, issues bonds, and other countries buy them, enabling the US to finance both its fiscal and trade deficits at virtually no cost. It only pays the interest. Most countries envy this enormous advantage of the US.French Finance Minister Valéry Giscard d’Estaing famously called it “the exorbitant privilege.” Economist Barry Eichengreen put it more starkly:“It costs only a few cents for the Bureau of Engraving and Printing to produce a $100 bill, but other countries have to pony up $100 of actual goods and services in order to obtain one.” – Prof Barry EichengreenThe disadvantage for the US is that every country wants to devalue its currency against the dollar. This becomes especially painful during economic downturns, such as wars or global financial crises. Typically, global investors flee to the safest asset—the US dollar. So, the dollar strengthens during crises, making recovery harder for the US.Another major drawback is that US manufacturers lose competitiveness as rival countries keep their currencies artificially low. Germany and Japan outclassed US manufacturers from the 1960s to the 1980s. Since the 1990s, China has significantly eroded US manufacturing, in part by keeping the yuan undervalued.But let’s go back to how the US dollar became the world’s exchange currency. A globally accepted currency became increasingly necessary after the First World War, as industrialisation and improved transport systems boosted global trade.Until the Second World War, countries settled trade through the British pound, gold, or—in the case of French colonies—the French franc. But post-WWII, Europe was so devastated that the US dollar became the de facto medium of exchange.Under the Bretton Woods system, the US promised to back every dollar with an equivalent amount of gold, at a fixed rate of $35 per troy ounce. However, by the 1960s, the US had begun printing dollars recklessly—partly to fund the Vietnam War and other anti-communist campaigns and partly to support rising global trade. Eventually, it ran short of gold to back every dollar. In 1971, President Richard Nixon ended the gold standard and dismantled the Bretton Woods system.A floating exchange rate system replaced Bretton Woods. But the dollar remained the global reserve currency, and the need to run deficits continued. Through the 1970s and 1980s, Japanese—and, to some extent, German—goods began outcompeting US products, even within the American market. Mounting deficits once again became a burden for the US.In 1985, the US strong-armed Japan and Europe, particularly Germany—into signing the Plaza Accord, which forced them to appreciate their currencies against the dollar. As a result, the dollar depreciated by over 25% within a year against these currencies.Now, in 2025, we are witnessing a similar situation: US deficits are sky-high, and US manufacturing continues to be outclassed by Chinese goods. But this time, Trump doesn’t command the same clout the US held in 1985—especially over Japan and Germany, nations the US had once helped rebuild and protect post-WWII.Also, central banks’ dollar reserves are no longer large enough to meaningfully distort markets through dollar selling. Global trade and financial markets have grown too vast for any central bank to significantly influence currency values. The US, therefore, resorts to bullying tactics —through threats of high tariffs—to reduce its deficit and attempt to bring back manufacturing to the US.In its favour, it must be said that no viable alternative to the dollar as the global reserve currency has yet emerged. And here’s one more thought: if we are shocked by Trump’s sky-high tariffs and his erratic imposition and withdrawal of them, rest assured—this chaos is minor compared to the shock when the US ended the gold standard! That was monumental. We just don’t remember it because most of us weren’t around back then.As for how high reciprocal tariffs will work to end US deficits while keeping the dollar as the reserve currency—well, that’s a discussion for another day.",
        "news_type": "Politics"
    },
    {
        "title": "Trade Setup for April 17: Nifty looks to sustain above 23,500 supported by FII buying",
        "link": "https://www.cnbctv18.com/market/trade-setup-april-17-nifty-key-levels-to-watch-23500-fii-buying-bank-nifty-wipro-guidance-infosys-q4-results-shares-19589871.htm",
        "description": "The Nifty rose above 23,400 to end at a two-week high. Having moved above the hurdle of 200 day EMA at 23,360 levels, the index could advance towards another resistance at 23,870 levels in the near term, analysts believe.",
        "published_date": "Wed, 16 Apr 2025 20:22:06 +0530",
        "source": "CNBC Market",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "What do the Nifty 50 charts indicate?\n\nHere are the stocks to watch ahead of Thursday's trading session:\n\nAfter witnessing a sharp gain on Tuesday, the benchmark Nifty 50 index continued its upward momentum on Wednesday, extending its winning streak to a third consecutive session. The index rose above 23,400 to end at a two-week high.The market opened on a weak note and slipped further in the early part of the session. However, it recovered smartly from the lows and finally closed the day higher by 109 points at 23,437.Banks led the market higher, with Axis Bank, IndusInd Bank, and HDFC Bank emerging as the top Nifty contributors.Sectorally, PSU Banks, Media, and Oil & Gas stocks were the top gainers, while Auto, Pharma, and Healthcare sectors ended the day in the red.BSE-listed companies added nearly ₹3 lakh crore in market capitalisation, taking the total market cap to ₹415 lakh crore.Shares of electric bus manufacturers JBM Auto Ltd. and Olectra Greentech Ltd. surged 10% today on the hopes of winning new orders. Sources told CNBC-TV18 that the government is set to launch a tender to procure 10,000 electric buses. The tenders are likely to be launched next month to procure the buses under the PM E-drive scheme.The Indian market showed resilience, despite the global market cues being flat to negative as US tariff uncertainties persist. Positive investor sentiment was supported by better than expected data on India’s retail inflation (CPI), which eased to a six-year low of 3.34% in March against 3.61% in February. Further, the FIIs turned net buyers on Tuesday for the first time this month, with inflows exceeding ₹6,000 crore.Looking ahead to Friday, market attention will shift to earnings reports from Infosys, Jio Financial Services, HDFC Asset Management Company, HDFC Life Insurance Company, and Tata Elxsi.Additionally, Wipro, which released its earnings after market hours on Wednesday, will influence Thursday's trading sentiment. The IT major missed its constant currency revenue growth guidance for the January-March quarter. It posted constant currency revenue decline of 1.2% during the March quarter on a sequential basis, whereas it had guided for growth to be between a decline of 1% and growth of 1%. For the first quarter of FY26, Wipro expects revenue to be between $2,505 million and $2,557 million, implying a revenue decline between -1.5% to -3.5%.Investors will also be tracking the comments from the US Federal Reserve later today for insights into the status of the US economy, impact of trade tariffs and the future direction of interest rates.\"We expect continued positive momentum for Indian markets on the back of progress in US-India trade settlement as the two countries signed the terms of reference for the first part of the Bilateral Trade Agreement (BTA). However, the escalation of tariff war between US and China could induce some volatility,\" said Siddhartha Khemka of Motilal Oswal.Meanwhile, foreign investors continued to remain net buyers in the cash market on Wednesday, while domestic investors were net sellers.The Nifty closed higher after initial weakness in the first half of Wednesday's trading session.According to Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities, the underlying trend of the Nifty remains positive.\"Having moved above the hurdle of 200 day EMA at 23,360 levels, the Nifty could advance towards another resistance at 23,870 levels (swing high of March 25) in the near term. Immediate support is placed at 23,270 levels,\" Shetti said.On the daily chart, the index has closed above the 100-EMA for the second consecutive session, said Rupak De, Senior Technical Analyst at LKP Securities.According to De, the support is now placed at 23,300, and a positive sentiment is likely to prevail as long as it remains above this level. \"A decisive fall below 23,300 might trigger a correction towards 23,150/23,000. On the higher side, resistance is visible at 23,650.\"missed its constant currency revenue growth guidance for the January-March quarter. It posted constant currency revenue decline of 1.2% during the March quarter on a sequential basis, whereas it had guided for growth to be between a decline of 1% and growth of 1%. For the first quarter of FY26, Wipro expects revenue to be between $2,505 million and $2,557 million, implying a revenue decline between -1.5% to -3.5%.appoints Saurav Mitra as Director (Finance) and CFO of the company for five years.",
        "news_type": "Economics"
    },
    {
        "title": "Who owns Rajdhani, Shatabdi, Vande Bharat trains? The real owner is...",
        "link": "https://www.dnaindia.com/india/report-who-owns-rajdhani-shatabdi-vande-bharat-trains-the-real-owner-is-indian-railways-3145914",
        "description": "This leasing model allows Indian Railways to run trains without bearing the full financial burden of ownership.",
        "published_date": "Wed, 16 Apr 2025 16:21:00 GMT",
        "source": "DNA India",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "This leasing model allows Indian Railways to run trains without bearing the full financial burden of ownership.\n\nIndia’s pride in high-speed railway travel is reflected in premium trains like the Rajdhani Express, Shatabdi Express, and Vande Bharat Express. These trains are widely recognised for their speed, comfort, and modern amenities. But have you ever wondered who actually owns these trains? While they run under the banner of Indian Railways, the real ownership lies elsewhere.\n\nSurprisingly, it’s not Indian Railways but the Indian Railway Finance Corporation (IRFC) that owns these premium trains. IRFC, a government-owned public sector enterprise under the Ministry of Railways, is responsible for financing the majority of assets used by Indian Railways. This includes engines, coaches, wagons, and even many of the trains themselves.\n\nRecently, IRFC was granted Navratna status, elevating its financial and operational autonomy. In an exclusive interview with ABP News, IRFC CMD Manoj Kumar Dubey explained how the new status has empowered the company to make faster decisions and boost lending in the railway sector.\n\nDubey also revealed that almost 80 percent of passenger and freight trains used by Indian Railways are technically the property of IRFC. These assets are leased to Indian Railways for a period of 30 years, during which the ownership remains with IRFC. The company uses its own funds raised from markets at competitive rates to finance the production and acquisition of coaches and locomotives.\n\nThis leasing model allows Indian Railways to run trains without bearing the full financial burden of ownership. From the sleek Vande Bharat to the long-trusted Shatabdi and Rajdhani, these trains remain IRFC’s assets on paper while Indian Railways operates them across the country.\n\nApart from funding rolling stock, IRFC also plays a key role in financing projects linked to railway infrastructure and logistics. With the new Navratna status, IRFC plans to expand its portfolio beyond traditional lending, strengthening the overall railway ecosystem.\n\nIn FY25, Indian Railways achieved a 9 percent growth in coach manufacturing, producing over 7,000 coaches, a reflection of its expanding capacity. But behind this growth is IRFC, silently powering India’s rail revolution.\n\nAlso read: Meet the richest DM of UP, 2011 batch IAS officer, whose total assests are worth Rs...",
        "news_type": "Economics"
    },
    {
        "title": "Waqf case: SC asks Centre whether it is willing to allow Muslims to be...",
        "link": "https://www.dnaindia.com/india/report-waqf-case-sc-asks-centre-whether-it-is-willing-to-allow-muslims-to-be-part-of-hindu-religious-trusts-3145817",
        "description": "As many as 72 petitions, including those by AIMIM leader Asaduddin Owaisi, have been filed challenging the validity of the Waqf Amendment Act 2025.",
        "published_date": "Wed, 16 Apr 2025 10:38:00 GMT",
        "source": "DNA India",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "As many as 72 petitions, including those by AIMIM leader Asaduddin Owaisi, have been filed challenging the validity of the Waqf Amendment Act 2025.\n\nThe Supreme Court has asked the Centre whether it is willing to allow Muslims to be part of Hindu religious trusts. The top court's comments come during the hearing of a bunch of petitions challenging the Waqf Amendment Act. A bench comprising Chief Justice Sanjiv Khanna and Justices Sanjay Kumar and K V Viswanathan is hearing the petitions. The hearing is underway with senior advocate Kapil Sibal, appearing for the petitioners' side, making submissions. The court will continue hearing pleas challenging the Waqf Act at 2 pm on Thursday.\n\nThe Centre recently notified the Waqf (Amendment) Act, 2025, which got the assent of President Droupadi Murmu on April 5 after its passage from Parliament following heated debates in both houses. The bill was passed in the Rajya Sabha with 128 members voting in favour and 95 opposing it. It was cleared by the Lok Sabha with 288 members supporting it and 232 against it.\n\nREAD | Who is Justice BR Gavai, the next Chief Justice of India?\n\nAs many as 72 petitions, including those by AIMIM leader Asaduddin Owaisi, All India Muslim Personal Law Board (AIMPLB), Jamiat Ulama-i-Hind, the Dravida Munnetra Kazhagam (DMK), Congress MPs Imran Pratapgarhi and Mohammad Jawed, have been filed challenging the validity of the Act. The Centre, on April 8, filed a caveat in the apex court and sought a hearing before any order was passed in the matter. A caveat is filed by a party in the high courts and the apex court to ensure that no orders are passed without hearing it.",
        "news_type": "Politics"
    },
    {
        "title": "Who is Justice BR Gavai, the next Chief Justice of India?",
        "link": "https://www.dnaindia.com/india/report-who-is-justice-br-gavai-the-next-chief-justice-of-india-52nd-cji-3145810",
        "description": "Justice Gavai has been a part of several Constitution benches in the apex court, which delivered path-breaking verdicts. He is the second senior-most Supreme Court judge after the incumbent CJI Khanna.",
        "published_date": "Wed, 16 Apr 2025 09:59:00 GMT",
        "source": "DNA India",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Justice Gavai has been a part of several Constitution benches in the apex court, which delivered path-breaking verdicts. He is the second senior-most Supreme Court judge after the incumbent CJI Khanna.\n\nJustice Bhushan Ramkrishna Gavai or BR Gavai, is set to be the next Chief Justice of India (CJI), as the present CJI, Sanjiv Khanna, has recommended to the Union Law Ministry to appoint Justice Gavai as the next CJI. Justice Gavai is the second senior-most Supreme Court judge after the incumbent CJI Khanna. He will become the 52nd CJI on May 14 after the retirement of CJI Khanna on May 13. Justice Gavai would have a tenure of over six months as the CJI. He is due to retire on November 23, 2025. He was elevated as a judge of the Supreme Court on May 24, 2019. CJI Khanna was sworn in as the 51st CJI on November 11 last year. The retirement age of Supreme Court judges is 65 years.\n\nWho is Justice BR Gavai?\n\nBorn on November 24, 1960 at Amravati, Justice Gavai was elevated as an additional judge of the Bombay High Court on November 14, 2003. He became a permanent judge of the high court on November 12, 2005. Justice Gavai has been a part of several Constitution benches in the apex court which delivered path-breaking verdicts. He was part of a five-judge Constitution bench which in December 2023 unanimously upheld the Centre's decision to abrogate provisions of Article 370 bestowing special status to the erstwhile state of Jammu and Kashmir.\n\nAnother five-judge Constitution bench, of which Justice Gavai was a part, annulled the electoral bonds scheme for political funding. He was a part of a five-judge Constitution bench which, by a 4:1 majority verdict, gave its stamp of approval to the Centre's 2016 decision to demonetise Rs 1,000 and Rs 500 denomination currency notes.\n\nREAD | Azim Premji's company gets key approval to acquire stakes in THIS Indian airline\n\nJustice Gavai was part of a seven-judge constitution bench, which by a 6:1 majority held that states are constitutionally empowered to make sub-classifications within the Scheduled Castes, which form a socially heterogeneous class, for granting reservation for the uplift of castes that are socially and educationally more backward among them.\n\nA seven-judge Constitution bench also having Justice Gavai ruled that the arbitration clause in an unstamped or insufficiently stamped agreement between parties was enforceable as such a defect was curable and did not render the contract invalid. In an important verdict, a bench headed by Justice Gavai laid down pan-India guidelines and said no property should be demolished without a prior showcause notice and the affected must be given 15 days to respond.\n\n(With inputs from PTI)",
        "news_type": "Politics"
    },
    {
        "title": "Melaka CM denies any involvement in MACC&#039;s detention of Bersatu deputy info chief",
        "link": "https://www.thestar.com.my/news/nation/2025/04/16/melaka-cm-denies-any-involvement-in-macc039s-detention-of-bersatu-deputy-info-chief",
        "description": "MELAKA: The Melaka Chief Minister has denied any involvement in the detention of Datuk Seri Mohamad Ali Mohamad by the Malaysian Anti-Corruption Commission (MACC). <a href=\"https://www.thestar.com.my/news/nation/2025/04/16/melaka-cm-denies-any-involvement-in-macc039s-detention-of-bersatu-deputy-info-chief\">Read full story</a> ",
        "published_date": "Wed, 16 Apr 2025 23:04:00 +08:00",
        "source": "The Star Online",
        "source_country": "Malaysia",
        "countries_mentioned": [
            "Malaysia"
        ],
        "content": "MELAKA: The Melaka Chief Minister has denied any involvement in the detention of Datuk Seri Mohamad Ali Mohamad by the Malaysian Anti-Corruption Commission (MACC).\n\nDatuk Seri Ab Rauf Yusoh said that he had no part in nor did he influence the MACC’s decision to arrest the former Dewan Negar deputy president.\n\n\"Any allegations linking me to the detention are baseless, speculative and misleading.\n\n\"Such accusations not only tarnish the reputation of the state leadership but are also seen as attempts to derail the state administration’s focus on implementing the development agenda for the people,\" he said in a statement Wednesday (April 16).\n\nAb Rauf emphasised that his administration places full confidence in the MACC to conduct its investigations transparently and professionally, free from interference by any party.\n\n\"The state government also urges all parties to act responsibly when disseminating and sharing information, to prevent the spread of false news and slander on social media,\" he said, adding that action may be considered against those spreading such false narratives.\n\nMohamad Ali, who is also Bersatu’s deputy information chief, was arrested by the MACC on Monday (April 14) over alleged bribery related to a land reclamation project valued at RM44mil.\n\nOn Tuesday (15 April), the MACC obtained a six-day remand order against Mohamad Ali to assist with investigations under Section 16(a)(B) of the MACC Act 2009 for soliciting and accepting bribes in connection with the project in Kota Laksamana between 2021 and 2023.\n\nMohamad Ali was also formerly Melaka Umno deputy chief and Tangga Batu division chief before joining Bersatu, last year.",
        "news_type": "Politics"
    },
    {
        "title": "No mining leases issued yet, says Hajiji amid scrutiny over gold exploration",
        "link": "https://www.thestar.com.my/news/nation/2025/04/16/no-mining-leases-issued-yet-says-hajiji-amid-scrutiny-over-gold-exploration",
        "description": "KOTA KINABALU: The Sabah government has yet to issue any mining leases for gold despite growing concerns over potential private control of mineral-rich land in Semporna, says Datuk Seri Hajiji Noor (GRS-Sulaman). <a href=\"https://www.thestar.com.my/news/nation/2025/04/16/no-mining-leases-issued-yet-says-hajiji-amid-scrutiny-over-gold-exploration\">Read full story</a> ",
        "published_date": "Wed, 16 Apr 2025 21:51:00 +08:00",
        "source": "The Star Online",
        "source_country": "Malaysia",
        "countries_mentioned": [
            "Malaysia"
        ],
        "content": "KOTA KINABALU: The Sabah government has yet to issue any mining leases for gold despite growing concerns over potential private control of mineral-rich land in Semporna, says Datuk Seri Hajiji Noor (GRS-Sulaman).\n\nThe Chief Minister told the State Assembly on Wednesday (April 16) during his winding-up speech that only prospecting licences have been approved, which do not automatically guarantee the right to mine.\n\n“What we issued were exploration licences. These are not mining leases,” he said.\n\nThe state government, he explained, has not reached the stage of deciding on any mining concessions, adding that all matters involving royalties, equity and licence terms would be determined by the Cabinet if and when it comes to that.\n\nDatuk Seri Mohd Shafie Apdal (Warisan-Senallang) had earlier expressed concern that granting prospecting licences to private firms might lead to an automatic expectation for mining rights, potentially depriving the state of direct control over its natural resources.\n\nIn reply, Hajiji acknowledged the concern but said the current approach allows the state to avoid incurring financial liabilities associated with high-risk exploration.\n\n“The exploration of minerals involves high capital and risk. By letting private entities bear that cost, the government can focus on monitoring, environmental protection and policy oversight,” he said.\n\nHe said the government remains committed to protecting the state’s interests, and that any eventual decision on mining would include a discussion on the level of state ownership or equity, including the option to channel such projects through state-linked companies.\n\n“If we give prospecting rights, there must be some potential for them to be considered later. Otherwise, no company would want to invest millions to explore with zero opportunity,” Hajiji added.\n\nHe assured the assembly that transparency remains a priority and said the list of companies given prospecting licences could be obtained from Sabah Mineral Management Sdn Bhd (SMM) and the Companies Commission of Malaysia.\n\n“We are not hiding anything,” he said.\n\nShafie, however, insisted that state agencies such as Yayasan Sabah or other government-linked entities should lead mineral exploration, to ensure that any profits go back to the people.\n\n“I strongly oppose giving this to private individuals. If there is gold, it should belong to the state,” he said.\n\nHe cited past controversies such as the alleged illegal mining activities in Tawau, where tonnes of gold were believed to have been extracted without clear benefit to Sabah.\n\nThe issue of gold exploration was raised during the winding-up debate at the Sabah state assembly, following allegations that some 1,000ha in Nagos, Semporna had been quietly allocated to private interests.\n\nHajiji reiterated that no mining lease had been approved for that area or any other, and pledged to keep the assembly informed of further developments.",
        "news_type": "Politics"
    },
    {
        "title": "Unity, tolerance among all races in Penang, can become an aspiration for other states - Chow",
        "link": "https://thesun.my/malaysia-news/unity-tolerance-among-all-races-in-penang-can-become-an-aspiration-for-other-states-chow-PN13960285",
        "description": "<img src=\"https://thesun.my/binrepository/400x267/0c42/400d225/none/11808/SSMF/pg06-11042025-chow_5134428_20250416225439.jpg\"><p><b>GEORGE TOWN</b>: The unity and tolerance among the races, the people and the government showcased in Penang is expected to become an aspiration for other states across the country, said Chief Minister Chow Kon Yeow.</p><p></p><p>In fact, Chow said during Prime Minister Datuk Seri Anwar Ibrahim’s presence at the Penang State Level MADANI Aidilfitri Celebration Ceremony recently, he also praised the state which reflected harmony and unity between races.</p><p></p><p>“As one of the leaders in the era of the Unity Government, I hope that this harmonious relationship will remain forever, there is nothing more beneficial when the people of this country can live in peace and harmony consisting of a multi-racial and multi-religious society.</p><p></p><p>“In fact, the organisation of open houses in goodwill is a reflection of the reality of harmonious relations between races, not only in this state but also throughout Malaysia,“ he said in his speech in conjunction with the Silaturahim Dinner in conjunction with Hari Raya Aidilfitri organised by the Penang Malay Association (Pemenang) in Bayan Baru, near here tonight.</p><p></p><p>Also present were the Yang Dipertua Negeri Tun Ahmad Fuzi Abdul Razak and Pemenang President Tan Sri Mohd Yussof Latiff.</p><p></p><p>Meanwhile, Chow said he appreciated the active role of Pemenang in carrying out social responsibility initiatives and fighting for the interests of the Malay community, especially in Penang within the framework of a nation and state that practices the spirit of inclusiveness and living in harmony together.</p><p></p><p>“The state government will continue to support all noble efforts that are constructive and unite the people and I also believe that with the commitment and strong cooperation between the government and non-governmental organisations (NGOs) such as Pemenang, we can achieve the goal of balanced and sustainable development for all,“ he said.</p>",
        "published_date": "Wed, 16 Apr 2025 14:52:46 GMT",
        "source": "The Sun (Malaysia)",
        "source_country": "Malaysia",
        "countries_mentioned": [
            "Malaysia"
        ],
        "content": "GEORGE TOWN: The unity and tolerance among the races, the people and the government showcased in Penang is expected to become an aspiration for other states across the country, said Chief Minister Chow Kon Yeow.\n\nIn fact, Chow said during Prime Minister Datuk Seri Anwar Ibrahim’s presence at the Penang State Level MADANI Aidilfitri Celebration Ceremony recently, he also praised the state which reflected harmony and unity between races.\n\n“As one of the leaders in the era of the Unity Government, I hope that this harmonious relationship will remain forever, there is nothing more beneficial when the people of this country can live in peace and harmony consisting of a multi-racial and multi-religious society.\n\n“In fact, the organisation of open houses in goodwill is a reflection of the reality of harmonious relations between races, not only in this state but also throughout Malaysia,“ he said in his speech in conjunction with the Silaturahim Dinner in conjunction with Hari Raya Aidilfitri organised by the Penang Malay Association (Pemenang) in Bayan Baru, near here tonight.\n\nAlso present were the Yang Dipertua Negeri Tun Ahmad Fuzi Abdul Razak and Pemenang President Tan Sri Mohd Yussof Latiff.\n\nMeanwhile, Chow said he appreciated the active role of Pemenang in carrying out social responsibility initiatives and fighting for the interests of the Malay community, especially in Penang within the framework of a nation and state that practices the spirit of inclusiveness and living in harmony together.\n\n“The state government will continue to support all noble efforts that are constructive and unite the people and I also believe that with the commitment and strong cooperation between the government and non-governmental organisations (NGOs) such as Pemenang, we can achieve the goal of balanced and sustainable development for all,“ he said.",
        "news_type": "Politics"
    },
    {
        "title": "Malaysia will achieve greater success under Sultan Ibrahim, Anwar’s leadership - Xi",
        "link": "https://thesun.my/malaysia-news/malaysia-will-achieve-greater-success-under-sultan-ibrahim-anwar-s-leadership-xi-MN13960194",
        "description": "<img src=\"https://thesun.my/binrepository/400x267/0c0/400d225/none/11808/WAYA/kl40-16042025-agong-china_5134379_20250416223137.jpg\"><p><b>PUTRAJAYA</b>: Chinese President Xi Jinping today expressed confidence that Malaysia will achieve greater success under the leadership of His Majesty Sultan Ibrahim and Prime Minister Datuk Seri Anwar Ibrahim.</p><p></p><p>“During my last visit in 2013, I was deeply impressed by Malaysia’s beautiful nature, diverse culture and kind people. Now, coming back 12 years later, I am truly delighted to see Malaysia booming and making great strides in modernisation.</p><p></p><p>“I have no doubt that under the leadership of His Majesty Sultan Ibrahim and Prime Minister Anwar, Malaysia will be ever more vigorous and achieve even greater success in building Malaysia MADANI,“ he said at a dinner hosted by Anwar at Seri Perdana here.</p><p></p><p>Xi also highlighted how the two countries have come a long way over 50 years of formal diplomatic relations.</p><p></p><p>“Over the past 50-plus years since we began formal diplomatic relations, we have worked together and built a relationship as solid as a stone and only getting stronger.</p><p></p><p>“Politically, we respect and trust each other; economically, we enjoy mutually beneficial cooperation; culturally, we learn from and invigorate each other. This relationship is benefiting our people in real ways,“ he said. </p><p></p><p>The President also emphasised that a new historical chapter in Malaysia-China relations began in 2023, with both countries agreeing on the vision to build a community with a shared future.</p><p></p><p>Xi is currently on a three-day state visit to Malaysia, which began yesterday at the invitation of Sultan Ibrahim.</p><p></p><p>This visit marks Xi’s second official visit to Malaysia in 12 years, after the last visit in 2013, which saw the two countries upgrade diplomatic relations to a Comprehensive Strategic Partnership.</p><p></p><p>Among those present at the dinner were Deputy Prime Ministers Datuk Seri Dr Ahmad Zahid Hamidi and Datuk Seri Fadillah Yusof.</p><p></p><p>Other ministers in attendance were Communications Minister Datuk Fahmi Fadzil; Transport Minister Anthony Loke Siew Fook; Economy Minister Datuk Seri Rafizi Ramli; Housing and Local Government Minister Nga Kor Ming; Foreign Minister Datuk Seri Mohamad Hasan; Investment, Trade and Industry Minister Tengku Datuk Seri Zafrul Abdul Aziz; Science, Technology and Innovation Minister Chang Lih Kang; Higher Education Minister Datuk Seri Dr Zambry Abd Kadir and Digital Minister Gobind Singh Deo.</p><p></p><p>Also present was Malaysian National News Agency (Bernama) chief executive officer Datin Paduka Nur-ul Afida Kamaludin.</p>",
        "published_date": "Wed, 16 Apr 2025 14:29:42 GMT",
        "source": "The Sun (Malaysia)",
        "source_country": "Malaysia",
        "countries_mentioned": [
            "Malaysia"
        ],
        "content": "PUTRAJAYA: Chinese President Xi Jinping today expressed confidence that Malaysia will achieve greater success under the leadership of His Majesty Sultan Ibrahim and Prime Minister Datuk Seri Anwar Ibrahim.\n\n“During my last visit in 2013, I was deeply impressed by Malaysia’s beautiful nature, diverse culture and kind people. Now, coming back 12 years later, I am truly delighted to see Malaysia booming and making great strides in modernisation.\n\n“I have no doubt that under the leadership of His Majesty Sultan Ibrahim and Prime Minister Anwar, Malaysia will be ever more vigorous and achieve even greater success in building Malaysia MADANI,“ he said at a dinner hosted by Anwar at Seri Perdana here.\n\nXi also highlighted how the two countries have come a long way over 50 years of formal diplomatic relations.\n\n“Over the past 50-plus years since we began formal diplomatic relations, we have worked together and built a relationship as solid as a stone and only getting stronger.\n\n“Politically, we respect and trust each other; economically, we enjoy mutually beneficial cooperation; culturally, we learn from and invigorate each other. This relationship is benefiting our people in real ways,“ he said.\n\nThe President also emphasised that a new historical chapter in Malaysia-China relations began in 2023, with both countries agreeing on the vision to build a community with a shared future.\n\nXi is currently on a three-day state visit to Malaysia, which began yesterday at the invitation of Sultan Ibrahim.\n\nThis visit marks Xi’s second official visit to Malaysia in 12 years, after the last visit in 2013, which saw the two countries upgrade diplomatic relations to a Comprehensive Strategic Partnership.\n\nAmong those present at the dinner were Deputy Prime Ministers Datuk Seri Dr Ahmad Zahid Hamidi and Datuk Seri Fadillah Yusof.\n\nOther ministers in attendance were Communications Minister Datuk Fahmi Fadzil; Transport Minister Anthony Loke Siew Fook; Economy Minister Datuk Seri Rafizi Ramli; Housing and Local Government Minister Nga Kor Ming; Foreign Minister Datuk Seri Mohamad Hasan; Investment, Trade and Industry Minister Tengku Datuk Seri Zafrul Abdul Aziz; Science, Technology and Innovation Minister Chang Lih Kang; Higher Education Minister Datuk Seri Dr Zambry Abd Kadir and Digital Minister Gobind Singh Deo.\n\nAlso present was Malaysian National News Agency (Bernama) chief executive officer Datin Paduka Nur-ul Afida Kamaludin.",
        "news_type": "Politics"
    },
    {
        "title": "Johor records RM27.4 billion in investments in Q1, says Regent",
        "link": "https://thesun.my/malaysia-news/johor-records-rm274-billion-in-investments-in-q1-says-regent-BN13960166",
        "description": "<img src=\"https://thesun.my/binrepository/400x267/0c0/400d225/none/11808/XJMG/jb06-09052024-tmj_5134371_20250416222820.jpg\"><p><b>JOHOR BAHRU</b>: Johor recorded RM27.4 billion in investments in the first quarter of this year, the Regent of Johor, Tunku Mahkota Ismail said.</p><p></p><p>Tunku Ismail said the strong performance was largely driven by the Johor-Singapore Special Economic Zone (JS-SEZ) and various state initiatives aimed at attracting greater investments into Johor.</p><p></p><p>“At the same time, as I stated upon being appointed as Regent, I am committed to improving the quality of education in the state.</p><p></p><p>“To that end, the Johor government has allocated RM55 million to enhance the education system. As for the flood mitigation project originally scheduled for completion in 2029, I have instructed that it be expedited and completed by 2027,” Tunku Ismail said in a statement on his official Facebook page today.</p><p></p><p>The Regent added that infrastructure development continues to be a top priority, alongside efforts to improve education, raise living standards, and strengthen the economy - all crucial for ensuring Johor’s progress and global competitiveness.</p><p></p><p>“I would like to congratulate Menteri Besar Datuk Onn Hafiz Ghazi, the Johor state government, the private sector, and all parties involved for their efforts and implementation of initiatives that reflect our shared commitment to advancing Johor across all sectors,” Tunku Ismail said.</p>",
        "published_date": "Wed, 16 Apr 2025 14:26:27 GMT",
        "source": "The Sun (Malaysia)",
        "source_country": "Malaysia",
        "countries_mentioned": [
            "Singapore",
            "Malaysia"
        ],
        "content": "JOHOR BAHRU: Johor recorded RM27.4 billion in investments in the first quarter of this year, the Regent of Johor, Tunku Mahkota Ismail said.\n\nTunku Ismail said the strong performance was largely driven by the Johor-Singapore Special Economic Zone (JS-SEZ) and various state initiatives aimed at attracting greater investments into Johor.\n\n“At the same time, as I stated upon being appointed as Regent, I am committed to improving the quality of education in the state.\n\n“To that end, the Johor government has allocated RM55 million to enhance the education system. As for the flood mitigation project originally scheduled for completion in 2029, I have instructed that it be expedited and completed by 2027,” Tunku Ismail said in a statement on his official Facebook page today.\n\nThe Regent added that infrastructure development continues to be a top priority, alongside efforts to improve education, raise living standards, and strengthen the economy - all crucial for ensuring Johor’s progress and global competitiveness.\n\n“I would like to congratulate Menteri Besar Datuk Onn Hafiz Ghazi, the Johor state government, the private sector, and all parties involved for their efforts and implementation of initiatives that reflect our shared commitment to advancing Johor across all sectors,” Tunku Ismail said.",
        "news_type": "Economics"
    },
    {
        "title": "The fourth service: How AUKUS is consuming the defence budget",
        "link": "https://www.smh.com.au/politics/federal/the-fourth-service-how-aukus-is-consuming-the-defence-budget-20250416-p5ls5i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Army. Air force. Navy … AUKUS? The nuclear submarine program could soon cost as much, or more, than other branches of our military, experts say.",
        "published_date": "Thu, 17 Apr 2025 00:01:00 +1000",
        "source": "The Sydney Morning Herald",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "Spending on the AUKUS submarine program is growing so dramatically that it is approaching the size of a standalone branch of the Defence Force, draining funding for other military equipment, a group of the nation’s top defence experts has warned.\n\nAs Opposition Leader Peter Dutton prepares to announce the Coalition’s defence spending policy, the experts warn the Australian military is becoming dangerously dependent on the United States and should start hedging its bets to prepare for a more self-interested and less reliable ally under President Donald Trump.\n\nMilitary experts are concerned that Australia’s move to acquire Virginia-class submarines is distorting the defence budget. Credit: AP\n\nThe report by the Strategic Analysis Australia think tank finds that despite the first nuclear-powered submarine not expected to arrive in Australia until 2032, AUKUS is already significantly distorting the defence budget.\n\nIn particular, the authors find the Royal Australian Air Force is in the “dog house” despite being arguably the best performing and most potent branch of the defence force.",
        "news_type": "Politics"
    },
    {
        "title": "Albanese or Dutton? Our experts deliver their leaders’ debate verdicts",
        "link": "https://www.smh.com.au/politics/federal/albanese-or-dutton-our-experts-deliver-their-leaders-debate-verdicts-20250416-p5ls7e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "For most of our panellists, the debate was a close-run thing as leaders ducked and weaved under tough questioning.",
        "published_date": "Wed, 16 Apr 2025 23:31:30 +1000",
        "source": "The Sydney Morning Herald",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "By the end of the hour, Albanese seemed more assured. Dutton did not get the victory he wanted, at the very point he needed to lift his campaign. Verdict: Albanese In the first 2025 election debate, Anthony Albanese and Peter Dutton fought each other to a nil-all draw, and viewers were the losers. What a difference a week can make. This was a serious debate and one in which both leaders gave unconvincing answers to detailed questions.\n\nHousing opened the debate. Albanese focused on his government’s own policy proposals whereas Dutton started by criticising Labor before Speers asked about the regressive nature of his signature housing policy. Dutton did not give a convincing answer when asked about the policy’s lack of fairness, while neither man gave an answer that will satisfy anyone who wants negative gearing and capital gains tax breaks scaled back. Key moments in the second debate Credit: ABC Pool Both said no changes are planned, but Albanese didn’t sound believable when asked whether negative gearing changes had been modelled by Treasury. “It certainly wasn’t commissioned by us” is not a convincing answer. There were questions on the economy, Indigenous disadvantage, Donald Trump and foreign policy. But it was when the two men were asked what big political reform they would like to be remembered for that the debate was most revealing.\n\nAlbanese gave a boilerplate answer about his passion for access to affordable childcare, a worthy goal but not in the Hawke-Keating pantheon. Dutton spoke about the centrality of affordable energy to the economy, which led to nuclear power, a policy he has barely spoken about during the campaign. Leaders go head to head in the second debate. Credit: Matt Golding First, Speers fact-checked Dutton on his regular claim that Australia is the only G20 nation that hasn’t signed up to nuclear power or is already using it and Dutton pivoted to claim that Indonesian president Prabowo was “fully on board” with it. (The World Nuclear Association says on its website that our near neighbour has a small Russian 10MW experimental reactor planned near Jakarta, but it is delayed).\n\nQuestions followed about whether there was sufficient water to cool nuclear power stations at the Coalition’s seven nominated sites – there is substantial evidence that there is not – and what type of plant would be situated where. The opposition leader did not adequately answer and that is no basis for an economy-transforming energy transition. This was a debate that exposed some of the long-term risks inherent in one of Dutton’s trademarks – the slightly exaggerated verbal drive-by - and how that can catch up with you, as we saw when he had to recant his claims about Indonesian support for a Russian base. It revealed a gap between the prime minister and opposition leader in policy preparation and detail that will give some voters pause as they consider whether the Coalition really is ready to return to government. Verdict: Albanese won this debate, though not by much.\n\nPeter Dutton has put it on the record: “I don’t know the President. I have never met him…I don’t know Donald Trump”. We were 40 minutes into the hour-long leaders’ debate, and the tariff-fancying elephant in the room was finally acknowledged. For weeks Labor has been explicitly linking Peter Dutton to the enormously unpopular (in Australia) US president. Dutton had not yet expressly denied the allegations of intimacy. Finally, he had his chance, and he took it.\n\nAnd yet, here Dutton was, just a few minutes later, arguing that a government led by him would be better placed to negotiate an exemption to tariffs imposed by the US. Was that due to some sort of special relationship, inquired debate host David Speers. Dutton said it was based on past experience, but then he admitted to one of the most special relationships available to man - the golf buddy. “We have an ambassador with this government who can’t get a phone call with the president,” Dutton said. “We had an ambassador who used to play golf with him.”\n\nIt was a reference to former US Ambassador Joe Hockey who famously lost many a round of golf to Trump (he must have lost, because Trump never loses). Loading It was tricky terrain, but overall Dutton performed better than he did in the Sky debate last week. He was more relaxed and on-message, particularly when speaking about the Liberal value of homeownership and its importance to family formation. The PM looked cagey on a few occasions - notably when asked, if renewables were indeed the cheapest form of energy as he claims, when would our power bills come down? Albanese had to fudge that one, but in most other instances he was better able to articulate his policies.\n\nHe was able to reassure young Australians in particular, that he believes unequivocally in the science of climate change. Dutton didn’t seem so sure - which won’t endear him to many voters in teal and Greens seats the Coalition needs to win back this election. Verdict: Albanese by a whisker First they neutralised each other’s cost of living policies by going tit-for-tat with bribes around the budget. Now they’ve neutralised housing, by offering competing ideas so similar that it takes a pen and paper to reckon through their competing merits.\n\nThis debate brought home that on these things, the two major parties have effectively cancelled each other out. No low-engagement voter is going to remember which party stands for which of the housing policies the prime minister and the opposition leader bandied about tonight. Most voters won’t remember what the leaders said, but they will remember how the leaders made them feel. And on this front, the prime minister claimed the wedge. The Coalition is stuck trying to explain how its energy policy will transform the economy and make it more productive. Despite trying hard over the past few weeks to free themselves of the chains of economics, the Coalition is still in the habit of trying to pay for things. Meanwhile, Labor has a killer pitch: if you love something, they will make it free. Never mind where the money comes from. Only the opposition will cut, according to Albanese. Both leaders managed to cast a little shade on their opponent – in essence, that he is mad, bad, and dangerous to vote for. Dutton called the prime minister a liar and pointed out that his freebies will be paid for by young voters; Albanese attacked Dutton on foreign affairs and defence, undermining a key Coalition equity and seeking to reinforce the idea that Dutton is “Trumpy”. But there is a more important set of audiences that both leaders clearly had in mind.\n\nTheir carefully rehearsed messages provided content for a multitude of little campaign warlords, commanding a crucial booth here, an impassioned issue there, or an antsy demographic subgroup. Unions will be speaking to their audiences about affordable childcare, developers to theirs about Dutton’s sledge on the CFMEU. Likewise on migration, renewable energy, nuclear, free TAFE and more – dozens of little bites to excite a handful of votes which could prove crucial. These are the groups who will move molehills in an election contested in seat-by-seat combat. And if enough molehills move together, one or the other leader will be get a leg up in “climbing a mountain”, as the prime minister says, on election day. Albanese didn’t perform better on the night, but he won by providing TikTok soundbites for the next fortnight of campaigning. Verdict: Albanese, for the algorithm If I really have to pick a winner, it’s David Speers. Calm, firm and interrupted two endless gasbags without compunction. Loved that for us. He’s grown out of his Sky News vibes and looks right at home on the national broadcaster.\n\nSpeers completely skewered Peter Dutton on nuclear energy and water use. And when the Opposition Leader spoke at a million miles an hour, Speers interjected: “I”m just trying to clarify your plans, Mr Dutton.” If Speers gets sick of journalism, he would make a brilliant year-nine classroom teacher. Sadly, he’s not in the competition so we have to pick from two middle-aged men in pastel ties. Straight into housing. They both rehearsed well enough to remember their lines. In summary, we have supply guy versus use-your-super guy. So what was memorable? Albanese’s demeanour. He’s transmogrified from a wet wimp into a politician comfortable name-dropping other world leaders as friends. In comparison, Dutton exuded “pick me” energy, talking too fast and struggling to stand up for the science. His desire to be forceful combined with his staccato delivery made him stumble a bit. Albanese seemed more relaxed, more fluent. Loading\n\nThe most startling moment of the debate? Speers asked Dutton about climate change. The Opposition Leader replied, with a straight face, “I’m not a scientist,” though he did say he’d defer to their judgment. Dear god. Both looked like liars, though. Albanese claims to trust Trump. And I got even more confused by Dutton who on one hand said he was critical of the US president’s treatment of Ukraine president Volodymyr Zelensky but he would also do a better job of dealing with Trump. It was a head-spinning answer. I bring you this verdict replete with my own biases. I’m clearly a person with progressive views but Labor disappoints me on a regular basis. The Liberal Party will always be the party which enabled and accelerated robodebt. And now we know its leader is too timid to give a full-throated endorsement of climate science. Verdict: Albanese wins. At least he recognises the science.\n\nPeter Dutton went into this debate with a clear objective: downplay the hard man and play up the pragmatist. That was evident in everything from his assured and measured speaking style to his timing. Unlike Albanese’s opening and closing statements that overrode moderator David Speers’ repeated attempts to enforce the time limit, Dutton kept his succinct. It showed a discipline his campaign has sometimes lacked. Another example: after erring on Tuesday by claiming Indonesia’s president Prabowo Subianto had publicly confirmed reports Russia was seeking a debate in the country, Dutton admitted the mistake in the debate and moved on. He was more credible than Albanese on Trump too, saying he trusted the United States but didn’t know the president. Opposition Leader Peter Dutton\n\nAlbanese, on the other hand, strained credulity to breaking point by claiming he had “no reason not to” trust the president, whose wildly mercurial approach to governing is obvious to anyone in possession of their senses. When Albanese insisted his government had not commissioned modelling on winding back changes to capital gains tax and negative gearing — which this masthead revealed it had in September last year — Dutton was ready to pounce. It reinforced one of his key narratives that Albanese can be loose with the truth. Of course Dutton can be too — or so evasive it’s much the same thing. He lost points on climate, costings and housing. But blessed with low expectations from a couple of rough weeks on the campaign trail, Dutton came out a narrow winner.",
        "news_type": "Politics"
    },
    {
        "title": "As Albanese and Dutton fought it out, these were the questions they couldn’t answer",
        "link": "https://www.smh.com.au/politics/federal/as-albanese-and-dutton-fought-it-out-these-were-the-questions-they-couldn-t-answer-20250416-p5lsd6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Are we seeing the impact of climate change? What will you cut? The leaders skirted around many questions, or ignored them altogether, in the second debate.",
        "published_date": "Wed, 16 Apr 2025 22:48:24 +1000",
        "source": "The Sydney Morning Herald",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "But nobody gave a straight answer when Speers asked whether people should be able to use tax breaks to buy four, five or six properties. Loading Dutton instead brought the conversation back to Albanese’s denial that he would revisit the tax breaks for investors. “Anthony, your government modelled negative gearing changes and capital gains tax. The treasurer has done that,” he said. Albanese shot back: “That’s not right”. Dutton replied: “It is right”. This masthead revealed in September last year that Treasury had worked on options to scale back negative gearing and capital gains tax concessions.\n\nAsked about the modelling at the time, Treasurer Jim Chalmers said it was “not unusual at all for governments, or for treasurers, to get advice on contentious issues which are in the public domain.” Balancing the budget Both parties are going into this election with billions in big spending plans. Where will the money come from? Wednesday night did not deliver an answer. Albanese tried to spruik his government’s two surpluses. But given Labor’s most recent budget predicts the government will spend more than it raises for the next decade, host David Speers asked why so many of the government’s policies – wiping HECS debts, Medicare rebates, energy rebates – aren’t means tested. “The HECS debt is about intergenerational equity. We spoke before about young people. I think young people deserve a fair crack,” Albanese said in his first attempt to answer.\n\n“When I get sick or you get sick we have access to Medicare or a hospital. Every child, Peter’s or mine, will get access to a public education and school,” he said in a second. “[With] energy rebates, you had two choices because of the way it is delivered through the energy companies, you either give it to everyone or just to concession cardholders. We understand a whole lot of working people need that assistance in cost of living,” he said in a third. But he never gave a clear answer about the principle of giving cost-of-living relief to wealthy people, which is what Speers asked three times. Dutton’s grilling came a few moments later. First, he was asked if his public service cuts – eventually worth $7 billion a year – would cover all the Coalition’s spending. To that, Dutton gave a straight answer. “The short answer is no,” he said. “We won’t achieve all of the savings we need to achieve through our changes to the public service.”\n\nBut the clarity did not last long. Dutton was asked three times which part of the public service he would cut. He did not say. He was asked twice if foreign aid would be cut. He did not say. Cuts would come “where we find inefficiency,” he said. “It’s not something you can do from opposition to redesign the public service in the way that works.” Energy and climate change Labor’s ill-fated promise from before the 2022 election to bring power bills down $275 by this year has haunted the government. Albanese refused to walk into any kind of commitment like that on Wednesday night. Three times he was asked: “When will we see our power bills come down?” Albanese demurred. “What we need to do is to roll out renewables, make sure there’s energy security, make sure it’s backed up by batteries, by hydro and by gas,” he said, in one of several attempts at answering, but never delivered a timeline.",
        "news_type": "Politics"
    },
    {
        "title": "Federal election 2025 as it happened: Dutton, Albanese hold second leaders debate; Russian plans to house aircraft in Indonesia ‘not true’ says Marles",
        "link": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-anthony-albanese-peter-dutton-polls-early-voting-indonesia-russia-20250415-p5lrzv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Follow our live coverage of the 2025 federal election campaign, with 17 days to go until polling day.",
        "published_date": "Wed, 16 Apr 2025 22:22:32 +1000",
        "source": "The Sydney Morning Herald",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "Loading\n\nAlbanese and Dutton have now squared off in two debates. They launched their official campaigns on the weekend, and we are less than a week away from Australians being able to cast their vote (early voting opens on April 22 before the official election day on May 3).\n\nSo who won tonight’s contest? And did it sway your vote in any way?\n\nOur experts have handed down their verdicts: Chief political correspondent David Crowe, national affairs editor James Massola, senior writer Jacqueline Maley, deputy federal editor Nick Bonyhady, and columnists Parnell Palme McGuinness and Jenna Price have all given their opinions on the debate.\n\nYou can read them here.",
        "news_type": "Politics"
    },
    {
        "title": " The oligopoly that is Australian politics",
        "link": "https://independentaustralia.net/politics/politics-display/the-oligopoly-that-is-australian-politics,19637?utm_source=rss&utm_medium=rss&utm_campaign=IA_Feed",
        "description": " <a href=\"https://independentaustralia.net/politics/politics-display/the-oligopoly-that-is-australian-politics,19637?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: The oligopoly that is Australian politics\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19637-thumb.jpg\" width=\"65\" height=\"65\" alt=\"The oligopoly that is Australian politics\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> Dr Kim Sawyer discusses Australia&#039;s political duopoly and why our first voting preferences matter. <a href=\"https://independentaustralia.net/politics/politics-display/the-oligopoly-that-is-australian-politics,19637?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
        "published_date": "Wed, 16 Apr 2025 17:00:00 +1000",
        "source": "Independent Australia",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "Dr Kim Sawyer discusses Australia's political duopoly and why our first voting preferences matter.\n\nWE ARE TRAPPED in an oligopoly — not the supermarkets, banks, the media or social media platforms but the duopoly of two political parties where our last preference is often more important than our first.\n\nFor many, the last preference on May 3 is a choice between an \"F\" and an \"F-minus\".\n\nIn 1929, mathematical statistician Harold Hotelling identified a fundamental principle of oligopoly: the principle of minimum differentiation, or Hotelling's Law. There is an incentive to make new products like the old ones and make small changes, which seem like improvements but not too much change so as to frighten the horses.\n\nHotelling observed what we can all observe. Oligopolists behave like monopolists; not only Coles and Woolworths with their weekly specials, not only petrol stations located at the same intersection but also, political parties in their platforms.\n\nHotelling wrote his essay nearly a century ago, but his observations are relevant today. Politicians compete for the marginal voter who is often indifferent to significant reform.\n\nOver the past 50 years, we have observed a shift in Australian politics away from the two major parties that is best measured by the combined two-party primary vote at the Federal elections.\n\nIn 1972, Labor won the election with 49.59% of the primary vote, the Coalition got 41.48% — the two-party primary vote was more than 90%. The two-party vote still exceeded 85% in the 1996 Election of the Howard Government and in the 2007 Election of the Rudd Government.\n\nHowever, the two-party vote began to erode soon after as Greens and independents emerged. In 2022, Labor’s vote was 32.58%, the Coalition’s 35.7%, a combined vote of less than 70%, more than 20% below that in 1972.\n\nOpinion polls suggest that it will be the same on May 3. Australians are moving away from the two main parties… at least with their first preference. They recognise that the minor parties, not the major parties, are the agents of reform.\n\nThe two main parties have become as risk-averse as the marginal voters for whom they compete. They have lost the appetite for the reforms of the Whitlam and Hawke-Keating governments. Labor and the Coalition now share too much of the same DNA to reform what should be reformed. Labor, the party of reform, has been burnt by history.\n\nThere is no better example than taxation. We need a simpler, fairer, more efficient tax system with fewer deductions that addresses the problem of income and wealth inequality, and addresses anomalies. But there are too many lobbyists and vested interests for this to happen.\n\nA tax summit would be a start, but Labor has learned the lesson that taxation reform is risky. In 1985, the Hawke Government abolished negative gearing for future rental property investors. By 1987 it was reversed after lobbying from realtors. At the 2019 Election, Labor promised to halve the 50% capital gains tax deduction and limit negative gearing to new properties only. Labor was burnt at the election. Labor has reversed this policy.\n\nThere is no better example of an opportunity lost than the failure to adopt the Henry tax reforms. The Henry tax review commissioned by the Rudd Government made 138 recommendations, a simpler, fairer tax system that included a higher tax-free threshold with only two tax brackets, increases in rent assistance, uniform land tax and removal of stamp duty.\n\nOf the 138 recommendations, the Rudd Government went with only four, the most contentious of which was the resource rent tax, the mining tax, levied at a rate of 40%. It was the mining tax that brought out the vested interests. It was the mining tax that brought the tax review undone. If only the Government had adopted the whole blueprint.\n\nThere is a sclerosis in our politics that I have observed over many years of political activism. The sclerosis is attributable to the indifference of the two major parties to meaningful reform.\n\nIn 1994, I appeared before the first Senate Committee on Public Interest Whistleblowing. There were 39 recommendations including the establishment of a public interest disclosure agency. It was never enabled, and it took 20 years before whistleblowing legislation was enacted. Whistleblowers have paid the price. The prosecution of David McBride and the failure to prosecute those who have retaliated against whistleblowers is the price of tokenism.\n\nThe 1994 Senate Committee also recommended the establishment of a banking ombudsman. It was never enabled; instead, Australians who have complaints about banks must complain to the Financial Complaints Authority (AFCA), which is funded by the very banks that it judges. Unsurprisingly, according to its own data, AFCA has ordered banks to fully reimburse scam victims in only 4.8% of cases — and only small cases. AFCA is not a traditional ombudsman.\n\nAnd it is the same in higher education. The 2001 Senate Inquiry into Higher Education recommended establishing a university ombudsman. The ombudsman was never established. The imperative was not strong enough.\n\nNonetheless, the imperative is strong enough when the major parties want. The 2024 Senate inquiry into Lobbying found that the major parties did not want to restrict lobbying, despite there being 15 paid lobbyists for each parliamentarian on any day in Parliament House.\n\nIndependent Senator David Pocock dissented. He recommended that the lobbying code be legislated to include interactions between lobbyists and all parliamentarians with penalties for breaches, and for an independent regulator to be appointed. Pocock was representing the interest of the unpaid lobbyists who the paid lobbyists subvert. Pocock was representing the public interest.\n\nWhile last preferences of voters may matter more in determining the government after May 3, the first preferences matter more in the long term. The first preferences are the agents of reform.\n\nDr Kim Sawyer is a senior fellow in the School of Historical and Philosophical Studies at the University of Melbourne.",
        "news_type": "Politics"
    },
    {
        "title": " Tobacco policy hell sets open season for black market",
        "link": "https://independentaustralia.net/politics/politics-display/tobacco-policy-hell-sets-open-season-for-black-market,19625?utm_source=rss&utm_medium=rss&utm_campaign=IA_Feed",
        "description": " <a href=\"https://independentaustralia.net/politics/politics-display/tobacco-policy-hell-sets-open-season-for-black-market,19625?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: Tobacco policy hell sets open season for black market\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19625-thumb.jpg\" width=\"65\" height=\"65\" alt=\"Tobacco policy hell sets open season for black market\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> Over the past month, major investigations have been conducted into Australia’s $5 billion tobacco black market and the criminal gangs who now dominate the industry. <a href=\"https://independentaustralia.net/politics/politics-display/tobacco-policy-hell-sets-open-season-for-black-market,19625?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
        "published_date": "Mon, 14 Apr 2025 12:00:00 +1000",
        "source": "Independent Australia",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "Over the past month, both Four Corners and 60 Minutes have done major investigations into Australia’s $5 billion tobacco black market and the criminal gangs who now dominate the industry.\n\nNick McKenzie’s 60 Minutes report began by squarely laying the blame for the crisis on the Commonwealth Health Department’s tobacco policies.\n\n‘Where there’s smoke, there’s firebombing,’ he began, describing the reality for tobacconists in Victoria and increasingly throughout Australia.\n\nMcKenzie continued:\n\nIn the last 18 months, as many as 200 shops have been destroyed as criminals try to wrest control of the lucrative illegal tobacco market. What's concerning, though, is not only the level of violence, but why this thuggery started in the first place by taxing cigarettes so exorbitantly in an attempt to stop people smoking. What the Government has inadvertently created is a thriving black market worth $5 billion a year.\n\nDan Oakes’ Four Corners report, ‘Tobacco Wars’, began on an equally critical note:\n\n“Bringing death and destruction to Australia's streets, it's costing the Federal Government billions in lost taxes, and threatening decades of hard-won progress in the fight against deadly tobacco.”\n\nFormer Australian Federal Police detective superintendent Rohan Pike, who created and led the Australian Border Force’s Tobacco Taskforce in 2015 but now works as a lobbyist for the Australian Association of Convenience Stores (AACS), followed.\n\nPike said:\n\n“People here are sick of firebombings every second day. And it just gives the impression that law and order is out of control. This policy is perhaps one of the biggest failures in Australian history.”\n\nAustralia’s tobacco policy also received a dishonourable mention in the 2025 Federal Budget with the revelation that the fall in the sale of legal cigarettes had led to a precipitous decline in the tobacco excise that was projected to blow a $10 billion hole in the Budget’s prediction of revenue collected over the next four years. The tobacco tax peaked at $16.8 billion in 2019, declined to $10 billion in 2023 and was projected to fall to $6.4 billion in 2028.\n\nFor comparison, the money required for supplementary funding to increase our Medicare billing rates over the next four years was estimated at $8.5 billion.\n\nCommenting on the tobacco tax decline in the Australian Financial Review, economist Chris Richardson labelled Australia’s tobacco tax a $10 billion policy mistake that has fuelled organised crime and worsened health outcomes.\n\nRichardson condemned the absurd increase in tobacco tax:\n\nThe politicians got greedy and tobacco taxes are already up by more than a factor of five since 2010. However, Australia has raised tobacco taxes so far and so fast that we’ve spawned a vast black market. The tax take is telling us that Australians jumped into the black market. That’s been a godsend for criminals. This is a market that is just as profitable as heroin, but with a fraction of the legal consequences if you’re caught.\n\nChris Richardson was largely correct, except that putting a heavy tax on smoking was done for two reasons: to raise revenue, as he said, but secondly to discourage people from smoking. When the health authorities saw the excise was down, they misinterpreted the data as proof that their tax policies were working, but wishful thinking is never a good basis for policy. The wastewater testing (below) showed the nicotine was still there, but it was masked by the black market.\n\nThe chief executive of the AACS, Theo Foukkare, called on the Federal Government to freeze the excise on tobacco products for four years, along with legalising and regulating smoking cessation tools such as vapes, and strengthening the crackdown on illegal tobacco:\n\n“The definition of insanity is doing the same thing over and over again and expecting a different outcome. The Government, with their policy around tobacco excise and vaping prohibition, is doing exactly that. If it is revenue that the Government is after, it should legalise and tax cannabis.”\n\nThe two sides of the nicotine debate\n\n‘...raising tobacco taxes is one of the most effective mechanisms for governments to reduce population consumption of tobacco.’ ~ ‘Tobacco in Australia’, Australian Department of Health.\n\nAustralia’s road to tobacco policy hell was paved with the very best of intentions, to reduce the consumption of tobacco, so how did it go so wrong?\n\nSince the Health Department regarded price as the best way to reduce tobacco use, it adopted the crazy policy of increasing the tobacco tax by 12.5% every year, starting in 2013 and ending in 2021. In 2023, in his second budget, Treasurer Jim Chalmers announced a further 15% increase in the tobacco tax, estimating it would bring in an extra $3.3 billion over the next three years.\n\nAs the graph indicates, the Treasurer’s prediction was out by about minus ten billion dollars, which shows how woefully ignorant our Treasurer is about how excise tax works.\n\nFor Bay FM, I interviewed Dr Alex Wodak, the tobacco harm reduction adviser to the Harm Reduction Australia Board, who explained excise tax in a way even Jim Chalmers might understand:\n\n“Economists talk about a Laffer curve. This occurs when trying to estimate what the optimal taxation rate for a commodity is. If the taxation rate is too low, government revenue is not optimised because the rate is too low. If it is too high, government revenue falls away and there is widespread noncompliance, and people go to the black market. That's the situation we are in with cigarette taxation in Australia.”\n\nHarm reduction relies on helping consumers choose safer methods of consumption. Unlike prohibitionists, harm reductionists avoid a judgemental approach to drug taking or drug takers but seek to educate consumers about how to avoid harms.\n\nLung cancer is a major cause of death for tobacco smokers, but this results from inhaling the tars caused by burning tobacco, not from the nicotine. So the harm reduction approach is to encourage other means of consumption like vaping, which is inhaling nicotine aerosols, nicotine patches and so on.\n\nProfessor Simon Chapman is arguably the chief architect of Australia’s disastrous tobacco policies. Interviewed by Four Corners, he argued against reducing the tobacco tax, asserting that big tobacco exaggerates the size of the black market.\n\nChapman said:\n\n“We have a principle called the scream test. Basically, this means that if you follow the media monitors and follow what the tobacco companies are saying, if they are screaming very loud you know that is a policy that is going to bite hard on their bottom line and the things that they have screamed loudest about throughout my career is probably tax number one.”\n\nDan Oakes then asked Simon Chapman the question many were pleased he did:\n\n“You have a deep-seated hatred of big tobacco. Do you think this risks blinding you to what people are saying in good faith?”\n\nChapman replied, dismissing sincere experts like Rohan Pike and Dr Alex Wodak with this insult:\n\n“I think they should look in the mirror and see that what they are asking for is exactly the same as what Big Tobacco is asking for. Political useful idiots.”\n\nIn our interview, Dr Wodak replied, not with an ad hominin attack, but with a policy-based disagreement:\n\nAustralia's response to tobacco since 2010, more and more resembles the way Australia and many other countries have responded to the war on drugs with extremism — with the intentional provision of misinformation and disinformation, refusal to have any discussion or debate in public or even in private with people who disagree with that policy, extreme hubris. Really, the long and the short of it is that Australia's response to tobacco since about 2010 has looked more and more like a war on nicotine.\n\nIn their commentary in the Australian Harm Reduction Journal, James Martin and Edward Jegasothy agreed with Dr Wodak, arguing that Australia’s intensified regulatory approach toward nicotine control revealed a shift that increasingly resembles a de facto war on nicotine.\n\nMartin and Jegasothy wrote:\n\n‘...recent policies – including increased tobacco taxation and a ban on consumer vapes – have inadvertently fuelled a burgeoning nicotine black market. This has resulted in serious unintended consequences, including increased criminal activity, systemic violence and health risks associated with the proliferation of unregulated nicotine products.’\n\nThe combination of sky-high cigarette prices and the Health Department’s overwhelming obsession with cutting smoking rates had combined in a perfect storm to fuel an explosion in Australia’s tobacco black market. Our tobacco policies were creating more harm than they mitigated, mirroring many of the unintended consequences historically associated with drug prohibition.\n\nDan Oakes also interviewed Health Minister Mark Butler and asked if the Government would consider pausing tobacco tax increases to freeze legal prices and starve the black market of customers.\n\nEchoing Simon Chapman, he replied that this was something the tobacco industry lobbied for, but that would be “raising the white flag” and letting criminals and the industry dictate government policy.\n\nHowever, he could not deny that organised crime was already controlling the market:\n\n“Well, that's right, they've been able to get a foothold and I regret that that's the case, but, you know, the best time to deal with this would've been five years ago. The second-best time is to deal with it now.”\n\nRohan Pike disagreed. The best time was a decade ago when he alerted Border Force and the Government to the problem, but denial reigned then as it does now, and his warnings were ignored. Mark Butler’s solution was too little and too late. The black market was so widespread and entrenched that average citizens no longer had any qualms about participating in the black market.\n\nPike said:\n\n“Given that excise rates are the primary driver of this problem, from the start we should be looking at reducing the excise rates to a level that doesn't encourage people to go to the illicit market.”\n\nHealth's response to the rise of vaping\n\nCould Australia’s disastrous tobacco policy possibly get any worse?\n\nGiven the geniuses we have running the Health Department, this proved no problem.\n\nAllow me to illustrate:\n\nThis is a graphic from the article titled Analysis of wastewater from 2013 to 2021 detected a recent increase in nicotine use in Queensland, Australia. It plots the levels of nicotine measured between 2013 and 2021 in a wastewater treatment plant serving over 100,000 people in southeast Queensland.\n\nTracing different metabolites, one measuring tobacco-based nicotine use from cigarettes, the other measuring non-tobacco nicotine use from vapes, nicotine patches and other nicotine replacement therapies, it shows the transformation in nicotine consumption between 2013 and 2021 as e-cigarettes or vapes replaced cigarette use. Vapes are recommended as safer than cigarettes because they are free from the tars released by burning tobacco, the major cause of lung cancer in tobacco smokers.\n\nThe graph shows how nicotine users’ concerns about lung cancer changed the pattern of nicotine use in Australia. However, the rise of vapes worried the nicotine prohibitionists in the Health Department, and they set about banning vapes and successfully driving vapes, which are comparable in size to the cigarette market, into the black market as well.\n\nNicotine vapes were made harder to obtain with an ‘enhanced regulatory approach to vaping’, according to the 2023 Budget Papers, which required vape users to obtain a prescription from their doctor to legally obtain vapes. Fruity flavours and colourful packaging were also abolished to make vapes less appealing.\n\nOverwhelmingly, this caused vapers to shift to the black market. The National Drug Strategy Household Survey 2022–2023 reported that 1.8 million Australians smoked tobacco, while 1.5 million used vapes, a figure that had tripled from 2019. A vast majority (87%) of people who had used e‑cigarettes with nicotine reported that they had obtained them without a prescription (from the black market).\n\nSaid Dr Wodak:\n\nWe have a policy rigidity problem with vaping. The customers, the people who vape, have gone to the black market. The problem with that is they're getting unregulated vapes over which governments have no control, so it it's a failed and futile policy which is unsustainable and sooner or later, I hope, the policy will collapse and the Government will have to introduce a much more realistic policy both for cigarette excise but also for vaping.\n\nOur interview ended with this bizarrely contrarian observation from Dr Wodak who said:\n\nIt is a curious situation that we're in, that we have to be grateful to the black market – run, of course, by criminals – but we have to be grateful to the criminals and for the black market that they have helped to accelerate the decline in smoking and switch people who enjoy nicotine to help them switch from high risk deadly cigarettes to low risk, safer vaping. So it's the criminals who have provided the market for people who want to keep on using nicotine.\n\nDr John Jiggens is a writer and journalist currently working in the community newsroom at Bay-FM in Byron Bay.",
        "news_type": "Politics"
    },
    {
        "title": "The fourth service: How AUKUS is consuming the defence budget",
        "link": "https://www.theage.com.au/politics/federal/the-fourth-service-how-aukus-is-consuming-the-defence-budget-20250416-p5ls5i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Army. Air force. Navy … AUKUS? The nuclear submarine program could soon cost as much, or more, than other branches of our military, experts say.",
        "published_date": "Thu, 17 Apr 2025 00:01:00 +1000",
        "source": "The Age",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "Spending on the AUKUS submarine program is growing so dramatically that it is approaching the size of a standalone branch of the Defence Force, draining funding for other military equipment, a group of the nation’s top defence experts has warned.\n\nAs Opposition Leader Peter Dutton prepares to announce the Coalition’s defence spending policy, the experts warn the Australian military is becoming dangerously dependent on the United States and should start hedging its bets to prepare for a more self-interested and less reliable ally under President Donald Trump.\n\nMilitary experts are concerned that Australia’s move to acquire Virginia-class submarines is distorting the defence budget. Credit: AP\n\nThe report by the Strategic Analysis Australia think tank finds that despite the first nuclear-powered submarine not expected to arrive in Australia until 2032, AUKUS is already significantly distorting the defence budget.\n\nIn particular, the authors find the Royal Australian Air Force is in the “dog house” despite being arguably the best performing and most potent branch of the defence force.",
        "news_type": "Politics"
    },
    {
        "title": "Albanese or Dutton? Our experts deliver their leaders’ debate verdicts",
        "link": "https://www.theage.com.au/politics/federal/albanese-or-dutton-our-experts-deliver-their-leaders-debate-verdicts-20250416-p5ls7e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "For most of our panellists, the debate was a close-run thing as leaders ducked and weaved under tough questioning.",
        "published_date": "Wed, 16 Apr 2025 23:31:30 +1000",
        "source": "The Age",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "By the end of the hour, Albanese seemed more assured. Dutton did not get the victory he wanted, at the very point he needed to lift his campaign. Verdict: Albanese In the first 2025 election debate, Anthony Albanese and Peter Dutton fought each other to a nil-all draw, and viewers were the losers. What a difference a week can make. This was a serious debate and one in which both leaders gave unconvincing answers to detailed questions.\n\nHousing opened the debate. Albanese focused on his government’s own policy proposals whereas Dutton started by criticising Labor before Speers asked about the regressive nature of his signature housing policy. Dutton did not give a convincing answer when asked about the policy’s lack of fairness, while neither man gave an answer that will satisfy anyone who wants negative gearing and capital gains tax breaks scaled back. Key moments in the second debate Credit: ABC Pool Both said no changes are planned, but Albanese didn’t sound believable when asked whether negative gearing changes had been modelled by Treasury. “It certainly wasn’t commissioned by us” is not a convincing answer. There were questions on the economy, Indigenous disadvantage, Donald Trump and foreign policy. But it was when the two men were asked what big political reform they would like to be remembered for that the debate was most revealing.\n\nAlbanese gave a boilerplate answer about his passion for access to affordable childcare, a worthy goal but not in the Hawke-Keating pantheon. Dutton spoke about the centrality of affordable energy to the economy, which led to nuclear power, a policy he has barely spoken about during the campaign. Leaders go head to head in the second debate. Credit: Matt Golding First, Speers fact-checked Dutton on his regular claim that Australia is the only G20 nation that hasn’t signed up to nuclear power or is already using it and Dutton pivoted to claim that Indonesian president Prabowo was “fully on board” with it. (The World Nuclear Association says on its website that our near neighbour has a small Russian 10MW experimental reactor planned near Jakarta, but it is delayed).\n\nQuestions followed about whether there was sufficient water to cool nuclear power stations at the Coalition’s seven nominated sites – there is substantial evidence that there is not – and what type of plant would be situated where. The opposition leader did not adequately answer and that is no basis for an economy-transforming energy transition. This was a debate that exposed some of the long-term risks inherent in one of Dutton’s trademarks – the slightly exaggerated verbal drive-by - and how that can catch up with you, as we saw when he had to recant his claims about Indonesian support for a Russian base. It revealed a gap between the prime minister and opposition leader in policy preparation and detail that will give some voters pause as they consider whether the Coalition really is ready to return to government. Verdict: Albanese won this debate, though not by much.\n\nPeter Dutton has put it on the record: “I don’t know the President. I have never met him…I don’t know Donald Trump”. We were 40 minutes into the hour-long leaders’ debate, and the tariff-fancying elephant in the room was finally acknowledged. For weeks Labor has been explicitly linking Peter Dutton to the enormously unpopular (in Australia) US president. Dutton had not yet expressly denied the allegations of intimacy. Finally, he had his chance, and he took it.\n\nAnd yet, here Dutton was, just a few minutes later, arguing that a government led by him would be better placed to negotiate an exemption to tariffs imposed by the US. Was that due to some sort of special relationship, inquired debate host David Speers. Dutton said it was based on past experience, but then he admitted to one of the most special relationships available to man - the golf buddy. “We have an ambassador with this government who can’t get a phone call with the president,” Dutton said. “We had an ambassador who used to play golf with him.”\n\nIt was a reference to former US Ambassador Joe Hockey who famously lost many a round of golf to Trump (he must have lost, because Trump never loses). Loading It was tricky terrain, but overall Dutton performed better than he did in the Sky debate last week. He was more relaxed and on-message, particularly when speaking about the Liberal value of homeownership and its importance to family formation. The PM looked cagey on a few occasions - notably when asked, if renewables were indeed the cheapest form of energy as he claims, when would our power bills come down? Albanese had to fudge that one, but in most other instances he was better able to articulate his policies.\n\nHe was able to reassure young Australians in particular, that he believes unequivocally in the science of climate change. Dutton didn’t seem so sure - which won’t endear him to many voters in teal and Greens seats the Coalition needs to win back this election. Verdict: Albanese by a whisker First they neutralised each other’s cost of living policies by going tit-for-tat with bribes around the budget. Now they’ve neutralised housing, by offering competing ideas so similar that it takes a pen and paper to reckon through their competing merits.\n\nThis debate brought home that on these things, the two major parties have effectively cancelled each other out. No low-engagement voter is going to remember which party stands for which of the housing policies the prime minister and the opposition leader bandied about tonight. Most voters won’t remember what the leaders said, but they will remember how the leaders made them feel. And on this front, the prime minister claimed the wedge. The Coalition is stuck trying to explain how its energy policy will transform the economy and make it more productive. Despite trying hard over the past few weeks to free themselves of the chains of economics, the Coalition is still in the habit of trying to pay for things. Meanwhile, Labor has a killer pitch: if you love something, they will make it free. Never mind where the money comes from. Only the opposition will cut, according to Albanese. Both leaders managed to cast a little shade on their opponent – in essence, that he is mad, bad, and dangerous to vote for. Dutton called the prime minister a liar and pointed out that his freebies will be paid for by young voters; Albanese attacked Dutton on foreign affairs and defence, undermining a key Coalition equity and seeking to reinforce the idea that Dutton is “Trumpy”. But there is a more important set of audiences that both leaders clearly had in mind.\n\nTheir carefully rehearsed messages provided content for a multitude of little campaign warlords, commanding a crucial booth here, an impassioned issue there, or an antsy demographic subgroup. Unions will be speaking to their audiences about affordable childcare, developers to theirs about Dutton’s sledge on the CFMEU. Likewise on migration, renewable energy, nuclear, free TAFE and more – dozens of little bites to excite a handful of votes which could prove crucial. These are the groups who will move molehills in an election contested in seat-by-seat combat. And if enough molehills move together, one or the other leader will be get a leg up in “climbing a mountain”, as the prime minister says, on election day. Albanese didn’t perform better on the night, but he won by providing TikTok soundbites for the next fortnight of campaigning. Verdict: Albanese, for the algorithm If I really have to pick a winner, it’s David Speers. Calm, firm and interrupted two endless gasbags without compunction. Loved that for us. He’s grown out of his Sky News vibes and looks right at home on the national broadcaster.\n\nSpeers completely skewered Peter Dutton on nuclear energy and water use. And when the Opposition Leader spoke at a million miles an hour, Speers interjected: “I”m just trying to clarify your plans, Mr Dutton.” If Speers gets sick of journalism, he would make a brilliant year-nine classroom teacher. Sadly, he’s not in the competition so we have to pick from two middle-aged men in pastel ties. Straight into housing. They both rehearsed well enough to remember their lines. In summary, we have supply guy versus use-your-super guy. So what was memorable? Albanese’s demeanour. He’s transmogrified from a wet wimp into a politician comfortable name-dropping other world leaders as friends. In comparison, Dutton exuded “pick me” energy, talking too fast and struggling to stand up for the science. His desire to be forceful combined with his staccato delivery made him stumble a bit. Albanese seemed more relaxed, more fluent. Loading\n\nThe most startling moment of the debate? Speers asked Dutton about climate change. The Opposition Leader replied, with a straight face, “I’m not a scientist,” though he did say he’d defer to their judgment. Dear god. Both looked like liars, though. Albanese claims to trust Trump. And I got even more confused by Dutton who on one hand said he was critical of the US president’s treatment of Ukraine president Volodymyr Zelensky but he would also do a better job of dealing with Trump. It was a head-spinning answer. I bring you this verdict replete with my own biases. I’m clearly a person with progressive views but Labor disappoints me on a regular basis. The Liberal Party will always be the party which enabled and accelerated robodebt. And now we know its leader is too timid to give a full-throated endorsement of climate science. Verdict: Albanese wins. At least he recognises the science.\n\nPeter Dutton went into this debate with a clear objective: downplay the hard man and play up the pragmatist. That was evident in everything from his assured and measured speaking style to his timing. Unlike Albanese’s opening and closing statements that overrode moderator David Speers’ repeated attempts to enforce the time limit, Dutton kept his succinct. It showed a discipline his campaign has sometimes lacked. Another example: after erring on Tuesday by claiming Indonesia’s president Prabowo Subianto had publicly confirmed reports Russia was seeking a debate in the country, Dutton admitted the mistake in the debate and moved on. He was more credible than Albanese on Trump too, saying he trusted the United States but didn’t know the president. Opposition Leader Peter Dutton\n\nAlbanese, on the other hand, strained credulity to breaking point by claiming he had “no reason not to” trust the president, whose wildly mercurial approach to governing is obvious to anyone in possession of their senses. When Albanese insisted his government had not commissioned modelling on winding back changes to capital gains tax and negative gearing — which this masthead revealed it had in September last year — Dutton was ready to pounce. It reinforced one of his key narratives that Albanese can be loose with the truth. Of course Dutton can be too — or so evasive it’s much the same thing. He lost points on climate, costings and housing. But blessed with low expectations from a couple of rough weeks on the campaign trail, Dutton came out a narrow winner.",
        "news_type": "Politics"
    },
    {
        "title": "As Albanese and Dutton fought it out, these were the questions they couldn’t answer",
        "link": "https://www.theage.com.au/politics/federal/as-albanese-and-dutton-fought-it-out-these-were-the-questions-they-couldn-t-answer-20250416-p5lsd6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Are we seeing the impact of climate change? What will you cut? The leaders skirted around many questions, or ignored them altogether, in the second debate.",
        "published_date": "Wed, 16 Apr 2025 22:48:24 +1000",
        "source": "The Age",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "But nobody gave a straight answer when Speers asked whether people should be able to use tax breaks to buy four, five or six properties. Loading Dutton instead brought the conversation back to Albanese’s denial that he would revisit the tax breaks for investors. “Anthony, your government modelled negative gearing changes and capital gains tax. The treasurer has done that,” he said. Albanese shot back: “That’s not right”. Dutton replied: “It is right”. This masthead revealed in September last year that Treasury had worked on options to scale back negative gearing and capital gains tax concessions.\n\nAsked about the modelling at the time, Treasurer Jim Chalmers said it was “not unusual at all for governments, or for treasurers, to get advice on contentious issues which are in the public domain.” Balancing the budget Both parties are going into this election with billions in big spending plans. Where will the money come from? Wednesday night did not deliver an answer. Albanese tried to spruik his government’s two surpluses. But given Labor’s most recent budget predicts the government will spend more than it raises for the next decade, host David Speers asked why so many of the government’s policies – wiping HECS debts, Medicare rebates, energy rebates – aren’t means tested. “The HECS debt is about intergenerational equity. We spoke before about young people. I think young people deserve a fair crack,” Albanese said in his first attempt to answer.\n\n“When I get sick or you get sick we have access to Medicare or a hospital. Every child, Peter’s or mine, will get access to a public education and school,” he said in a second. “[With] energy rebates, you had two choices because of the way it is delivered through the energy companies, you either give it to everyone or just to concession cardholders. We understand a whole lot of working people need that assistance in cost of living,” he said in a third. But he never gave a clear answer about the principle of giving cost-of-living relief to wealthy people, which is what Speers asked three times. Dutton’s grilling came a few moments later. First, he was asked if his public service cuts – eventually worth $7 billion a year – would cover all the Coalition’s spending. To that, Dutton gave a straight answer. “The short answer is no,” he said. “We won’t achieve all of the savings we need to achieve through our changes to the public service.”\n\nBut the clarity did not last long. Dutton was asked three times which part of the public service he would cut. He did not say. He was asked twice if foreign aid would be cut. He did not say. Cuts would come “where we find inefficiency,” he said. “It’s not something you can do from opposition to redesign the public service in the way that works.” Energy and climate change Labor’s ill-fated promise from before the 2022 election to bring power bills down $275 by this year has haunted the government. Albanese refused to walk into any kind of commitment like that on Wednesday night. Three times he was asked: “When will we see our power bills come down?” Albanese demurred. “What we need to do is to roll out renewables, make sure there’s energy security, make sure it’s backed up by batteries, by hydro and by gas,” he said, in one of several attempts at answering, but never delivered a timeline.",
        "news_type": "Politics"
    },
    {
        "title": "Federal election 2025 as it happened: Dutton, Albanese hold second leaders debate; Russian plans to house aircraft in Indonesia ‘not true’ says Marles",
        "link": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-anthony-albanese-peter-dutton-polls-early-voting-indonesia-russia-20250415-p5lrzv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Follow our live coverage of the 2025 federal election campaign, with 17 days to go until polling day.",
        "published_date": "Wed, 16 Apr 2025 22:22:32 +1000",
        "source": "The Age",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "Loading\n\nAlbanese and Dutton have now squared off in two debates. They launched their official campaigns on the weekend, and we are less than a week away from Australians being able to cast their vote (early voting opens on April 22 before the official election day on May 3).\n\nSo who won tonight’s contest? And did it sway your vote in any way?\n\nOur experts have handed down their verdicts: Chief political correspondent David Crowe, national affairs editor James Massola, senior writer Jacqueline Maley, deputy federal editor Nick Bonyhady, and columnists Parnell Palme McGuinness and Jenna Price have all given their opinions on the debate.\n\nYou can read them here.",
        "news_type": "Politics"
    },
    {
        "title": "PM Wong on relations with big powers, US tariffs and the future of the greenback",
        "link": "https://www.straitstimes.com/singapore/politics/pm-wong-on-relations-with-big-powers-baseline-tariffs-and-the-future-of-the-us-dollar",
        "description": "<p>He addressed foreign policy questions at a dialogue after delivering the 14th S. Rajaratnam Lecture.</p>\n",
        "published_date": "Wed, 16 Apr 2025 21:54:07 +0800",
        "source": "The Straits Times",
        "source_country": "Singapore",
        "countries_mentioned": [
            "Singapore"
        ],
        "content": "PM Lawrence Wong addressed questions on foreign policy at a dialogue after he delivered the 14th S. Rajaratnam Lecture on April 16. ST PHOTO: MARK CHEONG\n\nPM Wong on relations with big powers, US tariffs and the future of the greenback\n\nSINGAPORE – Singapore’s foreign policy approach is to have many best friends, including the US, China and Europe, and the city state does not want a world where it can have only one friend, said Prime Minister Lawrence Wong at a dialogue after he delivered the 14th S. Rajaratnam Lecture on April 16.\n\nIn a transcript released by the Ministry of Foreign Affairs, PM Wong answered questions that ranged from managing relations with the US and China, to the role Singaporeans can play in the nation’s foreign policy.\n\nManaging relations with the US and with China\n\nSingapore wants to stay good friends with both the US and China, and wants both countries to be actively engaged in the region, said PM Wong.\n\nEven as Washington becomes more focused on its “America First” agenda, the US still has many significant interests in the region, and Singapore wants to help the US understand its interests and anchor its presence here.\n\nThis is because an American retreat from this region would be dangerous for the neighbourhood and Singapore, he added.\n\nSingapore likewise has close ties with China, including significant government-to-government projects such as those in Suzhou, Tianjin and Chongqing.\n\nAll this cooperation is built on a strong foundation of people-to-people ties, and the Republic wants to further develop its relations with China.\n\nBut advancing relations with both powers will get harder, not just for Singapore but also for many other countries. It will take agility, vigilance and skilful diplomacy to avoid being squeezed by both sides, said PM Wong.\n\nThis is not just on the part of the Government – the wider society, including the media, businesses and academia, must also be principled and act in Singapore’s interest. This is the best way for the country to maintain its diplomatic space, he added.\n\nImpact of US tariffs on Asean\n\nSingapore takes no comfort from being spared the full brunt of the US’ tariffs, as its exports are linked to supply chains in the region and China.\n\nMany of the Republic’s products are value-added in factories across China and Asean before they are shipped to the US, said PM Wong.\n\nAsean economic ministers discussed the issue and decided against retaliatory tariffs, which would have hurt the region more, he added. While Asean countries will continue to engage the US individually, the grouping also plans to speak to the US collectively.\n\nIf there is a silver lining, it is that Asean now has added motivation to strengthen its regional economic integration. This includes making it easier for companies to operate seamlessly within Asean, which will make the region more competitive, said PM Wong.\n\nA more unified Asean will have a stronger voice, and increase its influence over how global developments unfold. All Asean countries recognise this, and that is why there are renewed efforts to deepen integration, he added.\n\nUS dollar to stay as global reserve currency in the medium term\n\nWhile countries will try to diversify away from the US dollar, it will remain the world’s reserve currency in the near to medium term as no other alternative exists today.\n\nCountries will hedge and use local currencies for transactions, but there is a limit to how far that is practical, which is why the US dollar will retain this role for business transactions for the foreseeable future, noted PM Wong.\n\nHowever, if US banks and the US dollar are increasingly used as instruments of statecraft to advance American policy, then countries around the world will only accelerate their efforts to develop diversification options, he said.\n\nHe noted that the US dollar and US markets, traditionally a safe harbour in an uncertain world, have experienced a shift, and that the risk premium on even the US has increased.\n\nNo one knows what will happen in the coming years if more uncertainty emerges from the US that may potentially destabilise the financial markets. That is why Singapore’s investment entities continue to diversify globally and never put all their eggs in one basket, said PM Wong.\n\nWhy S’poreans must unite on foreign policy\n\nIt is already very hard for Singapore, as a little red dot, to make an impact in this very dangerous and fragmented world, but it will be even more challenging if people within the country are not united on a national position to engage the world, said PM Wong.\n\nThis calls for more active engagement between the Government and the people, so that Singaporeans understand issues from a national standpoint, and rally together when a foreign policy decision is made, he added.\n\nInterestingly, noted PM Wong, the new external environment has resulted in greater interest among various segments of the population on issues such as tariffs and foreign policy when the Government holds dialogues, such as in universities.\n\nThis is because Singaporeans see what is happening around the world and know instinctively that something different is happening today, said PM Wong.\n\nGiven the interest from the public, the Government will do more to engage different groups and help Singaporeans understand what is at stake, he said.\n\nJoin ST's WhatsApp Channel and get the latest news and must-reads.",
        "news_type": "Politics"
    },
    {
        "title": "Red Dot United unveils line-up for Jurong East-Bukit Batok GRC and Jurong Central SMC  ",
        "link": "https://www.straitstimes.com/singapore/politics/red-dot-united-unveils-line-up-for-jurong-east-bukit-batok-grc-and-jurong-central-smc",
        "description": "<p>The RDU team will be up against a PAP team led by Minister for Sustainability and the Environment Grace Fu.</p>\n",
        "published_date": "Wed, 16 Apr 2025 20:01:57 +0800",
        "source": "The Straits Times",
        "source_country": "Singapore",
        "countries_mentioned": [
            "Singapore"
        ],
        "content": "SINGAPORE – Red Dot United (RDU) on April 16 unveiled its slate for the newly formed Jurong East-Bukit Batok GRC, which includes two candidates with political experience.\n\nMr Osman Sulaiman, 50, is a director of a waste management company, and contested the past three elections. He ran on the Reform Party’s ticket in 2011 and 2015, and was a candidate with the Singapore People’s Party in 2020.\n\nEntrepreneur and author Liyana Dhamirah, 38, was an RDU candidate for Jurong GRC in the 2020 General Election.\n\nThe five-member team is rounded out by contemporary artist Ben Puah, 48; marketing agency director Marcus Neo, 33; and principal software engineer Harish Mohanadas, 39.\n\nRDU will also contest the Jurong Central single seat, fielding piano teacher Emily Woo, 59, in the SMC. Madam Woo, who joined the party in 2020, was a teacher with the Ministry of Education and has been teaching the piano since 2000.\n\nRed Dot United will contest the Jurong Central single seat, fielding piano teacher Emily Woo in the SMC. ST PHOTO: GAVIN FOO\n\nRDU secretary-general Ravi Philemon introduced the party’s candidates at a press conference held at 255 Jurong East Street 24, near Jurong-Clementi Town Council.\n\nMr Philemon said those being fielded in both constituencies are the party’s “first-choice candidates”.\n\nThey were selected by the election committee after studying the demographics of the area, and not through “tikam tikam” – “randomly picked” in Malay – or frivolous thinking, he said.\n\n“When you’ve walked the ground the past five years, you know the demographics of the people who live in this constituency. And so we can make a good decision when it comes to fielding candidates,” he said. “We have done our work, we think we have a good chance. We think these constituencies are winnable.”\n\nIn the 2020 General Election, RDU, then the youngest political party, contested only Jurong GRC.\n\nMr Philemon said there is a “Geylang Serai of the west” near Jurong East-Bukit Batok GRC, and the constituency has a fairly large number of Malay/Muslim voters.\n\nAccording to a Straits Times analysis of demographic data, 15.3 per cent of the resident population there are Malays, higher than the national average of 13.5 per cent.\n\nIntroducing Mr Osman and Ms Liyana as the “anchor candidates” for the team, Mr Philemon said: “We acknowledge the Government has done a lot for the Malay/Muslim community, but in some areas... we can do more.”\n\nMr Osman, who is based in the Philippines, is prepared to return and be based in Singapore if elected, said Mr Philemon. “That is the kind of commitment he brings to the residents here,” he added.\n\nMs Liyana, who has overcome many struggles to become an entrepreneur, said she wants to champion issues close to the Malay/Muslim community.\n\nMr Harish, who is a central executive council member of RDU, is a former civil engineer with over a decade of experience in Singapore’s built environment sector.\n\nHe said the rising cost of living is hitting those who struggle the most, from the elderly to low-income families. He added that, if elected, he hopes to ensure that Singapore’s success is shared by all Singaporeans.\n\nMr Neo is the director of a boutique agency that serves law firms.\n\nMr Puah, whose works are part of major public and private collections, including those of the Singapore Art Museum and the National Institute of Education, joined RDU in 2024.\n\nThe core of the new Jurong East-Bukit Batok GRC comes from Jurong GRC, and it will also absorb all of Bukit Batok SMC and parts of Yuhua SMC and Hong Kah North SMC.\n\nThe RDU team will be up against a PAP team led by Minister for Sustainability and the Environment Grace Fu, the incumbent MP for Yuhua.\n\nBesides Ms Fu, 61, the other two incumbents are Minister of State for Law and Transport Murali Pillai, 57, and Minister of State for Health and Digital Development and Information Rahayu Mahzam, 44.\n\nPolitical newcomer David Hoe, 37, and Mr Lee Hong Chuang, 54, who was the PAP’s candidate for Hougang SMC in the 2015 and 2020 elections, round out the PAP’s slate for Jurong East-Bukit Batok GRC.\n\nAt the new Jurong Central SMC, carved out as a single seat from Jurong GRC with changes to the electoral boundaries, RDU’s Madam Woo will be up against incumbent and first-term MP Xie Yao Quan, 40.\n\nMadam Woo, who is a Jurong resident of over 20 years, said she has noticed municipal issues in the area , such as abandoned shopping carts, shaky lamp posts, peeling paint and littering.\n\n“Under RDU, if we are elected, we will do our best to ensure the littering problem is eradicated, and we will do our best to win the trust and confidence of the local constituents,” she said.\n\nFor the 2025 General Election, the party has introduced potential candidates for Nee Soon GRC and Holland-Bukit Timah GRC, and previously indicated interest in contesting Jalan Kayu SMC, Tanjong Pagar GRC and Radin Mas SMC.\n\nJoin ST's WhatsApp Channel and get the latest news and must-reads.",
        "news_type": "Politics"
    },
    {
        "title": "Nissan US chief says tariffs will hammer lower-income car shoppers",
        "link": "https://www.channelnewsasia.com/business/nissan-us-chief-says-tariffs-will-hammer-lower-income-car-shoppers-5070411",
        "description": "",
        "published_date": "Thu, 17 Apr 2025 01:22:23 +0800",
        "source": "Channel NewsAsia",
        "source_country": "Singapore",
        "countries_mentioned": [
            "Canada",
            "Singapore"
        ],
        "content": "DETROIT : The chairman of Nissan Americas, Christian Meunier, said on Wednesday he is concerned that tariffs may drive already eye-popping vehicle prices even higher.\n\n“Cars are becoming completely unaffordable,” Meunier told Reuters. \"It's not fair for the middle class or the lower class, the people that can't afford a car, to force them to buy a used car ... I think it's the responsibility of the government as well to keep it possible for people to buy a new car.\"\n\nU.S. President Donald Trump's 25 per cent tariffs on imported vehicles have rocked automakers in and outside of the U.S., most of which have become reliant on imports from Mexico and Canada.\n\nThe average transaction price of a vehicle in the U.S. \"is north of $48,000,\" according to an analysis from Cox Automotive. The firm expects tariffs will add 10 per cent to 15 per cent to prices of affected models, and an overall 5 per cent jump in prices of vehicles not subject to the levies.\n\nAmong the models most affected by tariffs are those priced under $30,000, almost all of which are produced outside the United States. Nissan's Versa, which Cox said has an average transaction price of about $20,000, is made in Mexico.\n\n“With the tariff coming through, it's going to be super difficult,\" Meunier said. \"The risk is that these (affordable) segments are going to disappear.”\n\nWhile it could be possible for Nissan to build less costly vehicles in the U.S. instead of Mexico, Meunier said it \"would be a challenge if we're not allowed to bring some parts from Mexico.\"\n\nAutomakers are also facing tariffs on a variety of important auto parts starting May 3, including engines, transmissions, lithium-ion batteries and other major components.\n\nThe Nissan executive said the Japanese automaker has the space to expand production in the U.S. The carmaker has 800,000-unit capacity at its two U.S. auto assembly plants, and produced about 525,000 vehicles in the 2024 calendar year.\n\nStill, he said Nissan is not reducing production capacity in Mexico.\n\n\"We will accept to pay tariffs for a period of time and see how we can maneuver. We'll have potentially to adjust along the way, but we'll be very careful, because ultimately, it's very important that we keep sales momentum.\"",
        "news_type": "Politics"
    },
    {
        "title": "Singapore SMEs enter contraction territory in Q1 2025 amid global uncertainty: OCBC",
        "link": "https://www.businesstimes.com.sg/singapore/smes/singapore-smes-enter-contraction-territory-q1-2025-amid-global-uncertainty-ocbc",
        "description": "This follows three consecutive quarters of expansion, which started in Q2 2024",
        "published_date": "Wed, 16 Apr 2025 10:27:21 +0000",
        "source": "Business Times",
        "source_country": "Singapore",
        "countries_mentioned": [
            "Singapore"
        ],
        "content": "[SINGAPORE] The Republic’s small and medium-sized enterprises (SMEs) slipped into contractionary territory in Q1 2025 for the first time since Q1 2024, the latest OCBC SME Index report released on Wednesday (Apr 16) indicated.\n\nThe quarterly index, which tracks the business health and performance of SMEs, fell slightly from 50.7 in Q4 2024 to 49.9.\n\nThis follows three consecutive quarters of expansion, which began in Q2 2024. A score above 50 reflects improved business health, while scores below 50 indicate deterioration.\n\nThis downward shift in SME performance is due to a weakening outlook, now exacerbated by tariff-driven global uncertainties, said the lender.\n\nThe report noted that both a slowing of global trade flows and a weaker outlook on the US dollar, will hurt local SMEs in outward-oriented sectors. These include sectors such as information and communications technology (ICT), transport and logistics and wholesale trade.\n\nThese industries posted an average of more than 40 per cent of collections made up by overseas customers, OCBC said, adding that of which 7 per cent are directly received from US-based payers. The lender noted that the collections are mostly denominated in US dollars.\n\nA NEWSLETTER FOR YOU Friday, 8.30 am SGSME Get updates on Singapore's SME community, along with profiles, news and tips. Sign Up Sign Up\n\nOverall collections grew by 1.7 per cent on year, while payments remained flat with no increase.\n\nOverall, the majority of SME owners surveyed by OCBC did not report a worsened outlook compared with the previous quarter.\n\nAmong the 1,000 business owners surveyed, 41 per cent felt that business conditions were the same, 36 per cent saw improvements, while 23 per cent felt that conditions had worsened.\n\nBusiness owners from the education, retail, and food and beverage sectors had the weakest outlook; almost 3 in 4 owners said that conditions had stayed the same or worsened. In export-oriented industries, more than 60 per cent of owners posted such responses.\n\nAs uncertainty over US President Donald Trump’s tariffs continues to dampen the global economic outlook, business owners from the transport and logistics, business services and wholesale trade industries responded that they would be the most affected by geopolitical uncertainties and market competition in the next six months.\n\nExternally oriented industries\n\nSMEs in externally oriented industries experienced contractions in the quarter, the report said.\n\nThe manufacturing sector contracted from 50.5 to 49.8, due to weakness in the precision engineering and consumer products segments. However, SMEs in the electronics and semiconductors segment recorded a “healthy pace of growth” from resilient external demand.\n\nCollections in the sector increased by 37.1 per cent on the year, while payments grew 18.9 per cent, driven by strong overseas growth.\n\nIn the transport and logistics industry, growth retraced from 51.7 in the previous quarter to 49.5. This was due to weakness in the sea transport and land transport segments, which will continue to be affected by weaker trade flows in the upcoming quarter, OCBC said.\n\nThe ICT sector continued its contractionary trend from the previous quarter, falling from 49.4 to 49.2 in Q1 2025. This marked the sector’s eleventh consecutive contractionary quarter, OCBC noted.\n\nThe reading was weighed down particularly by weaker growth in the data processing and software development segment and the IT consultancy segment.\n\nDomestic-facing sectors\n\nNeither were domestic-facing sectors spared. The healthcare sector inched up slightly but remained in contraction, rising to 49.8 from 49.7. Wage concerns continue to face SMEs in this sector, which reported a 15.5 per cent wage bill increase in Q1 2025.\n\nBusiness services dropped 0.4 point to 49.6 in first quarter of 2025, with significant declines in collections (15.1 per cent) and payments (15.9 per cent). The sector was weighed down by weaker growth in the business consultancy segment, which came in at 49.\n\nF&B fell from 51.1 in Q4 2024 to 49.6 in Q1 2025 – with the largest decline faced by the F&B services segment at 48.3, down from 50.6 in the previous quarter. Meanwhile, F&B wholesale trade SMEs experienced healthy growth, scoring 51.8 on the index.\n\nIn the education sector, SMEs experienced contraction after four consecutive quarters of expansion, with the index falling below 50 to 49.6 for the first time since Q4 2023.\n\nBuilding and construction SMEs inched lower to 49.5 in the first quarter of 2025, from 50.2 in Q4 2024.\n\nDomestic-facing SMEs are likely to experience impact from the tariffs, due to higher costs and inflationary pressures, said OCBC.\n\nThe lender added: “Businesses may consequently face challenges in maintaining their competitiveness and find themselves operating in a much more cautious business environment.”\n\nHowever, it noted that further regional collaboration, including the integration of Asean economies through initiatives such as the Johor-Singapore Special Economic Zone, could fuel cross border commerce and new business ventures.\n\nTrends in accessing green financing for sustainable development, as well as the growth of digital trade platforms, could present opportunities for SMEs to capture, the lender said.",
        "news_type": "Economics"
    },
    {
        "title": "California the 1st state to sue Trump administration over tariffs",
        "link": "https://www.cbc.ca/news/world/california-newsom-trump-tariffs-1.7511493?cmp=rss",
        "description": "<img src='https://i.cbc.ca/1.7511588.1744814544!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/usa-trump.JPG' alt='A cleanshaven man speaks and points toward an older man wearing a blazer and a ballcap.' width='620' height='349' title='Governor of California Gavin Newsom speaks next to U.S. President Donald Trump upon Trump&apos;s arrival to tour areas impacted or destroyed by the southern California wildfires, at Los Angeles International Airport in Los Angeles, California, U.S., January 24, 2025. REUTERS/Leah Millis'/><p>California Gov. Gavin Newsom said Wednesday his state will file a lawsuit challenging U.S. President Donald Trump's authority to impose sweeping tariffs, which have set off a global trade war.</p>",
        "published_date": "Wed, 16 Apr 2025 11:14:20 EDT",
        "source": "CBC News",
        "source_country": "Canada",
        "countries_mentioned": [
            "Canada"
        ],
        "content": "California Gov. Gavin Newsom said Wednesday that his state will file a lawsuit challenging U.S. President Donald Trump's authority to impose sweeping tariffs that have set off a global trade war.\n\nThe suit will argue that Trump's use of the International Emergency Economic Powers Act to impose tariffs on Mexico, Canada and China, or a 10 per cent tariff on all imports, is unlawful. The act enables a president to freeze and block transactions in response to foreign threats.\n\nTrump has offered many justifications for increasing tariffs, including that they are designed to spur U.S. manufacturing and stop the flow of illicit fentanyl into the country.\n\nCalifornia's move follows rapidly changing tariff plans by the Trump administration. It is the first state to take legal action over the tariffs, which have been previously legally challenged in suits filed by law firms representing business owners and civil liberties organizations.\n\nNewsom says the tariffs in effect have resulted in inflated costs and billions of dollars in damage in California, which has the largest economy among U.S. states and is a massive exporter.\n\n\"President Trump's unlawful tariffs are wreaking chaos on California families, businesses and our economy — driving up prices and threatening jobs,\" he said in a statement. \"We're standing up for American families who can't afford to let the chaos continue.\"\n\nAs with Democratic lawmakers on Capitol Hill, California is arguing that congressional approval was required for the tariffs. Senate Democrats were joined by four Republicans in a symbolic vote rebuking Trump over the tariffs earlier this month, but Trump loyalists lead the House of Representatives, making a similar vote there unlikely.\n\nTrade with Canada impacted\n\nThe state will ask the court to immediately block the tariffs in the lawsuit being filed in the U.S. District Court for the Northern District of California,\n\nWATCH l Trump still believes Canada would be a great state, White House says: Trump still wants Canada as 51st state, White House tells CBC News Duration 2:39 Answering a question from CBC News, the White House press secretary said U.S. President Donald Trump still thinks Canada should become the 51st state, but there may be ‘flexibility’ when it comes to tariffs on Canada's auto sector.\n\nThe announcement on Wednesday comes days after Newsom asked countries to exempt the state's exports from retaliatory tariffs and measures, stating, \"California is not Washington, D.C.\" No deals have yet been announced..\n\nCalifornia, which boasts its economy in terms of gross domestic product is only smaller than a handful of countries, borders Mexico and also enjoys a significant trade relationship with Canada. Trump has expressed grievances about the updated trilateral trade agreement he signed off on in 2019 with Mexico and Canada.\n\nThe Consulate General of Canada estimates that there is $53 billion US of two-way trade annually between Canada and California, and that there are nearly 2,000 Canadian-owned companies operating in the state, with about 90,000 total employees.\n\nCalifornia currently exports about $2 billion more in goods and services to Canada than it imports, the consulate says, but the strained relations as a result of the tariff threats from Washington have seen California wineries and alcohol suppliers punished as a result, with products wiped from the shelves of liquor stores in several provinces.\n\nCalifornia is a farming powerhouse, with many of the nuts, fruits and vegetables the state grows destined for other countries, while it is a significant importer of Canadian petroleum.\n\nNewsom also beckoned Canadians to the Golden State as part of a newly launched tourism campaign.\n\n\"Our inclusive values, love of natural beauty and passion for innovation bind us, and we look forward to welcoming you back with the same community spirit you've always shown us,\" Newsom says in the ad.\n\nWATCH l Canadian travel to the U.S. dips compared to previous year: Canadian travel to U.S. drops by nearly 900,000 in March Duration 2:02 U.S. border data shows that nearly 900,000 fewer people travelled from Canada to the U.S. in March, traditionally a busy month for cross-border travel. The drop has pushed the governor of California to lobby for Canadians to come back to his state.\n\nCalifornia estimates Canadians are the second-biggest international spenders for its tourism economy, with Newsom stating that two million Canadians visited last year. But state tourism officials say visits by Canadians dropped 12 per cent in February compared with the same month last year.\n\nDomestically, the California action stands to mark a resumption of the tensions between the state and the Trump administration. Conflicts dating back to the first Trump administration have arisen over automobile emissions and the environment, reproductive rights and access to abortion, and wildfire prevention and causes.",
        "news_type": "Politics"
    },
    {
        "title": "Trump isn't just a Canadian campaign issue. Australia grapples with its U.S. relationship in election",
        "link": "https://www.cbc.ca/news/world/australia-election-preview-trump-1.7511450?cmp=rss",
        "description": "<img src='https://i.cbc.ca/1.7511474.1744807794!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/australia-election-debate.JPG' alt='Two cleanshaven, bespectacled men are shown shaking hands on a stage. Both wear suit and tie. One of the men is bald, and appears several inches taller.' width='620' height='349' title='Australian Prime Minister Anthony Albanese and Opposition Leader Peter Dutton shake hands ahead of the second leaders&apos; debate of the 2025 federal election campaign at the ABC Studios in Parramatta, Sydney, Australia, April 16, 2025.  AAP Image/Pool via REUTERS    ATTENTION EDITORS - THIS IMAGE WAS PROVIDED BY A THIRD PARTY. NO RESALES. NO ARCHIVE. AUSTRALIA OUT. NEW ZEALAND OUT. NO COMMERCIAL OR EDITORIAL SALES IN NEW ZEALAND. NO COMMERCIAL OR EDITORIAL SALES IN AUSTRALIA.'/><p>U.S. President Donald Trump is looming large in the final weeks of Australia's general election campaign, spelling trouble for conservative Opposition leader Peter Dutton just as a new poll shows Australians' faith in the United States at an all-time low.</p>",
        "published_date": "Wed, 16 Apr 2025 09:27:36 EDT",
        "source": "CBC News",
        "source_country": "Canada",
        "countries_mentioned": [
            "Australia",
            "United Kingdom",
            "Canada",
            "India"
        ],
        "content": "U.S. President Donald Trump is looming large in the final weeks of Australia's general election campaign, spelling trouble for conservative Opposition leader Peter Dutton just as a new poll shows Australians' faith in the United States at an all-time low.\n\nTrump's blustery style and often disruptive policies, including \"reciprocal\" tariffs against long-time allies and attacks on U.S. government agencies, have begun to alarm Australian voters, analysts and academics say.\n\nThe dynamics are similar but not quite the same as in Canada, where the Liberal Party's fortunes, according to a raft of polls, have been revived dramatically by a change in leadership from Justin Trudeau to Mark Carney ahead of the April 28 vote.\n\nThe Labor Party of Australian Prime Minister Anthony Albanese has surged in various polls relative to Dutton's conservative coalition, with only three-and-a-half weeks until the May 3 election.\n\n\"Trump has emerged as the third candidate in this election campaign,\" said Mark Kenny, a professor specializing in politics at the Australian National University in Canberra.\n\n\"He's made it quite difficult for Peter Dutton to get his message across, and made it difficult for Dutton to be seen as an entirely independent figure in this election campaign.\"\n\nA woman walks past campaign signs depicting candidates in a riding in Lakemba, New South Wales, on March 12. (Hollie Adams/Reuters)\n\nA survey released on Wednesday by the Lowy Institute, a research foundation, found only 36 per cent of Australians expressed any level of trust in the U.S. to act responsibly, down 20 points since the last survey in June 2024 and the lowest since the annual poll was launched two decades ago.\n\nThe polling was conducted in March, before Trump announced his swathe of tariffs, including a blanket 10 per cent on all Australian imports.\n\n\"Given President Donald Trump's norm-shattering approach to his second term, it's no surprise that Australians are less trusting of the United States,\" said Ryan Neelam, the Lowy Institute's Director of Public Opinion and Foreign Policy.\n\nIncumbent tries to tie Dutton to Trump, Musk\n\nDutton, from the Liberal Party has campaigned on several policies seen widely as emulating Trump and his Department of Government Efficiency (DOGE) group, set up by Elon Musk. In January, Dutton appointed Jacinta Nampijinpa Price as a shadow minister for government efficiency, a position inspired by Musk's role, analysts said.\n\n\"With Australians sick of the wasteful spending that is out of control … Jacinta will be looking closely at how we can achieve a more efficient use of taxpayers' money,\" Dutton said at the time.\n\nThe Labor Party has capitalized on the shift in public sentiment, with Treasurer Jim Chalmers repeatedly referring to the opposition leader as \"DOGE-y Dutton.\"\n\nAlbanese said on Tuesday that Dutton would enact \"DOGE-style cuts\" to the public sector if he were elected.\n\n\"[Australians] are not enjoying the turmoil and the capriciousness of the White House, and Dutton's early enthusiasm along with other conservatives to celebrate Trump's win has been pretty much lead in his saddlebags all the way through this campaign,\" Australian National University's Kenny said.\n\n\"That weight has just got heavier and heavier as Trump has become less and less popular.\"\n\nConsiderable military, intelligence ties\n\nThe combative stance of the new U.S. administration is also a campaign topic in relation to the military co-operation between the two countries.\n\nAustralia has pledged to purchase three nuclear-powered Virginia submarines from the U.S. in the 2030s under the AUKUS trilateral security partnership which also includes the United Kingdom, in an arrangement that contains various plans and contingencies that span decades. The three countries are also, along with Canada and New Zealand, part of the Five Eyes intelligence-sharing alliance.\n\nAlbanese is shown with then-U.S. president Joe Biden at an event concerning the AUKUS partnership, at Naval Base Point Loma in San Diego on March 13, 2023. The security arrangement is set to last decades, but has taken on a different cast given the aggressive economic approach, even with allies, of U.S. President Donald Trump's administration. (Leah Millis/Reuters)\n\nThe Australian Submarine Agency said acquiring nuclear submarines was a key part of Australia's defence strategy of denial, and \"will be equipped for intelligence, surveillance, undersea warfare and strike missions.\"\n\nWhile AUKUS has strong support from the major Australian parties, disappointment has been expressed that the defence ties didn't win Australia exemptions from Trump's tariffs has put the program under unprecedented public scrutiny.\n\nIndependent lawmakers are skeptical of Trump and have called for a review of the submarine deal, though the impact of the independents could be limited unless a hung Parliament results from the May 3 vote.\n\nFormer prime minister Scott Morrison, who clinched the AUKUS treaty in 2021, said in an interview with Reuters that the threat posed by China and the deterrent of Australia operating nuclear-powered submarines in the South China Sea and Indian Ocean drove the agreement.\n\n\"China is the threat — of course they are — and that is what needs to be deterred,\" Morrison said.\n\n\"The idea of more U.S. and more British boats being in and around Australia, and on station in Australia, in the theatre, we always knew that would bring the earlier deterrent,\" he added.\n\nAustralia's plan to purchase Virginia submarines was added to AUKUS by Labor in 2023.\n\nAlbanese, elected in 2022, has been less willing to publicly criticize China, even as Australia's air force and navy continue freedom of navigation patrols in the South China Sea. This has become a point of political attack in the election campaign for Dutton, who was defence minister in Morrison's government.",
        "news_type": "Politics"
    },
    {
        "title": "Mahmoud Khalil will fight 'to the end' after judge OKs deportation case, says lawyer",
        "link": "https://www.cbc.ca/radio/asithappens/mahmoud-khalil-next-steps-1.7510994?cmp=rss",
        "description": "<img src='https://i.cbc.ca/1.7479149.1741604057!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/campus-protests-immigration-arrest.jpg' alt='A man begins to speak.' width='620' height='349' title='FILE - Student negotiator Mahmoud Khalil is on the Columbia University campus in New York at a pro-Palestinian protest encampment on April 29, 2024. (AP Photo/Ted Shaffrey, file)'/><p>It's been nearly 40 days since activist Mahmoud Khalil was arrested without charge in front of his pregnant wife and sent to an immigration detention facility, but his lawyer says he remains \"very strong.\"</p>",
        "published_date": "Tue, 15 Apr 2025 17:50:11 EDT",
        "source": "CBC News",
        "source_country": "Canada",
        "countries_mentioned": [
            "United Kingdom",
            "Canada"
        ],
        "content": "As It Happens 7:07 Mahmoud Khalil's lawyer says he's ready to fight 'to the end'\n\nIt's been nearly 40 days since activist Mahmoud Khalil was arrested without charge in front of his pregnant wife and sent to an immigration detention facility, but his lawyer says he remains \"very strong.\"\n\nThe Columbia University graduate student was the first of several pro-Palestinian campus activists detained by U.S. Immigration and Customs Enforcement (ICE) under President Donald Trump's administration.\n\nA U.S. immigration judge on Friday gave the administration the green light to proceed with its deportation case against Khalil. But the activist's lawyer, Esha Bhandari, says the fight is far from over.\n\n\"He's determined to fight this case through to the end and to vindicate the principle that he shouldn't be in a detention centre for his lawful and constitutionally protected speech and his advocacy,\" Bhandari of the American Civil Liberties Union (ACLU) told As It Happens host Nil Köksal.\n\nU.S. cites 1952 law to deport pro-Palestinian activists\n\nBorn in a Palestinian refugee camp in Syria, Khalil came to the U.S. on a student visa in 2022, and became a U.S. permanent resident last year. His wife, Noor Abdalla, is a U.S. citizen.\n\nHe completed a master's degree in public administration in December 2024 and was set to graduate in May. But those plans were disrupted when ICE officers came to his home at his university-owned apartment in New York City on March 8 and arrested him.\n\nHe was first held in New Jersey, then sent to a privately-owned immigration detention centre in Louisiana, where he has remained ever since.\n\nHe has not been charged with any crimes. Rather, his detention is based on his prominent role in the Columbia student protests against Israel's military campaign in Gaza.\n\nWATCH | Judge says Mahmoud Khalil's deportation case can proceed: U.S. judge rules Columbia student, activist Mahmoud Khalil can be deported Duration 1:58 A U.S. judge has ruled Columbia University graduate student and pro-Palestinian activist Mahmoud Khalil can be deported as a national security risk. Khalil was the first arrest under the Trump administration’s promised crackdown on campus protests.\n\nSecretary of State Marco Rubio said last month that Khalil should be removed from the U.S. because his presence in the United States has \"potentially serious adverse foreign policy consequences,\" citing a 1952 law called the Immigration and Nationality Act.\n\nIn a two-page letter submitted to the court and Khalil's lawyers, which they shared with reporters, Rubio wrote that Khalil should be removed for his role in \"antisemitic protests and disruptive activities, which fosters a hostile environment for Jewish students in the United States.\"\n\nBhandari says the government has not defined what type of speech falls under the scope of this law.\n\n\"That is a very troubling, chilling position to take, and there's no reason it would be limited to this particular issue,\" she said.\n\n\"The government could decide tomorrow that anyone who spoke out about the war in Ukraine in a way that it didn't like is now subject to the same law and can be detained. They could make the same argument about climate change.\"\n\nOther activists detained, threatened with deportation\n\nKhalil, she says, has garnered an outpouring of support from across the country that gives him strength to carry on.\n\nNevertheless, she says he should not have been taken from his home while he's expecting his first child, and sent 1,930 kilometres away to a facility in another state.\n\n\"Their personal circumstances are very important, but, of course, Mahmoud's not the only person being held behind bars at the moment for engaging in perfectly lawful speech,\" Bhandari said.\n\nDemonstrators gather in New York City on Saturday to demand Khalil's release. (David Dee Delgado/Getty Images)\n\nOn Monday, ICE detained Palestinian Mohsen Mahdawi — one of Khalil's friends and a fellow Columbia protester — at a Vermont immigration office where he had expected to be interviewed about finalizing his U.S. citizenship.\n\nRumeysa Ozturk, a Turkish student at Tufts University in Massachusetts, was arrested by masked and plainclothes agents in March , roughly a year after she co-authored an opinion piece in a student paper calling on the university to divest from companies with ties to Israel and to \"acknowledge the Palestinian genocide.\"\n\nColumbia's Yunseo Chung, a Korean American who has lived in the U.S. since she was seven, is fighting the Trump administration's attempts to have her deported after she participated in pro-Palestinian protests.\n\nWATCH | PhD student arrested by masked U.S. immigration agents: Tufts University PhD student arrested by masked ICE agents Duration 2:01 Tufts University PhD student Rumeysa Ozturk was arrested by masked U.S. immigration agents near Boston. The Trump administration is revoking her student visa, accusing the Turkish national of engaging in pro-Hamas activities.\n\nIt's not clear how many student activists are in immigration detention, but when asked about Ozturk's case, Rubio told reporters he's revoked nearly 300 visas from \"lunatics that are tearing things up.\"\n\nBhandari says this is \"no ordinary immigration enforcement.\"\n\n\"Nothing about this is normal,\" she said. \"This is a program of censorship using immigration law to achieve its ends.\"\n\nShe says it's one of several tools the administration is deploying, including investigating private law firms , and witholding funds from universities that fall afoul of Trump's agenda.\n\nIn Canada, Conservative Leader Pierre Poillievre vowed in a recent campaign stop to end the \"woke influence in federal support for university research.\"\n\nBhandari says the ACLU is asking a federal court to deem Khlalil's detention, and the government's use of the Immigration and Nationality Act, unlawful and unconstitutional.\n\nIn a separate case in a New Jersey federal court, Khalil is challenging his arrest, detention and transfer to Louisiana.\n\nWhile the Trump administration has flouted court orders before — most recently one from the U.S. Supreme Court to facilitate the return of a Maryland man who was mistakenly deported to El Salvador — Bhandari remains hopeful.\n\n\"We would fully expect that if any court orders the release of either Ms. Ozturk, Mr. Khalil, or anyone else that's currently in a detention facility, that the government will abide by that, as they have to,\" Bhandari said.",
        "news_type": "Politics"
    },
    {
        "title": "California sues Trump administration over global tariffs",
        "link": "https://globalnews.ca/news/11135552/california-sues-trump-administration-global-tariffs/",
        "description": "Trump imposed 10 per cent tariffs on goods from all countries and higher tariffs for countries the administration says have high barriers to U.S. imports, most of which he paused.",
        "published_date": "Wed, 16 Apr 2025 18:17:37 +0000",
        "source": "Global News (Canada)",
        "source_country": "Canada",
        "countries_mentioned": [
            "Canada"
        ],
        "content": "Send this page to someone via email\n\nCalifornia on Wednesday filed a lawsuit seeking to block U.S. President Donald Trump’s sweeping tariffs on foreign trading partners, accusing him of abusing his powers and inflicting financial harm on the state and nation.\n\nTrump imposed 10 per cent tariffs on goods from all countries and higher tariffs for countries the administration says have high barriers to U.S. imports, most of which he later paused for 90 days. He also imposed a 145 per cent tariff on China, with exceptions for certain electronics.\n\nChina has retaliated with a 125 per cent tariff against the U.S., and the European Union has approved tariffs to retaliate as well, though they are currently paused.\n\nIn executive orders imposing the tariffs, Trump has invoked laws including the International Emergency Economic Powers Act of 1977, which gives presidents special powers to combat unusual or extraordinary threats to the U.S. The Republican president has said that the United States’ net trade deficit relative to the rest of the world is a national emergency endangering its manufacturing capacity and making it dependent on foreign adversaries.\n\nStory continues below advertisement\n\n2:09 Honda staying in Canada for ‘foreseeable future’ despite U.S. tariffs\n\nIn Wednesday’s lawsuit, filed in federal court in San Francisco, California Governor Gavin Newsom and Attorney General Rob Bonta, both Democrats, allege that the 1977 law does not give the president the power to impose sweeping tariffs without the consent of Congress by unreasonably declaring a state of emergency.\n\nGet daily National news Get the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day. Sign up for daily National newsletter Sign Up By providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy\n\nCalifornia, which on its own would be the world’s fifth-largest economy and whose main trading partners are China, Mexico and Canada, has already been harmed and stands to be harmed further if the tariffs remain in place, Newsom and Bonta allege.\n\nThey are asking the court to bar the Department of Homeland Security and Customs and Border Protection from enforcing the tariffs.\n\nThe Trump administration already faces two similar lawsuits – one in the New York-based Court of International Trade by the business advocacy group Liberty Justice Center seeking to block all of the tariffs, and the other lawsuit in Florida federal court by a small business owner seeking to block the tariffs on China.\n\nStory continues below advertisement\n\n—Reporting By Brendan Pierson in New York, Editing by Alexia Garamfalvi and Chizu Nomiyama",
        "news_type": "Politics"
    },
    {
        "title": "U.S. Fed chief says tariffs, inflation fears mean rate cuts can wait",
        "link": "https://globalnews.ca/news/11135555/us-interest-rates-pause-inflation-tariffs/",
        "description": "The sharp volatility in financial markets since President Donald Trump announced sweeping tariffs April 2, only to put most on hold, led to questions on potential rate cuts. ",
        "published_date": "Wed, 16 Apr 2025 18:09:19 +0000",
        "source": "Global News (Canada)",
        "source_country": "Canada",
        "countries_mentioned": [
            "Canada"
        ],
        "content": "Send this page to someone via email\n\nThe Federal Reserve can stay patient and wait to see how tariffs and other economic policies of the Trump administration play out before making any changes to interest rates, Chair Jerome Powell said Wednesday.\n\n“For the time being, we are well positioned to wait for greater clarity” on the impact of policy changes in areas such as immigration, taxation, regulation, and tariffs, Powell said.\n\nThe sharp volatility in financial markets since President Donald Trump announced sweeping tariffs April 2, only to put most of them on hold a week later, has led to speculation about whether the Fed would soon cut its key interest rate or take other steps to calm investors. Yet the Fed is unlikely to intervene unless there is a breakdown in the market for Treasury securities or other malfunctions, economists say.\n\nIn written remarks to be delivered to the Economic Club of Chicago, Powell reiterated that the Trump administration’s tariffs are “significantly larger than anticipated.”\n\nStory continues below advertisement\n\n“The same is likely to be true of the economic effects, which will include higher inflation and slower growth,” he said.\n\n4:49 Bank of Canada pauses further interest rate cuts amid ongoing U.S. trade tensions\n\nPowell said the inflation will likely be temporary, but “could also be more persistent,” echoing a concern expressed by a majority of the Fed’s 19-member interest rate-setting committee in the minutes of their meeting last month.\n\nGet daily National news Get the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day. Sign up for daily National newsletter Sign Up By providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy\n\nYet some splits among the Fed’s interest rate-setting committee have emerged. On Monday, Fed governor Christopher Waller said that he expects the impact of even a large increase in tariffs to be temporary, even if they are left in place for several years. At the same time, he also expects such large duties would weigh on the economy and even threaten a recession.\n\nShould the economy slow sharply, even if inflation remained elevated, Waller said he would support cutting interest rates “sooner, and to a greater extent than I had previously thought.”\n\nStory continues below advertisement\n\nBut other Fed officials, including Neel Kashkari, president of the Fed’s Minneapolis branch, have said they are more focused on fighting the effects of higher tariffs on inflation, suggesting they are less likely to support rate cuts anytime soon.\n\nFor now, most recent reports suggest the economy is in solid shape. Hiring has been solid and inflation cooled in March. Yet measures of consumer and business confidence have plunged, raising concerns among economists that spending and business investment could weaken.",
        "news_type": "Economics"
    }
]