[
    {
        "name": "Reintroduce Moral Lessons",
        "event_id": "4",
        "severity": 0.95,
        "articles": [
            {
                "title": "Reintroduce moral lessons and increase play time to combat violence in schools: Anbumani ",
                "description": "",
                "published_date": "2025-04-15T18:53:33+00:00",
                "source": "The Hindu",
                "source_country": "India",
                "news_type": "Politics",
                "countries_mentioned": [
                    "United Kingdom",
                    "India"
                ],
                "link": "https://www.thehindu.com/news/national/tamil-nadu/reintroduce-moral-lessons-and-increase-play-time-to-combat-violence-in-schools-anbumani/article69452652.ece",
                "content": "PMK president Anbumani Ramadoss rued the instances of violence within the student community after an eighth standard student attacked another student with a sickle in Palayamkottai, Tirunelveli district, and urged the State Government to reintroduce moral lessons and increase physical education in schools.\n\nIn a statement, he said that the instances of students attacking fellow students is on an upward trend in southern districts. “In August 2023, student Chinnadurai was slashed inside his home in Nanguneri. In Srivaikuntam in Thoothukudi district, a student travelling in a bus was waylaid and attacked. Such incidents cause worry about where our society is heading to. Even in this incident, there seems to have been some animosity arising out of an issue over a pencil. The student should have moved on. But the student had so much hate that he concealed a weapon in his bag and attacked. This trend should be corrected,” he said.\n\nSchools should be a place to impart education and discipline, he added."
            }
        ],
        "createdAt": "2025-04-15T19:02:39.372685+00:00",
        "updatedAt": "2025-04-15T19:02:39.372685+00:00",
        "articleCount": 1,
        "summary": "",
        "timeline": "- 2025-04-15T18:53:33+00:00: Reintroduce moral lessons and increase play time t..."
    },
    {
        "name": "Indian Markets First",
        "event_id": "5",
        "severity": 0.95,
        "articles": [
            {
                "title": "Indian markets first in world to rebound from Trump tariff shock",
                "description": "Indian stock markets rebounded strongly after a long weekend. The NSE Nifty 50 index rose significantly in Mumbai. India has recovered losses from US tariffs. It is seen as a safe haven amid global market uncertainty. Strong domestic growth supports this. India may benefit from supply chain shifts away from China.",
                "published_date": "2025-04-15T12:00:18+00:00",
                "source": "Times of India",
                "source_country": "India",
                "news_type": "Economics",
                "countries_mentioned": [
                    "India"
                ],
                "link": "https://timesofindia.indiatimes.com/business/india-business/india-becomes-first-in-the-world-to-rebound-from-tariff-shock-leading-global-market-recovery/articleshow/120311596.cms",
                "content": "AI generated image\n\nStrong domestic fundamentals\n\nInvestor outlook improved\n\nIndia seen as resilient amid global trade risks\n\nNEW DELHI: Indian equities surged as markets reopened after an extended weekend, with the NSE Nifty 50 Index rallying by as much as 2.4% on Tuesday in Mumbai, surpassing its April 2 closing level. According to Bloomberg, this rebound makes India the first major market globally to erase losses stemming from the reciprocal tariffs imposed by US President Donald Trump earlier this month.While a broader index of Asian stocks remains down over 3% since the tariff announcements, India’s swift recovery has underscored its growing perception as a relative safe haven amid ongoing global market volatility , as per the Bloomberg report.Investors continue to view India’s large domestic-driven economy as better equipped to weather a potential global slowdown compared to peers more directly exposed to US tariffs. The escalating US-China trade war has further positioned India as an attractive alternative for global manufacturing, with India maintaining a conciliatory approach and working toward a provisional trade agreement with Washington, in contrast to Beijing’s retaliatory stance.ALSO READ: Indian and American trade delegations to begin discussions on a bilateral trade agreement this week “We remain overweight India in our portfolios,” said Gary Dugan, CEO of The Global CIO Office. “Supported by good domestic growth and aided by a likely diversification of supply chains away from China, Indian equities are seen as a safer bet over the medium term,” he told Bloomberg.India’s sharp rebound follows a nearly 10% slump in the Nifty 50 over the past two quarters, triggered by slowing economic growth, steep valuations, and continued foreign investor outflows. So far this year, overseas investors have sold more than $16 billion in Indian equities on a net basis, close to the record $17 billion withdrawn in 2022.ALSO READ | Sensex, Nifty surge over 2%: 5 reasons behind market rally Still, improving investor sentiment is being supported by relatively lower stock valuations, expectations of aggressive rate cuts by the Reserve Bank of India, and declining crude oil prices — a major positive for India’s import-heavy economy.As per Bloomberg data, the Nifty 50 is currently trading at 18.5 times its projected 12-month earnings, compared to a five-year average of 19.5 and a peak multiple of 21 in late September.“India is not insulated, but relatively better positioned amid the risk of a trade war given its low direct revenue exposure to US, particularly on the goods side,” said Rajat Agarwal, strategist at Societe Generale SA. “Indian equities should also benefit if oil prices sustain at low levels.”Data compiled by Bloomberg shows India accounted for just 2.7% of total US imports last year, far lower than China’s 14% and Mexico’s 15%."
            }
        ],
        "createdAt": "2025-04-15T19:02:39.085871+00:00",
        "updatedAt": "2025-04-15T19:02:39.085871+00:00",
        "articleCount": 1,
        "summary": "Indian stock markets rebounded strongly after a long weekend. The NSE Nifty 50 index rose significantly in Mumbai. India has recovered losses from US tariffs. It is seen as a safe haven amid global market uncertainty. Strong domestic growth supports this. India may benefit from supply chain shifts away from China.",
        "timeline": "- 2025-04-15T12:00:18+00:00: Indian markets first in world to rebound from Trum..."
    },
    {
        "name": "Fedex Launches Singapore-Us",
        "event_id": "11",
        "severity": 0.93,
        "articles": [
            {
                "title": "FedEx launches Singapore-US direct cargo flight ",
                "description": "The new link between Singapore and Anchorage link makes the company the only logistics provider with a direct flight to the continental...",
                "published_date": "2025-04-15T10:46:54+00:00",
                "source": "Business Times",
                "source_country": "Singapore",
                "news_type": "Economics",
                "countries_mentioned": [
                    "Malaysia",
                    "Singapore"
                ],
                "link": "https://www.businesstimes.com.sg/singapore/fedex-launches-singapore-us-direct-cargo-flight",
                "content": "[SINGAPORE] Courier and logistics giant FedEx has launched its first direct flight from Singapore to the US.\n\nThe new route is a “strategic investment and strengthens our long-term Asia-Pacific growth strategy connecting an important trade corridor between South-east Asia and the US,” said Kawal Preet, president of FedEx Asia-Pacific on Tuesday (Apr 15).\n\n“As the region remains an essential manufacturing and export hub, this new service gives businesses faster, more direct access to the US,” she added.\n\n“FedEx’s new direct cargo route signifies a milestone for their South Pacific Regional Hub and aligns with Singapore’s position as a global air cargo hub that connects the region to worldwide destinations,” said Chan Ih-ming, executive vice-president at Singapore Economic Development Board.\n\nIt also makes FedEx the only logistics provider to offer a non-stop cargo flight from the Republic to the continental US and strengthens Singapore’s position as a regional air hub, noted the company.\n\nWith the new flight, FedEx cargo travelling to the US need not transit through Japan, which saves up to a day in transit time.\n\nBT in your inbox Start and end each day with the latest news stories and analyses delivered straight to your inbox. Sign Up Sign Up\n\nShipments collected on Saturday in Singapore, Malaysia and Thailand can arrive in the US on the following Monday, instead of Tuesday.\n\nThe flight, which began on Mar 31, operates six times a week and is served by Boeing 777 freighters that depart from the FedEx South Pacific Regional Hub at Changi Airport. Each flight can carry around 88,000 kg of cargo.\n\nIn response to queries by The Business Times about launching a new US-Singapore air cargo link when blanket tariffs on all imports to the US were recently announced, Preet emphasised the strategic aspect of the new route.\n\n“With the current uncertainties in the global trade outlook, naturally, businesses focused on exports may take a more cautious approach in the short-to-medium term. Our new flight is a strategic response to the long-term prospects for the region’s economic growth.”\n\nFedEx shifted its regional headquarters to Singapore from Hong Kong in 2024, underscoring its emphasis on South-east Asia as a region that will lead Asia-Pacific’s future growth."
            }
        ],
        "createdAt": "2025-04-15T19:02:43.296279+00:00",
        "updatedAt": "2025-04-15T19:02:43.296279+00:00",
        "articleCount": 1,
        "summary": "The new link between Singapore and Anchorage link makes the company the only logistics provider with a direct flight to the continental...",
        "timeline": "- 2025-04-15T10:46:54+00:00: FedEx launches Singapore-US direct cargo flight "
    },
    {
        "name": "Ge2025: Kickstarts Campaign",
        "event_id": "15",
        "severity": 0.91,
        "articles": [
            {
                "title": "GE2025: WP kickstarts campaign with slogan ‘Working for Singapore’",
                "description": "[SINGAPORE] The Workers’ Party has released what looks to be its campaign slogan for the 2025 general election – ‘Working for Singapore’.\n",
                "published_date": "2025-04-15T09:30:16+00:00",
                "source": "Business Times",
                "source_country": "Singapore",
                "news_type": "Politics",
                "countries_mentioned": [
                    "Singapore"
                ],
                "link": "https://www.businesstimes.com.sg/singapore/ge2025-wp-kickstarts-campaign-slogan-working-singapore",
                "content": "[SINGAPORE] The Workers’ Party has released what looks to be its campaign slogan for the 2025 general election – ‘Working for Singapore’.\n\nReleasing this shortly after the Writ of Election was issued on Tuesday (Apr 15), the WP said its slogans may have changed over the years, but the party’s mission remains the same.\n\n“The Workers’ Party prides ourselves on contributing to unity in diversity. Our voices aim to represent the diverse Singaporean population, while working towards a First World Parliament,” it said on its social media accounts.\n\nThe party urged Singaporeans to “step up” as it continues to work for Singapore.\n\n“None of this could have happened without your continuous support. By making your vote count in 2020, we made history by having the highest number of opposition MPs in Parliament,” it said.\n\n“From 2020 to 2025, our ideas were heard and acted upon by the government. Together, we’ve shown that constructive opposition leads to better outcomes. But the work is not done. We cannot stop here. We will continue to work for Singapore, and we hope you will step up and do so too.”\n\nBT in your inbox Start and end each day with the latest news stories and analyses delivered straight to your inbox. Sign Up Sign Up\n\nWP followed up with the release of a teaser video with the tagline: “It’s time. #StepUp with us. Together, we’re #WorkingForSingapore.”\n\nThe video featured all eight of the party’s elected MPs – Aljunied GRC MPs Pritam Singh, Sylvia Lim, Faisal Manap and Gerald Giam; Hougang MP Dennis Tan; and Sengkang GRC MPs Louis Chua, He Ting Ru and Jamus Lim.\n\nIn the video, Giam said it is important to have balance in the political system. “We cannot have one party that’s dominating everything in Singapore. There needs to be more diversity,” he said.\n\nAssociate Professor Lim said the only way that successful new ideas can come to fruition is through a contest. “That’s necessary and healthy for any mature democracy,” he added.\n\nLim added: “If the PAP fails, what’s our Plan B?”\n\nBefore the video ended with the ‘Working For Singapore’ tagline, Singh called Singaporeans the “true agents of change”.\n\n“The Workers’ Party is just the platform to bring their voices into Parliament, and the true people who have power are the voters. And they control the future,” he said.\n\nWP is the most successful opposition party in Singapore to date. Its candidates in the 2020 general election clinched 10 seats in Parliament after winning two group representation constituencies – Aljunied and Sengkang – and the single-member constituency of Hougang.\n\nIts secretary-general Pritam Singh was designated Leader of the Opposition after the 2020 polls, making him the first opposition leader to formally hold such an office. The post granted Singh the right of first response among MPs, more time to speak in Parliament, staff support and resources to carry out the role, double the allowance of an elected MP, and office space at Parliament House.\n\nUp till the writ’s release, WP has heavily guarded its election plans, including the constituencies it would contest and its slate. The party was only explicit about its medium-term goal to win one-third of the seats in Parliament.\n\nBased on observations at walkabouts and party sources, The Straits Times gathered that the WP is likely to field a bumper crop of at least 30 candidates in eight constituencies this time round.\n\nThese are: Aljunied, Sengkang, Punggol, East Coast, Marine Parade-Braddell Heights and Tampines GRCs, and the single seats of Hougang and Tampines Changkat.\n\nThis would be the WP’s largest showing in an election yet - the party contested 23 seats in 2011, 28 seats in 2015, and 21 seats in 2020.\n\nST also estimated that at least 17 of the WP’s 2025 slate are expected to be new faces, many of them professionals, including lawyers and management consultants. This would surpass the record 16 newcomers in 2011 and 2015, and almost double the nine fielded in 2020.\n\nAmong the 13 new faces that ST has identified are Dr Ong Lue Ping, 47, who was IMH’s director of allied health from 2022 to 2024, Michael Thng, 37, a master’s graduate from Harvard Kennedy School, and Kenneth Tiong, 36, the former head quant developer of Brahman Capital. THE STRAITS TIMES\n\nFor more election coverage, visit our GE2025 microsite"
            }
        ],
        "createdAt": "2025-04-15T19:02:43.566286+00:00",
        "updatedAt": "2025-04-15T19:02:43.566286+00:00",
        "articleCount": 1,
        "summary": "[SINGAPORE] The Workers’ Party has released what looks to be its campaign slogan for the 2025 general election – ‘Working for Singapore’.\n",
        "timeline": "- 2025-04-15T09:30:16+00:00: GE2025: WP kickstarts campaign with slogan ‘Workin..."
    },
    {
        "name": "Young Entrepreneurs Going",
        "event_id": "6",
        "severity": 0.8,
        "articles": [
            {
                "title": "Young entrepreneurs talk about going beyond grades and pay at ST Podcast Live event",
                "description": "<p>About 100 people attended the live recording at indie cinema The Projector at Golden Mile Tower.</p>\n",
                "published_date": "2025-04-15T15:30:00+00:00",
                "source": "The Straits Times",
                "source_country": "Singapore",
                "news_type": "Economics",
                "countries_mentioned": [
                    "Malaysia",
                    "Singapore"
                ],
                "link": "https://www.straitstimes.com/singapore/young-entrepreneurs-talk-about-going-beyond-grades-and-pay-at-st-podcast-live-event",
                "content": "The second edition of ST Podcasts Live was held at the Projector at Golden Mile Tower on April 15. PHOTO: JASPER YU\n\nYoung entrepreneurs talk about going beyond grades and pay at ST Podcast Live event\n\nSINGAPORE – As a young boy, Mr Nabill Shukry Johari, 27, always saw entrepreneurship as a way out of poverty – and he has proven himself right.\n\nNow in his final semester as a part-time marketing student at the Singapore University of Social Sciences, he runs two businesses: Cheekies, a meal prep company supplying five food and beverage outlets, and Cheeky Media, a creative agency that helps brands thrive on TikTok Shop.\n\nHe said: “Through this entrepreneurship route, I’m able to save a lot of money and pay for my mother’s medical expenses. And when we go out for dinner, we don’t have to think about the bill. I can just treat my parents to a good dinner.”\n\nIn the second edition of ST Podcasts Live, Mr Nabill was joined by Ms Adella Yeo Rae-Nyse, 27, a fellow entrepreneur and co-founder of career-matching platform MatcHub.\n\nExplaining why she turned her back on a nine-to-five job, Ms Yeo said: “Back then, our parents’ definition of success was a good stable job, a good income, and a basic standard of living... But what I really look for is happiness and self-accomplishment.”\n\nThe conversation, part of The Straits Times’ In Your Opinion podcast, was hosted by ST assistant podcast editor Lynda Hong. The full recording will be posted on ST Podcasts’ YouTube, Apple Podcasts and Spotify on April 23.\n\nAbout 100 people attended the live broadcast at indie cinema The Projector at Golden Mile Tower. PHOTO: JASPER YU\n\nAbout 100 people attended two recordings at indie cinema The Projector at Golden Mile Tower.\n\nAt the event, Mr Nabill and Ms Yeo responded to questions about how young people should handle setbacks when they choose to go into business for themselves.\n\nMs Yeo, who now works remotely as an account manager at a software firm, recalled how an internship once left her overwhelmed and demotivated when her manager reprimanded her for not completing a design task well.\n\nHer former school teachers and mentors advised her not to be bogged down by her weaknesses, but to find ways to shine using her strengths. So, she asked her manger to switch her to a client-facing role, and she started to excel.\n\nMs Yeo said: “Seek advice from others, try to change or get out of the (bad) situation and see opportunities.”\n\nSince starting Cheekies in 2021, Mr Nabill has been tempted to throw in the towel many times after facing setbacks – including when Malaysia stopped supplying chicken to Singapore and local stock was limited.\n\n“(But) that gave me the opportunity to explore other products. After that, I released chicken chop and lamb chop, and they opened me to new markets and more customers,” he said.\n\nDuring Ramadan, when orders dipped as customers did not want to cook, he introduced single portions of ready-to-eat meals.\n\nMr Nabill said: “Setbacks sometimes can be crushing...you have to communicate with people, seek advice and look at things from a bigger perspective.”\n\nThe special In Your Opinion podcast live recording was organised in partnership with the National Youth Council (NYC), in support of the SG Youth Plan – an action blueprint for how society can listen, support and partner young people.\n\n(From left) In Your Opinion host Lynda Hong with guest speakers Adella Yeo Rae-Nyse and Nabill Shukry Johari, as they take a wefie with the 100-strong audience at the Projector at Golden Mile Tower on April 15. PHOTO: JASPER YU\n\nThe event, hosted by Money FM 89.3 producer-presenter Dan Koh, is part of a series of six ST Podcasts Live events in 2025 celebrating The Straits Times’ 180th anniversary.\n\nIt also included the recording of the Health Check Podcast, helmed by ST senior health correspondent Joyce Teo, who discussed how young adults can better care for their mental health.\n\nThe Health Check podcast covered the topic of how young adults can better care for their mental health while juggling work and relationships. PHOTO: JASPER YU\n\nJoining her were Mr Delane Lim, executive director of the Character and Leadership Academy – a youth development charity – and Ms Lee Yi Ping, a principal case manager and the programme lead for Chat – Centre of Excellence for Youth Mental Health.\n\nIf you’re keen to discover The Straits Times’ podcast network of shows, the ‘one-stop shop’ way to do it is via your fave audio apps or on the ST app itself:\n\nChannel: https://str.sg/wvz7\n\nApple Podcasts: https://str.sg/wukK\n\nSpotify: https://str.sg/wukH\n\nYouTube: https://str.sg/4Vwsa\n\nGet The Straits Times app from\n\nThe App Store: https://str.sg/icyB\n\nGoogle Play: https://str.sg/icyX\n\nFor more information, read this article from The Straits Times: https://www.straitstimes.com/singapore/national-youth-council-shape-singapore-future-earn-rewards-education-mental-health-sustainability To share ideas and have your voice heard, check out the SG Youth Plan Quest at https://go.gov.sg/sgyp-mc To find out more about NYC’s upcoming engagement sessions, visit https://www.YouthPlan.gov.sg\n\nElisha Tushara is a correspondent at The Straits Times specialising in Singapore’s education landscape."
            },
            {
                "title": "PAP plans for East Coast GRC unveiled on new website      ",
                "description": "<p>The website details both the work completed over the past five years and a forward-looking roadmap to 2030.</p>\n",
                "published_date": "2025-04-15T15:15:00+00:00",
                "source": "The Straits Times",
                "source_country": "Singapore",
                "news_type": "Politics",
                "countries_mentioned": [
                    "Singapore"
                ],
                "link": "https://www.straitstimes.com/singapore/politics/pap-promises-for-east-coast-grc-unveiled-in-new-website",
                "content": "(From left) PAP new faces Hazlina Abdul Halim and Goh Pei Ming, Minister for Culture, Community and Youth Edwin Tong, Deputy Speaker Jessica Tan and Senior Minister of State Tan Kiat How at the launch of the website on April 15. ST PHOTO: AZMI ATHNI\n\nSINGAPORE - A vision to make the “East Side Best Side” was unveiled on April 15, with the PAP representatives for East Coast GRC laying out a refreshed slate of promises and plans on a new website.\n\nThe promises were organised around eight pillars – A Place To Learn, Care, Eat, Pray, Conserve, Play, Shape The Future, and A Place For All – and can be found on oureastcoast.sg, which went live at noon.\n\nThe website features work completed in the constituency over the past five years, and a road map that looks forward to 2030.\n\nAt a media briefing on April 15, Minister for Culture, Community and Youth Edwin Tong said core infrastructure is already in place, so the next phase of the East Coast Plan will centre on residents’ lived experiences.\n\n“Now that we have the baseline of infrastructure, we are going to take off from there and construct a plan moving forward, based on how our residents would like to use the facilities and how they organise themselves and their family,” said Mr Tong.\n\nThe plan is organised around how people live, work and play, not around “public shelters or how many footpaths or how many walkways”, he said.\n\nThe East Coast Plan was first introduced during the 2020 General Election by Deputy Prime Minister Heng Swee Keat, the five-member group representation constituency’s anchor minister. He was not present at the briefing.\n\nThe team of five providing the update comprised Mr Tong, Senior Minister of State Tan Kiat How, Deputy Speaker Jessica Tan and PAP new faces Hazlina Abdul Halim and Goh Pei Ming.\n\nOn April 12, Minister in the Prime Minister’s Office Maliki Osman, who was part of the team that stood in East Coast GRC in 2020, said he would not be contesting there in the upcoming election and named Madam Hazlina as his successor.\n\nMadam Hazlina, the former chief executive of Make-A-Wish Singapore, started her career as a radio presenter for Mediacorp’s Ria 89.7FM.\n\nShe later transitioned into television, and was at one point an assignments editor on CNA’s Singapore desk.\n\nMr Goh was Singapore Armed Forces chief of staff – joint staff.\n\nThe refreshed East Coast Plan for the next five years aims to equip residents with opportunities to learn and grow. It covers programmes such as digital inclusion for seniors, youth leadership, mental wellness and support for caregivers.\n\nPreserving hawker culture and fostering interfaith harmony are central themes, alongside efforts to create inclusive public spaces and support for pet owners, families and lower-income households.\n\nEnvironmental sustainability – such as expanded green spaces, electric vehicle charging points and community-led conservation initiatives – also features in the plan.\n\nIt also outlines planned infrastructure improvements in the area, such as the upgrading of Tanah Merah MRT station, new Build-To-Order projects in Simei, revamping Kampong Chai Chee Community Club into a community hub and the construction of Safra Bayshore.\n\n“We thought to create a plan that was not centred on hardware facilities, but on the way in which our residents saw these facilities as improving their lives,” said Mr Tong.\n\nJoin ST's WhatsApp Channel and get the latest news and must-reads."
            }
        ],
        "createdAt": "2025-04-15T19:02:42.573067+00:00",
        "updatedAt": "2025-04-15T19:02:42.573067+00:00",
        "articleCount": 2,
        "summary": "<p>About 100 people attended the live recording at indie cinema The Projector at Golden Mile Tower.</p>\n",
        "timeline": "- 2025-04-15T15:15:00+00:00: PAP plans for East Coast GRC unveiled on new websi...\n- 2025-04-15T15:30:00+00:00: Young entrepreneurs talk about going beyond grades..."
    },
    {
        "name": "Revolutionise Stock Market,",
        "event_id": "0",
        "severity": 0.6,
        "articles": [
            {
                "title": "AI will revolutionise the stock market, but not in the way you think",
                "description": "The new tech can process vast amounts of data, detect patterns invisible to the human eye, and execute trades at lightning speed. But that’s not its main advantage.",
                "published_date": "2025-04-15T19:01:00+00:00",
                "source": "The Sydney Morning Herald",
                "source_country": "Australia",
                "news_type": "Economics",
                "countries_mentioned": [
                    "Australia"
                ],
                "link": "https://www.smh.com.au/money/investing/ai-will-revolutionise-the-stock-market-but-not-in-the-way-you-think-20250415-p5lrt8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
                "content": "Every few decades, a new technology emerges that promises to revolutionise investing. In the past, innovations such as the HP-12C calculator, Bloomberg terminals and high-frequency trading were expected to give investors an edge. The latest is artificial intelligence, which is being hailed as the future of market analysis and portfolio management.\n\nBut history tells us a different story – none of these tools made markets easier to beat; they only made them more efficient. AI will follow the same path, further reinforcing why Australian retail investors, SMSFs and super funds should embrace index funds.\n\nIf highly paid professionals can’t beat the market, why should we expect AI-based stock picking to be any better? Credit: Getty\n\nThe appeal of AI in investing is obvious. Machines can process vast amounts of data, detect patterns invisible to the human eye and execute trades at lightning speed.\n\nBut securities markets already reflect all available information almost instantly and AI will only accelerate this process. Some elite hedge funds may use AI to extract short-lived trading edges, but these advantages won’t last long."
            },
            {
                "title": "AI will revolutionise the stock market, but not in the way you think",
                "description": "The new tech can process vast amounts of data, detect patterns invisible to the human eye, and execute trades at lightning speed. But that’s not its main advantage.",
                "published_date": "2025-04-15T19:01:00+00:00",
                "source": "The Age",
                "source_country": "Australia",
                "news_type": "Economics",
                "countries_mentioned": [
                    "Australia"
                ],
                "link": "https://www.theage.com.au/money/investing/ai-will-revolutionise-the-stock-market-but-not-in-the-way-you-think-20250415-p5lrt8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
                "content": "Every few decades, a new technology emerges that promises to revolutionise investing. In the past, innovations such as the HP-12C calculator, Bloomberg terminals and high-frequency trading were expected to give investors an edge. The latest is artificial intelligence, which is being hailed as the future of market analysis and portfolio management.\n\nBut history tells us a different story – none of these tools made markets easier to beat; they only made them more efficient. AI will follow the same path, further reinforcing why Australian retail investors, SMSFs and super funds should embrace index funds.\n\nIf highly paid professionals can’t beat the market, why should we expect AI-based stock picking to be any better? Credit: Getty\n\nThe appeal of AI in investing is obvious. Machines can process vast amounts of data, detect patterns invisible to the human eye and execute trades at lightning speed.\n\nBut securities markets already reflect all available information almost instantly and AI will only accelerate this process. Some elite hedge funds may use AI to extract short-lived trading edges, but these advantages won’t last long."
            }
        ],
        "createdAt": "2025-04-15T19:27:47.439303+00:00",
        "updatedAt": "2025-04-15T19:27:47.439303+00:00",
        "articleCount": 2,
        "summary": "The new tech can process vast amounts of data, detect patterns invisible to the human eye, and execute trades at lightning speed. But that’s not its main advantage.",
        "timeline": "- 2025-04-15T19:01:00+00:00: AI will revolutionise the stock market, but not in...\n- 2025-04-15T19:01:00+00:00: AI will revolutionise the stock market, but not in..."
    },
    {
        "name": "Opposition Parties Election",
        "event_id": "12",
        "severity": 0.58,
        "articles": [
            {
                "title": "Opposition parties ramp up election preparations, as some criticise date of Polling Day",
                "description": "<p>The Straits Times reached out to eight opposition parties to get their reactions.</p>\n",
                "published_date": "2025-04-15T15:47:13+00:00",
                "source": "The Straits Times",
                "source_country": "Singapore",
                "news_type": "Politics",
                "countries_mentioned": [
                    "United Kingdom",
                    "Singapore"
                ],
                "link": "https://www.straitstimes.com/singapore/politics/opposition-parties-ramp-up-election-preparations-as-some-criticise-date-of-polling-day",
                "content": "The various opposition parties put out statements after the Writ of Election was issued pn April 15. PHOTO: ST FILE\n\nOpposition parties ramp up election preparations, as some criticise date of Polling Day\n\nSINGAPORE - The various opposition parties will ramp up efforts to win over voters, as some expressed concerns over the short runway to the general election.\n\nParliament was dissolved on April 15, with Nomination Day on April 23. Singaporeans will head to the polls on May 3 to elect 97 MPs across 33 constituencies.\n\nThe various opposition parties put out statements after the Writ of Election was issued.\n\nSingapore Democratic Party (SDP)\n\nThe SDP criticised the “impossibly short” timeline between the release of the Electoral Boundaries Review Committee (EBRC) report for the 2025 General Election and the dissolution of Parliament.\n\nThe report on the new electoral boundaries was released on March 11, 35 days before Parliament was dissolved.\n\nIn 2020, the EBRC report was published on March 13 that year with the Writ issued three months later on June 23.\n\nIn 2015, there was a month’s gap between the release of the report and the issuance of the Writ.\n\nSDP, which plans to contest Sembawang GRC, Sembawang West SMC, Marsiling-Yew Tee GRC and Holland-Bukit Timah GRC, said Singaporeans need the time to thoroughly examine issues like the cost of living before casting their votes.\n\n“Elections are solemn exercises where the people are given ample time to become thoroughly familiar with the parties, their platforms and candidates so that they can make informed decisions at the polls,” the statement said.\n\nHowever, with the short amount of time left, Singaporeans have been denied “this crucial opportunity”, the party said.\n\nRed Dot United (RDU)\n\nMr Ravi Philemon, secretary-general of the RDU, said opposition parties now have just over two weeks to organise themselves for “a defining election” .\n\nHe also questioned why Nomination Day was taking place on April 23. Having it on April 22 instead would allow Cooling-off Day to be on May 1 – Labour Day – and Polling Day on May 2.\n\n“Instead, this election has been timed so that Labour Day will be followed immediately by Cooling-off Day – a day when all political parties are legally barred from speaking,” he said .\n\nThe opposition parties will not be able to respond to statements put out by the ruling party during the May Day Rally, Mr Philemon said.\n\nHe added that RDU has been preparing since 2020 and is ready for the election.\n\nThe party’s candidates will be revealed in the lead-up to Nomination Day, he said, adding that RDU will remain focused on championing issues that residents face such as cost of living, jobs and quality of life.\n\nRDU has thus far introduced its team leads for Nee Soon GRC, Holland-Bukit Timah GRC, Jurong East-Bukit Batok GRC and Jurong Central SMC .\n\nPeople’s Power Party (PPP)\n\nThe PPP said it was deeply disappointed that the PAP had called an election “without allowing sufficient time” between the issuance of the Writ of Election and Nomination Day.\n\nIt said the timeline appeared to be a move to capitalise on the fear stoked by US President Donald Trump’s “reciprocal” tariffs.\n\nThe party said there are urgent national issues demanding attention, such as the rising cost of living, job insecurity, overpopulation, and a persistent lack of effective checks and balances in the system.\n\nThus far, the PPP has signalled its intentions to contest Tampines GRC and Ang Mo Kio GRC.\n\nSingapore Democratic Alliance (SDA)\n\nMr Desmond Lim, chairman of the SDA, which will contest Pasir Ris-Changi GRC, says his party is ready for the election.\n\n“We are in operational readiness (mode). We’re just like soldiers on reservist,” he said .\n\nHis team has already printed 50,000 campaign fliers and 2,000 campaign posters.\n\nThe party currently has about 200 volunteers ready to act as polling and counting agents, and held training sessions at its headquarters in Changi Road on the night of April 15 .\n\nMr Lim said that instead of holding a physical rally, which may “inconvenience the elderly”, the party will conduct one online, having started to record the materials this week.\n\nNational Solidarity Party (NSP)\n\nSecretary-general Spencer Ng told The Straits Times that the party was unsurprised by the date .\n\n“This is detrimental to the spirit of democracy, but nonetheless, the opposition parties have to play by the rules set by the PAP and be ready as best we can.”\n\nCurrently, the party is planning to ramp up its campaign, having filled up its slots for volunteers in the constituencies it has laid claim to.\n\nThese comprise Sembawang GRC, Sembawang West SMC, Tampines GRC, Tampines Changkat SMC and possibly Jalan Besar GRC .\n\nSingapore People’s Party (SPP)\n\nSPP said in a statement that the upcoming election represents a pivotal moment in Singapore’s political landscape, being the first under Prime Minister Lawrence Wong and the Republic’s fourth-generation leadership team.\n\n“The SPP views this as an opportunity for Singaporeans to voice their concerns, aspirations and frustrations, so as to shape the future direction of our country,” it said.\n\nSecretary-general Steve Chia has called for people to step up as volunteers, urging them to “come together and make a meaningful difference”.\n\nSPP added that it is committed to “participating actively in this democratic process” with five candidates standing in Potong Pasir SMC and Bishan-Toa Payoh GRC.\n\n“Our focus will be on addressing the pressing concerns of Singaporeans, including the rising cost of living, income inequality, and the need for more inclusive policies that cater to all segments of society,” the party said.\n\nSingapore United Party (SUP)\n\nMr Andy Zhu, secretary-general of SUP, which is contesting Ang Mo Kio GRC, said the election is an opportunity for residents to shape the future of Singapore .\n\nIn the coming days, SUP will be increasing the frequency of its outreach and coordinating its proposers, seconders and assenters.\n\nIt is also waiting for the completion and delivery of its election posters and fliers by Nomination Day when it will announce its slate of candidates .\n\nPeople’s Alliance for Reform (PAR)\n\nMr Lim Tean, the secretary-general of PAR – an alliance of three parties – said in a Facebook post that it welcomes the calling of the general election.\n\nThe alliance is looking to contest the single-seat wards of Potong Pasir, Mountbatten, Radin Mas, Queenstown and Yio Chu Kang, as well as Jalan Besar GRC and Tanjong Pagar GRC.\n\nIn a video, he said the PAR has been waiting and preparing for the election for a “very long time”.\n\nAdditional reporting by Lee Li Ying, Michelle Ng, Harith Mustaffa, Samuel Devaraj, Chin Soo Fang, and Gabrielle Chan\n\nJoin ST's WhatsApp Channel and get the latest news and must-reads."
            },
            {
                "title": "Outgoing B.C. Conservative MP Ed Fast endorses independent Mike de Jong",
                "description": "De Jong, who won eight terms in the B.C. legislature and held several cabinet posts, announced last month that he would be running as an Independent in Abbotsford-South Langley.",
                "published_date": "2025-04-15T19:19:15+00:00",
                "source": "Global News (Canada)",
                "source_country": "Canada",
                "news_type": "Politics",
                "countries_mentioned": [
                    "United Kingdom",
                    "Canada"
                ],
                "link": "https://globalnews.ca/news/11133127/ed-fast-conservative-endorse-mike-de-jong/",
                "content": "Send this page to someone via email\n\nLongtime Conservative member of Parliament Ed Fast, who is not seeking re-election, is endorsing Independent candidate Mike de Jong as his successor in the riding of Abbotsford—South Langley.\n\nFast says in a statement that “democracy lost out” when the Conservatives chose Sukhman Gill, a 25-year-old blueberry farmer and businessman, as their candidate instead of de Jong.\n\n3:43 IPSOS poll: Liberals lead narrows as Tories gain\n\nDe Jong — who won eight terms in the B.C. legislature and held cabinet posts, including finance and forestry — announced last month that he would be running as an Independent in the riding after the Conservative Party of Canada disqualified him as a candidate.\n\nStory continues below advertisement\n\nFast says in the statement that he asked Conservative Party officials to begin “an open and fair process” to choose a replacement for his riding of Abbotsford-South Langley.\n\nGet breaking National news For news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen. Sign up for breaking National newsletter Sign Up By providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy\n\nHe says his party “disqualified the most qualified candidate,” adding that de Jong supports such conservative policies as reducing taxes, getting tough on violent criminals and rebuilding the military.\n\n1:58 Politicians join thousands at Vancouver Vaisakhi parade\n\nFast says in light of the damage caused by U.S. President Donald Trump’s tariffs, his community needs a “tested and proven leader, not an inexperienced, unqualified Johnnie-come-lately.”\n\nFast says that while some may worry about splitting the vote, he’s not concerned.\n\n“I’m confident that Mike has the resources and large team behind him to ensure that we elect this highly experienced friend of our community,” Fast says in the statement.\n\nStory continues below advertisement\n\n“I respectfully ask you, the voters of Abbotsford-South Langley, to vote for our independent conservative candidate, Mike de Jong, to be our next member of Parliament.”"
            }
        ],
        "createdAt": "2025-04-15T19:02:42.243626+00:00",
        "updatedAt": "2025-04-16T06:18:52.329772+00:00",
        "articleCount": 2,
        "summary": "<p>The Straits Times reached out to eight opposition parties to get their reactions.</p>\n",
        "timeline": "- 2025-04-15T15:47:13+00:00: Opposition parties ramp up election preparations, ...\n- 2025-04-15T19:19:15+00:00: Outgoing B.C. Conservative MP Ed Fast endorses ind..."
    },
    {
        "name": "Phase Election: First",
        "event_id": "0",
        "severity": 0.56,
        "articles": [
            {
                "title": "PKR election: First phase completed, focus shifts to second phase - Zaliha",
                "description": "<img src=\"https://thesun.my/binrepository/400x267/0c0/400d225/none/11808/DXOC/lb01-11042025-borneo-flora_5130897_20250415222938.jpg\"><p><b>KUALA LUMPUR</b>: The first phase of the 2025 PKR election, involving the Angkatan Muda Keadilan (AMK) and Women’s Division levels, has been completed. </p><p></p><p>The party polls were held in seven states from last Friday to Sunday, said Party Election Committee (JPP) Chairperson Datuk Seri Dr Zaliha Mustafa.</p><p></p><p>The first phase, from April 11 to 13, included Kedah, Perlis, Selangor, Melaka, Perak, Negeri Sembilan, and Sarawak.</p><p></p><p>She said the JPP is preparing for the second phase of party polls involving Kelantan, Terengganu, the Federal Territories, Pahang, Penang, Johor, and Sabah from April 18 to 20.</p><p></p><p>“The JPP advises all voters for phase two to download the Adil application or update it to the latest version in preparation for the voting process,“ she said in a Facebook post via the Keadilan 2025 Election page today.</p><p></p><p>Dr Zaliha added that the committee is aware of objections related to the 2025 Keadilan Election voting results and stated that it will review every objection submitted.</p><p></p><p>“All decisions regarding the objections will be announced once the divisional level voting process has been completed,“ said Zaliha, Minister in the Prime Minister’s Department (Federal Territories).</p><p></p><p>The elections for the PKR Central Leadership Council (MPP), Central Women’s Leadership Council (MPWP), and Central AMK Leadership Council (MPAMKP) will take place on May 24.</p>",
                "published_date": "2025-04-15T14:28:00+00:00",
                "source": "The Sun (Malaysia)",
                "source_country": "Malaysia",
                "news_type": "Politics",
                "countries_mentioned": [
                    "Malaysia"
                ],
                "link": "https://thesun.my/malaysia-news/pkr-election-first-phase-completed-focus-shifts-to-second-phase-zaliha-DO13954241",
                "content": "KUALA LUMPUR: The first phase of the 2025 PKR election, involving the Angkatan Muda Keadilan (AMK) and Women’s Division levels, has been completed.\n\nThe party polls were held in seven states from last Friday to Sunday, said Party Election Committee (JPP) Chairperson Datuk Seri Dr Zaliha Mustafa.\n\nThe first phase, from April 11 to 13, included Kedah, Perlis, Selangor, Melaka, Perak, Negeri Sembilan, and Sarawak.\n\nShe said the JPP is preparing for the second phase of party polls involving Kelantan, Terengganu, the Federal Territories, Pahang, Penang, Johor, and Sabah from April 18 to 20.\n\n“The JPP advises all voters for phase two to download the Adil application or update it to the latest version in preparation for the voting process,“ she said in a Facebook post via the Keadilan 2025 Election page today.\n\nDr Zaliha added that the committee is aware of objections related to the 2025 Keadilan Election voting results and stated that it will review every objection submitted.\n\n“All decisions regarding the objections will be announced once the divisional level voting process has been completed,“ said Zaliha, Minister in the Prime Minister’s Department (Federal Territories).\n\nThe elections for the PKR Central Leadership Council (MPP), Central Women’s Leadership Council (MPWP), and Central AMK Leadership Council (MPAMKP) will take place on May 24."
            }
        ],
        "createdAt": "2025-04-15T19:22:11.364277+00:00",
        "updatedAt": "2025-04-15T19:22:11.364277+00:00",
        "articleCount": 1,
        "summary": "<img src=\"https://thesun.my/binrepository/400x267/0c0/400d225/none/11808/DXOC/lb01-11042025-borneo-flora_5130897_20250415222938.jpg\"><p><b>KUALA LUMPUR</b>: The first phase of the 2025 PKR election, involving the Angkatan Muda Keadilan (AMK) and Women’s Division levels, has been completed. </p><p></p><p>The party polls were held in seven states from last Friday to Sunday, said Party Election Committee (JPP) Chairperson Datuk Seri Dr Zaliha Mustafa.</p><p></p><p>The first phase, from April 11 to 13, included Kedah, Perlis, Selangor, Melaka, Perak, Negeri Sembilan, and Sarawak.</p><p></p><p>She said the JPP is preparing for the second phase of party polls involving Kelantan, Terengganu, the Federal Territories, Pahang, Penang, Johor, and Sabah from April 18 to 20.</p><p></p><p>“The JPP advises all voters for phase two to download the Adil application or update it to the latest version in preparation for the voting process,“ she said in a Facebook post via the Keadilan 2025 Election page today.</p><p></p><p>Dr Zaliha added that the committee is aware of objections related to the 2025 Keadilan Election voting results and stated that it will review every objection submitted.</p><p></p><p>“All decisions regarding the objections will be announced once the divisional level voting process has been completed,“ said Zaliha, Minister in the Prime Minister’s Department (Federal Territories).</p><p></p><p>The elections for the PKR Central Leadership Council (MPP), Central Women’s Leadership Council (MPWP), and Central AMK Leadership Council (MPAMKP) will take place on May 24.</p>",
        "timeline": "- 2025-04-15T14:28:00+00:00: PKR election: First phase completed, focus shifts ..."
    },
    {
        "name": "Manitoba Holds ‘Foundation-Setting’",
        "event_id": "10",
        "severity": 0.55,
        "articles": [
            {
                "title": "Manitoba holds ‘foundation-setting’ trade meeting with European Union ambassadors",
                "description": "Wab Kinew met with ambassador Geneviève Tuts and 18 heads of mission of European member states at the Manitoba legislature, where he discussed increasing trade.",
                "published_date": "2025-04-15T18:28:54+00:00",
                "source": "Global News (Canada)",
                "source_country": "Canada",
                "news_type": "Economics",
                "countries_mentioned": [
                    "Canada"
                ],
                "link": "https://globalnews.ca/news/11132925/manitoba-european-union-trade-kinew/",
                "content": "Send this page to someone via email\n\nManitoba’s provincial government was focused on international trade Tuesday morning, as Premier Wab Kinew met with representatives from the European Union.\n\nKinew met with ambassador Geneviève Tuts and 18 heads of mission of European member states at the Manitoba legislature, where he discussed increasing trade.\n\nIt was all part of meeting the premier called an opportunity to show European nations that Manitoba is open for business, as the trade war between Canada and the United States continues.\n\n“We had that opening meeting today, the foundation-setting meeting today,” Kinew said.\n\n“The next step is to follow up with these ambassadors and bring forward a tangible business opportunity so that the job creators here in Manitoba can step up.”\n\nThe meeting comes a day after the province asked Manitoba Hydro to redirect U.S. electricity exports to homegrown Canadian projects, as its contracts with Minnesota are set to expire.\n\nStory continues below advertisement\n\nKinew said the creation of a second port on Hudson Bay — away from the town of Churchill — could be one way to increase trade with Europe.\n\nGet daily National news Get the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day. Sign up for daily National newsletter Sign Up By providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy\n\nThe provincial and federal governments have already made investments into the Port of Churchill, which runs seasonally due to ice conditions.\n\n“I would say post-Trump, we’re open to that and to all options,” the premier said.\n\n“Balancing consideration between growing our economy by accessing tidewater in Manitoba, while protecting our environment — belugas, polar bears — is super important to get right.”\n\nFormer Canadian diplomat Colin Robertson told 680 CJOB’s The News that during this tour by the EU representatives, it’s important for Manitoba to outline what it’s looking for in a potential trading partner.\n\n“This is a first step — for many of them it’s their first visit to Manitoba, which often gets overlooked when European ambassadors cross the country,” Robertson said.\n\n“They’ll go to Toronto of course, they’ll go to Montreal, or they often have consulates — they’ll go to Calgary and Vancouver, but they don’t always come to Manitoba.”\n\nRobertson said Europeans are seeking more opportunities, and Manitoba needs to lay out the costs and the specifics of what this province can provide.\n\nStory continues below advertisement\n\n“Here’s what it’s going to cost, and here’s the opportunity for you — they’ll take that back to their countries as well as to the European Union, and that’s what you want.”\n\nIn addition to meeting with the premier and cabinet, the two-day visit to Manitoba will also include meetings with the Business Council of Manitoba and the Indigenous Chamber of Commerce, as well as tours of the Canadian NORAD headquarters and CentrePoint Canada.\n\nRepresentatives of Austria, Belgium, Croatia, Cyprus, Estonia, Finland, Germany, Greece, Hungary, Lithuania, Luxembourg, Malta, the Netherlands, Portugal, Slovakia, Slovenia, Spain and Sweden made the trip."
            }
        ],
        "createdAt": "2025-04-15T19:02:43.747980+00:00",
        "updatedAt": "2025-04-15T19:02:43.747980+00:00",
        "articleCount": 1,
        "summary": "Wab Kinew met with ambassador Geneviève Tuts and 18 heads of mission of European member states at the Manitoba legislature, where he discussed increasing trade.",
        "timeline": "- 2025-04-15T18:28:54+00:00: Manitoba holds ‘foundation-setting’ trade meeting ..."
    },
    {
        "name": "Lessons Admin Service",
        "event_id": "13",
        "severity": 0.55,
        "articles": [
            {
                "title": "Six lessons for admin service officers from DPM Heng",
                "description": "<p>He noted the complementary roles of the public service and political leadership, among other things.</p>\n",
                "published_date": "2025-04-15T15:54:18+00:00",
                "source": "The Straits Times",
                "source_country": "Singapore",
                "news_type": "Politics",
                "countries_mentioned": [
                    "Singapore"
                ],
                "link": "https://www.straitstimes.com/singapore/six-lessons-for-admin-service-officers-from-dpm-heng",
                "content": "The complementary roles of the public service and political leadership, coupled with a sense of common purpose, is what takes Singapore forward, said DPM Heng Swee Keat. PHOTO: LIANHE ZAOBAO\n\nSINGAPORE - With political contestation here becoming more intense, some political parties have taken to claiming that Singaporeans need not fear a change of government, given the country’s first-class public service.\n\nSuch rhetoric is alarming, given that the political leadership and the public service pursue a common purpose but play different roles, said Deputy Prime Minister Heng Swee Keat.\n\nSpeaking at the annual Administrative Service dinner on April 15, DPM Heng said he is convinced that no minister could make effective policies for the long-term interest of Singapore if he focused only on political engagements, and left policy design to the public service.\n\n“If the political leaders I had served in my Admin Service days had done that, and had no policy instincts on what makes Singapore tick, I would have left the public service long ago and so would many of my fellow permanent secretaries,” he told the 320 guests at the dinner at the Sands Expo and Convention Centre.\n\n“We stayed in service because the political leaders we worked with share the same mission of creating a better future for Singapore, for Singaporeans, and with clear strategic minds.”\n\nRecounting his own experience as permanent secretary under then Minister for Trade and Industry George Yeo, DPM Heng said it was Mr Yeo who set the strategic direction of pursuing free trade agreements (FTAs) and to persuade fellow ministers in other countries on the value of FTAs, while he supervised the details of Singapore’s negotiations.\n\nWhen he later became a political leader, the permanent secretaries who reported to him – including at the Ministry of Education and the National Research Foundation – were not afraid to have open and rigorous policy debates.\n\n“Till today, I am very heartened that our educators and Admin Service officers would tell me honestly if my idea was flawed,” he said. “They had the courage to speak truth to power.”\n\nThe complementary roles of the public service and political leadership, coupled with a sense of common purpose, is what takes Singapore forward, said DPM Heng.\n\nBesides the importance of trust between the public service and the political leadership, DPM Heng shared five other lessons for Administrative Service officers at the dinner.\n\nRespect and develop the front line\n\nDPM Heng recounted an incident from the earliest days of his career, when, as a police patrol officer, he had to direct traffic at a busy junction as the traffic light had broken down.\n\nDespite holding the rank of assistant superintendent and being able to write essays about the global economy, he was “completely incompetent” at directing traffic, and it was his teammate, a police constable, who managed to restore order.\n\n“It was a humbling experience, but I learnt an important lesson: Serving our citizens starts with the front-line officer,” he said. “The front-line officer is the contact point, the interface, between our policies and programmes and their impact on citizens.”\n\nWhile administrative officers do complex modelling and analysis as they design policies, DPM Heng urged them to understand how policies are perceived by and transmitted to citizens.\n\n“The front-line officer, the interface between policy intent and outcome, is where the rubber hits the road, where execution happens,” he said. “Execution is policy. So do your best, respect and develop the front line, and spend some time at the front line.”\n\nHave the courage to experiment\n\nAmong a leader’s most critical tasks is to set strategic direction, and to be willing to change direction when the situation demands it, said DPM Heng.\n\nHe cited examples of how past police commissioners such as Mr Goh Yong Hong and Mr Tee Tua Ba understood how the challenges of policing had evolved through the decades, and were willing to make paradigm shifts in their approaches.\n\nFor instance, Mr Goh observed that secret societies in the 1980s were more street gangs of listless youth, and not the hardened, organised triads of old. To help them expend their youthful energy, he started the Police Boys Club and held rock concerts in the middle of Orchard Road.\n\nDespite initial resistance to the idea from some senior police officers, the concerts went well and the police built new relationships with young people, said DPM Heng.\n\n“A lesson for all officers is that we should not be slaves to our past. Use the experiences of the past. When the situation changes, be prepared to be bold, to have the courage to experiment, to innovate, and to make a paradigm shift.”\n\nTurn constraints into opportunity\n\nThe Singapore story is one of turning constraints into opportunity, said DPM Heng.\n\nFor instance, its small domestic market forced the country to always look outwards. By welcoming the world’s best multinational enterprises, Singapore leapfrogged the region and became a First World country, he said.\n\n“By not adopting a narrow approach of protecting our local companies, it forced our companies to compete, to upgrade,” he added.\n\nHe noted that Singapore has not been spared the tariffs imposed by the US on its trading partners, but the Republic must build on its 27 bilateral and regional free trade agreements to emerge stronger from this turbulence.\n\nDPM Heng said that as countries and companies significantly reconfigure the global supply chain to consider not just efficiency but also reliability, Singapore, as a major trade hub and logistics centre, can play a trusted role in this process.\n\n“In this age of trade and tech war, let us position Singapore to be a global-Asia node of technology, innovation and enterprise – trusted, relevant and useful to the world,” he said.\n\nThink long term, embrace contradictions\n\nAs finance minister during the Covid-19 pandemic, DPM Heng went to then President Halimah Yacob five times in 2020 to brief her on each of that year’s five government Budgets, and to seek her approval to use past reserves.\n\nIn the end, the Government used some $40 billion of past reserves to protect Singaporean lives and livelihoods.\n\n“While all finance ministers around the world supported their economies and peoples during the pandemic, I am probably the only one who allocated such a big sum without having to borrow a cent,” he said.\n\nToday’s Singaporeans have benefited from the legacy of long-term stewardship by its founding leaders, and current and future generations and leaders should likewise treasure and preserve this legacy, he added.\n\nDPM Heng also urged officers to embrace apparent contradictions in their policymaking. For instance, the Monetary Authority of Singapore has a dual mandate to develop the financial sector here while keeping it safe and stable.\n\nThis appears to be contradictory, but forces the authority to weigh the risks and returns of what it does, DPM Heng said.\n\n“Singapore must create our distinctive competitive advantage, and this ambidexterity in our regulatory agencies can be a source of strength, especially in sectors where trust and confidence is critical,” he added.\n\nEngage Singaporeans in decision-making\n\nSingaporeans today are better educated, better informed, and more keen to take part in decision-making, and this is a strength for the country, he said.\n\nThe public service must harness this creativity and energy and encourage active participation in nation-building, or risk a divided or apathetic society, said DPM Heng.\n\nHe noted that Prime Minister Lawrence Wong had launched the Forward Singapore movement to hear the views of citizens, and to co-create solutions to strengthen Singapore’s social compact.\n\nHe encouraged Administrative Service officers to widen their engagement not just within their ministries, but also to the whole of society.\n\nRetirement of five permanent secretaries\n\nAt the dinner, Head of Civil Service Leo Yip paid tribute to five permanent secretaries who have retired or are retiring.\n\nThey are Permanent Secretary for Policy at the Ministry of Trade and Industry Gabriel Lim, who retired in September 2024; Permanent Secretary for Health Chan Yeng Kit, who retired in January; Permanent Secretary for National Development Ow Foong Pheng and Second Permanent Secretary for Trade and Industry and Manpower Jeffrey Siow, who both retired earlier in April; and Permanent Secretary for Finance Tan Ching Yee, who will be retiring in May.\n\nMr Yip said the public service is undergoing its own leadership renewal in tandem with political leadership renewal, with several permanent secretaries, deputy secretaries, chief executives and other senior public service leaders retiring in recent years.\n\nWith the world changing drastically, he said, the public service has to always be prepared for new shocks and disruptions, and at a higher cadence than before.\n\n“We do so by strengthening our resilience, as a system, so that we can organise ourselves quickly, respond nimbly, and recover strongly from any shock,” said Mr Yip.\n\n“And we sustain and strengthen our system of governance by effecting leadership renewal, enabling each successive generation of leaders to succeed and keep Singapore thriving.”\n\nJoin ST's WhatsApp Channel and get the latest news and must-reads."
            }
        ],
        "createdAt": "2025-04-15T19:02:42.103957+00:00",
        "updatedAt": "2025-04-15T19:02:42.103957+00:00",
        "articleCount": 1,
        "summary": "<p>He noted the complementary roles of the public service and political leadership, among other things.</p>\n",
        "timeline": "- 2025-04-15T15:54:18+00:00: Six lessons for admin service officers from DPM He..."
    },
    {
        "name": "Avoid Travel Possible,",
        "event_id": "7",
        "severity": 0.54,
        "articles": [
            {
                "title": "Avoid U.S. travel if possible, Canadian academics are being urged",
                "description": "Canadian university and college professors, as well as other staff at these institutions, are being encouraged to avoid all non-essential travel to the U.S.",
                "published_date": "2025-04-15T18:25:32+00:00",
                "source": "Global News (Canada)",
                "source_country": "Canada",
                "news_type": "Politics",
                "countries_mentioned": [
                    "Canada"
                ],
                "link": "https://globalnews.ca/news/11132827/us-travel-warning-canadian-academics/",
                "content": "Send this page to someone via email\n\nAn advocacy group representing Canada’s university and college professors is strongly urging academic staff to avoid non-essential travel to the U.S. amid an “evolving political landscape.”\n\nThe Canadian Association of University Teachers (CAUT), a group of independent associations and trade unions that represent 72,000 teachers, researchers and other staff at 120 universities and colleges, issued its updated travel advice on Tuesday.\n\n“CAUT strongly recommends that academic staff travel to the U.S. only if essential and necessary,” the warning reads.\n\nThe organization said that academics who fall into certain categories should “exercise particular caution.”\n\nThose categories include citizens or residents of a country identified as likely to be subject to a travel ban, those from a country that has diplomatic tensions with the U.S., people who expressed negative opinions about the Trump administration or its policies, and those whose research could be seen as “at odds” with the current U.S. government.\n\nStory continues below advertisement\n\nThe warning also applies to travellers with passport stamps related to recent travel to countries that may be subject to a travel ban or have diplomatic tensions, and teachers or staff who identify as transgender or whose travel documents indicate a sex other than their sex at birth.\n\n2:15 Washington State border towns beg Canadians to come back\n\nIf teachers and other staff need to travel, the association also urges them to “carefully consider” what information they have or need to have on their electronic devices when crossing borders and to take action to protect sensitive information where necessary.\n\nGet daily National news Get the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day. Sign up for daily National newsletter Sign Up By providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy\n\n“Travellers leaving or returning to Canada, particularly those travelling to the U.S., are increasingly vulnerable to preclearance zones and border searches that may compromise research confidentiality and academic freedom. CAUT will continue to provide updates as developments occur,” a supplemental notice in the advisory said.\n\n“In the interim, the CAUT strongly recommends that members considering travel to the U.S. review options for remote attendance and travel only if necessary.”\n\nStory continues below advertisement\n\nIt goes on to note: “Issues with respect to travel to the U.S. extend beyond inspection and search of electronic devices, given Presidential Executive Orders and the apparent application of a heightened ethnic and religious screening process by CBP officers.”\n\nLast month, a French scientist was denied entry into the U.S., allegedly for expressing a personal opinion on the Trump administration’s research policy, the French education ministry said at the time.\n\nA spokesperson for U.S. Customs and Border Protection said privacy restrictions barred the agency from discussing specific cases, adding that all people arriving in the country are subject to inspection on a case-by-case basis.\n\nThat warning comes nearly two weeks after the federal government updated its travel advisory for the U.S., saying Canadians should “expect scrutiny” when crossing ports of entry and the search of their electronic devices.\n\nThe government also warned that Canadians who are denied entry could be detained while awaiting deportation back to Canada."
            }
        ],
        "createdAt": "2025-04-15T19:02:43.923138+00:00",
        "updatedAt": "2025-04-15T19:02:43.923138+00:00",
        "articleCount": 1,
        "summary": "Canadian university and college professors, as well as other staff at these institutions, are being encouraged to avoid all non-essential travel to the U.S.",
        "timeline": "- 2025-04-15T18:25:32+00:00: Avoid U.S. travel if possible, Canadian academics ..."
    },
    {
        "name": "Daily Debrief: Happened",
        "event_id": "8",
        "severity": 0.54,
        "articles": [
            {
                "title": "Daily Debrief: What Happened Today (Apr 15)",
                "description": "Stories you might have missed",
                "published_date": "2025-04-15T10:30:00+00:00",
                "source": "Business Times",
                "source_country": "Singapore",
                "news_type": "Politics",
                "countries_mentioned": [
                    "United Kingdom",
                    "Singapore"
                ],
                "link": "https://www.businesstimes.com.sg/singapore/daily-debrief-what-happened-today-apr-151",
                "content": "Stories you might have missed\n\nGE2025: Singapore set to go to the polls on May 3, after Nomination Day on Apr 23\n\nSINGAPORE is set to go to the polls on May 3 in a closely watched general election that marks Prime Minister Lawrence Wong’s first electoral outing since taking the helm last year.\n\nNew private home sales creep up in March; record number of ECs sold for S$2 million or more\n\nDevelopers in Singapore sold 729 private homes in March, inching up 1.5 per cent from the 718 units moved a year earlier, data released by the Urban Redevelopment Authority showed on Tuesday (Apr 15).\n\nAutomotive group Vin’s Holdings debuts higher in SGX’s first listing of 2025\n\nBT in your inbox Start and end each day with the latest news stories and analyses delivered straight to your inbox. Sign Up Sign Up\n\nAutomotive group Vin’s Holdings climbed on its listing debut on Tuesday, in the first initial public offering on the Singapore Exchange this year.\n\nCourt hears of more luxury-car purchases by alleged nickel fraudster\n\nAlleged nickel fraudster Ng Yu Zhi bought a vintage Mercedes Benz for his girlfriend Qian Yijun for S$288,000 – half a year after he bought her another Mercedes Benz for S$550,000.\n\nFrasers Property sees several senior management changes amid broader industry challenges in the UK: source\n\nSeveral of Frasers Property’s senior management team will be leaving the company, including group chief operating officer Anthony Boyd and group chief digital officer Samuel Tan.\n\nSingapore shares and STI continue to rally on Tuesday, tracking regional indices\n\nThe Straits Times Index continued to rally, closing up 2.1 per cent or 75.81 points at 3,624.7 on Tuesday."
            }
        ],
        "createdAt": "2025-04-15T19:02:43.420724+00:00",
        "updatedAt": "2025-04-15T19:02:43.420724+00:00",
        "articleCount": 1,
        "summary": "Stories you might have missed",
        "timeline": "- 2025-04-15T10:30:00+00:00: Daily Debrief: What Happened Today (Apr 15)"
    },
    {
        "name": "Ge2025: Expect Nomination",
        "event_id": "9",
        "severity": 0.53,
        "articles": [
            {
                "title": "GE2025: What to expect on Nomination Day on Apr 23",
                "description": "PM Wong and the Marsiling-Yew Tee GRC team will file their papers at Jurong Pioneer Junior College; Yusof Ishak Secondary School will...",
                "published_date": "2025-04-15T12:01:01+00:00",
                "source": "Business Times",
                "source_country": "Singapore",
                "news_type": "Politics",
                "countries_mentioned": [
                    "Singapore"
                ],
                "link": "https://www.businesstimes.com.sg/singapore/ge2025-what-expect-nomination-day-apr-23",
                "content": "[SINGAPORE] Prospective candidates will head to nine nomination centres on Apr 23 to file their papers to stand in the upcoming general election.\n\nThis is the next step in the run-up to Polling Day on May 3, after Parliament was dissolved and the Writ of Election issued by President Tharman Shanmugaratnam on Tuesday (Apr 15).\n\nThere will be 33 electoral divisions in GE 2025: 18 Group Representation Constituencies (GRCs) and 15 Single-Member Constituencies, one more of each than in 2020. There will be 97 elected seats, up from 93 in 2020.\n\nTo stand for election, prospective candidates must submit their nomination papers at the nomination centre for the constituency they are contesting in, and do this by noon. Each candidate also has to pay an election deposit of S$13,500 by that cut-off time.\n\nEach candidate or group of candidates must be accompanied by a proposer, a seconder and at least four assentors, whose names appear in the Register of Electors for the electoral division where they wish to run.\n\nNomination proceedings end at 12.30 pm, after which the nine-day campaigning period begins.\n\nBT in your inbox Start and end each day with the latest news stories and analyses delivered straight to your inbox. Sign Up Sign Up\n\nThe returning officer for GE2025 is the director-general of the Civil Aviation Authority of Singapore, Han Kok Juan.\n\nHot seats\n\nThis will be Prime Minister Lawrence Wong’s first electoral outing since taking the helm last year. He will contest Marsiling-Yew Tee GRC, for which he is one of the incumbent Members of Parliament (MPs).\n\nHe and his teammates Hany Soh, Zaqy Mohamad and Alex Yam will submit their papers at Jurong Pioneer Junior College.\n\nThey are expected to face a team from the Singapore Democratic Party, comprising the party’s organising secretary Jufri Salim, founder of alternative news site Wake Up Singapore Ariffin Sha, theatre director Alec Tok, and former Progress Singapore Party (PSP) candidate Gigene Wong.\n\nMeanwhile, Yusof Ishak Secondary School will be where the candidates for three hot GRCs – East Coast, Sengkang and Punggol – will gather.\n\nThe Workers’ Party (WP) is expected to face the incumbent People’s Action Party (PAP) in these three constituencies; Punggol GRC was newly formed from the split-up of Pasir Ris-Punggol GRC. Candidates for Pasir Ris-Changi GRC will also submit their papers at Yusof Ishak Secondary School.\n\nAnother anticipated contest will be in the newly formed Marine Parade-Braddell Heights GRC, where the WP will face the incumbent PAP. The teams will submit their papers at Kong Hwa School.\n\nThe PAP team includes Manpower Minister Tan See Leng and Minister of State for Home Affairs and for National Development Muhammad Faishal Ibrahim. The remaining three candidates for this slate are to be confirmed.\n\nSenior Counsel Harpreet Singh, one of WP’s new candidates, has been spotted in the constituency and could be fielded there.\n\nCandidates for West Coast-Jurong West GRC will turn up at Nan Hua High School. The new GRC was formed from West Coast GRC, which the PAP won by the slimmest margin in 2020.\n\nThere, the PSP is expected to reprise its showdown with the PAP. The sitting team comprises National Development Minister Desmond Lee, Ang Wei Neng and Shawn Huang; they are expected to be fielded with new faces orthopaedic surgeon Hamid Razak and lawyer Cassandra Lee. The PSP has not confirmed its slate for the GRC."
            }
        ],
        "createdAt": "2025-04-15T19:02:43.104320+00:00",
        "updatedAt": "2025-04-15T19:02:43.104320+00:00",
        "articleCount": 1,
        "summary": "PM Wong and the Marsiling-Yew Tee GRC team will file their papers at Jurong Pioneer Junior College; Yusof Ishak Secondary School will...",
        "timeline": "- 2025-04-15T12:01:01+00:00: GE2025: What to expect on Nomination Day on Apr 23"
    },
    {
        "name": "Trump Tariffs, Asean",
        "event_id": "17",
        "severity": 0.53,
        "articles": [
            {
                "title": "In wake of Trump tariffs, Asean exporters should diversify away from US reliance: panellists",
                "description": "For Singapore, the broader risk is from the politicised and unpredictable nature of the trade actions",
                "published_date": "2025-04-15T14:02:07+00:00",
                "source": "Business Times",
                "source_country": "Singapore",
                "news_type": "Economics",
                "countries_mentioned": [
                    "Australia",
                    "Singapore"
                ],
                "link": "https://www.businesstimes.com.sg/singapore/wake-trump-tariffs-asean-exporters-should-diversify-away-us-reliance-panellists",
                "content": "[SINGAPORE] Beyond the immediate impact of US tariffs, both Singapore and the wider region must start preparing for deeper shifts in the global trade landscape, said panellists in two recent online seminars.\n\nWhile US firms are keeping their supply chains in Asean, regional economies should diversify their export markets to reduce their reliance on the US, said speakers at a webinar organised by the European Chamber of Commerce (EuroCham) on Tuesday (Apr 15).\n\nAnd while Singapore may not be targeted by higher tariffs, the real risk for the trade-reliant city-state is how politicised and inconsistent US trade actions are reshaping the global environment, said participants in a webinar by the Iseas-Yusof Ishak Institute the day before.\n\nDiversifying export markets\n\nThe EuroCham session discussed the impact of US President Donald Trump’s so-called “reciprocal tariffs” on the Asia-Pacific region.\n\nParisha Saimbi, a foreign exchange and local markets strategist for Asia at BNP Paribas, shared findings from a survey conducted before Trump’s Apr 9 announcement of a 90-day tariff delay.\n\nThe poll asked global corporations how they intended to respond to the tariffs.\n\nA NEWSLETTER FOR YOU Friday, 8.30 am Asean Business Business insights centering on South-east Asia's fast-growing economies. Sign Up Sign Up\n\nThe most common response, chosen by about six in 10, was to raise prices and pass the additional costs on to US consumers. The next most common response was to seek export markets beyond the US.\n\nAmong US companies surveyed, most indicated no intention to reshore manufacturing or alter existing supply chains.\n\n“What this tells us is that the US is still likely to maintain the current status quo – continuing to buy from the Asean region and China to the extent that it can,” said Parisha.\n\nBoth she and fellow panellist Richard Burn, a senior counsellor for global advisory firm APCO, agreed that in the medium term, regional exporters should look to diversify.\n\nShe advised Asean-based businesses to seek non-US export markets, warning of a potentially longer-term shift in global trade policy.\n\nAsean countries should see this as a strategic opportunity to leverage the region’s consumer base – which accounts for 40 per cent of global growth – to reduce their exposure to the US market, she added.\n\nBurn noted that China has been diversifying its export markets beyond the US – including to Asean – and this effort is “now intensifying”.\n\nLoss of goodwill\n\nAt Monday’s Iseas webinar, participants noted that while Singapore faces only the baseline 10 per cent tariff, the greater concern is how politicised and unpredictable trade actions are reshaping the global system.\n\nVisiting senior fellow Jayant Menon said that Singapore “has recognised the need to take a strong position” because “this may not be the end of the onslaught” from Washington.\n\n“Everything you hear now might change in an hour or a day,” he said.\n\nDr Deborah Elms, head of trade policy at the Hinrich Foundation in Singapore, noted how tariffs on electronics were unexpectedly lifted on Friday, only to be reinstated by Sunday under a new semiconductor category.\n\nSuch instability dents business confidence, said Dr Luna Ge Lai, a research fellow at the Institute for International Affairs at the Chinese University of Hong Kong.\n\nShe noted that the tariffs have prompted many multinational corporations to hold back on decisions.\n\nProfessor Hal Hill, emeritus professor of economics at the Australian National University, criticised the Trump administration’s zero-sum approach to trade, saying: “We’re doing deals a la real estate, not what’s in the best interests of the global economy.”"
            }
        ],
        "createdAt": "2025-04-15T19:02:42.941244+00:00",
        "updatedAt": "2025-04-15T19:02:42.941244+00:00",
        "articleCount": 1,
        "summary": "For Singapore, the broader risk is from the politicised and unpredictable nature of the trade actions",
        "timeline": "- 2025-04-15T14:02:07+00:00: In wake of Trump tariffs, Asean exporters should d..."
    },
    {
        "name": "Candidates’ Election Deposit",
        "event_id": "16",
        "severity": 0.53,
        "articles": [
            {
                "title": "Candidates’ election deposit remains at $13,500 for GE2025: ELD ",
                "description": "<p>This will be forfeited if candidates are not elected and do not secure more than 12.5% of the votes polled.</p>\n",
                "published_date": "2025-04-15T14:48:19+00:00",
                "source": "The Straits Times",
                "source_country": "Singapore",
                "news_type": "Politics",
                "countries_mentioned": [
                    "United Kingdom",
                    "India",
                    "Singapore"
                ],
                "link": "https://www.straitstimes.com/singapore/politics/candidates-election-deposit-of-13500-remains-for-ge2025-eld",
                "content": "Candidates’ election deposits will be forfeited if they are not elected and do not secure more than 12.5 per cent of the votes polled. ST PHOTO: KUA CHEE SIONG\n\nSINGAPORE - Candidates contesting this year’s general election will need to pay $13,500 each – the same as in the 2020 election.\n\nThis and other details were revealed on April 15 by the Elections Department (ELD) shortly after President Tharman Shanmugaratnam dissolved Parliament and issued the Writ of Election.\n\nPolling Day will be on May 3, a Saturday, if more than one candidate or group of candidates are nominated for an electoral division on Nomination Day. Nomination Day will be on Wednesday, April 23.\n\nCandidates’ election deposits will be forfeited if they are not elected and do not secure more than 12.5 per cent of the votes polled.\n\nThe deposit is set as the fixed monthly allowance payable to an elected MP for the month immediately before the date of dissolution of Parliament, rounded to the nearest $500. The current fixed monthly allowance is $13,750.\n\nCandidates are encouraged to pay their deposits early, and not wait until Nomination Day to do so. Other than using a cheque, electronic payment methods, such as PayNow and bank transfer, are also available.\n\nCandidates are also encouraged to use the digital services at the ELD website to prepare their nomination papers. This helps them check that their proposer, seconder and assenters are from the GRC or SMC the candidates are contesting.\n\nCompleted papers should be printed and signed, and the nomination papers must be delivered in person to the respective nomination centres between 11am and noon on Nomination Day.\n\nThe candidate, or group of candidates, must be accompanied by a proposer, a seconder and at least four assenters when delivering the nomination papers.\n\nEach candidate must also apply for a political donation certificate from the Registrar of Political Donations by April 19. This may also be done online.\n\nCandidates must adhere to election expenses limits stipulated in the Parliamentary Elections Act, which is currently $5 for every elector in their electoral division.\n\nIf a candidate is contesting a group representation constituency , the limit is $5 per elector for that GRC, divided by the number of candidates in the group.\n\nUnder the Foreign Interference (Countermeasures) Act, only Singapore citizens aged 21 and above or Singapore entities are allowed to make political donations, which include gifts, loans and voluntary labour.\n\nFor groups of candidates seeking election in a GRC , a relevant certificate from either the Malay Community Committee or the Indian and Other Minority Communities Committee is required. These applications will close on April 19.\n\nThe chairman of the Malay Community Committee is Mr Mohamed Sa’at Abdul Rahman. The other members are Dr Hadijah Rahmat, Dr Mohamed Ali, Madam Rahayu Mohamad and Mr Zulkifli Baharudin.\n\nThe chairman of the Indian and Other Minority Communities Committee is Associate Professor Narayanan Ganapathy. The other members are Mr Khiatani Manohar Ramesh, Mr Ravinder Singh, Mr Vincent Schoon and Dr Zahabar Ali.\n\nThere will be 18 GRCs and 15 single-member constituencies up for contest, up from the current 17 GRCs and 14 SMCs. The number of elected MPs will increase from the current 93 to 97.\n\nMay 3 will be a public holiday. Every employer should allow their voters a reasonable period of time to vote, said ELD.\n\nThe Ministry of Manpower, in a separate statement, reminded companies that Polling Day should be treated the same as any other public holiday. Employees are entitled to either a day off or salary in lieu, if Polling Day is a non-working day for them, added the ministry.\n\nThe Returning Officer is Mr Han Kok Juan, director-general of the Civil Aviation Authority of Singapore, who will oversee the smooth conduct of the election. He took over the role from Housing Board chief executive Tan Meng Dui on April 1.\n\nThe election, Singapore’s 14th since independence, is likely to again see the PAP challenged for all seats – as was the case in 2020.\n\nJoin ST's WhatsApp Channel and get the latest news and must-reads."
            }
        ],
        "createdAt": "2025-04-15T19:02:42.749987+00:00",
        "updatedAt": "2025-04-15T19:02:42.749987+00:00",
        "articleCount": 1,
        "summary": "<p>This will be forfeited if candidates are not elected and do not secure more than 12.5% of the votes polled.</p>\n",
        "timeline": "- 2025-04-15T14:48:19+00:00: Candidates’ election deposit remains at $13,500 fo..."
    },
    {
        "name": "Three Canada-U.S. Dispute",
        "event_id": "0",
        "severity": 0.5,
        "articles": [
            {
                "title": "Three ways this Canada-U.S. dispute will end",
                "description": "<img src='https://i.cbc.ca/1.7510259.1744678716!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/trump-tariffs.jpg' alt='A visitor to Washington wears a Donald Trump mask outside the White House, posing in front of a Canadian flag held by tourists last month. ' width='620' height='349' title='A visitor to Washington wears a Donald Trump mask outside the White House, posing in front of a Canadian flag held by tourists last month. '/><p></p>",
                "published_date": "2025-04-15T04:01:00+00:00",
                "source": "CBC News",
                "source_country": "Canada",
                "news_type": "Politics",
                "countries_mentioned": [
                    "United Kingdom",
                    "Canada"
                ],
                "link": "https://www.cbc.ca/news/world/canada-u-s-paths-forward-three-ways-1.7510233?cmp=rss",
                "content": "You'd have to squint till your eyeballs ache, but there is a foreseeable scenario where Canada and the U.S. build a closer relationship out of this ugly moment.\n\nThis outcome is far from certain — hence the squinting.\n\nBut one influential figure in Washington professes to see it. Donald Trump's first-term trade czar predicted the optimistic scenario last week in Ottawa, speaking behind closed doors.\n\n\"Whatever is going on now is not going to last, and it'll be fine,\" Robert Lighthizer told the Canada Strong and Free Network, a conservative think-tank, on a recording shared with CBC News.\n\n\"The relationship between the United States and Canada is going to be as good or better than it has ever been and the business relationship will be fine.\"\n\nThere are three broad potential scenarios after this month's federal election, after which Canada and the U.S. are poised to enter comprehensive trade and security negotiations .\n\nCall them the good place, the bad place and the messy middle.\n\nWATCH | Uncertainty over tariffs: Confusion reigns over Trump’s tariff plans Duration 2:29 U.S. President Donald Trump’s plan for tariffs and exemptions didn’t get any clearer over the weekend with officials saying electronics from China will face tariffs in the coming months because of ‘national security.’\n\nThe good place? Economic security, military security — Canada gets both, with tariff-free trade restored and the U.S. defence umbrella intact. Canada could even gain new advantages, if the U.S. keeps its tariffs against other countries.\n\nLighthizer hinted at this. He suggested Canada has gained a competitive edge amid the recent trade war as its tariffs are, generally, lower than those on most countries.\n\nMost products traded under the Canada-U.S.-Mexico Agreement (CUSMA) have tariff exemptions, and Canada and Mexico did not get the same 10 per cent universal tariff as other countries.\n\n\"My own analysis is that Canada is better off because [CUSMA] is more valuable than it was six weeks ago,\" Lighthizer said.\n\nHe added a caveat. There are still tariffs on Canadian steel and aluminum.\n\nHe didn't mention tariffs on another massive industry, the auto sector, which is now caught in a tangle of exemptions and duties — a Swiss cheese of trade barriers.\n\nWhich brings us to the messy middle.\n\nBleak and bleaker scenarios\n\nIt's the in-between scenario and it looks, frankly, like our present purgatory: a relationship corroded by doubt, eaten away by a tariff here and another one there.\n\n\"I think [CUSMA] is on life support right now. And I think it will be like that for the next year — at least,\" Mexican economist Jesús Carrillo told a panel on Monday organized by the Brookings Institution, a Washington-based think-tank.\n\nHe predicted the trade pact will survive. Then again, in this messy, uncertain moment, where tariffs shift from day to day, who knows what tomorrow's trade reality will be? Let alone next year's.\n\nJust look at recent appearances by Lighthizer's successor, the current U.S. Trade Representative Jamieson Greer.\n\nIn two days of hearings on Capitol Hill last week, he, too, referred to Canada and Mexico enjoying privileged access to the U.S. market, under CUSMA.\n\nWATCH | Car parts could be spared, Trump says: Trump says Canadian car parts among list of possible products spared from U.S. tariffs Duration 6:26 U.S. President Donald Trump announced the possibility of additional tariff exemptions on certain car parts made in Canada following ambiguity around tariffs on electronic imports from China. Trump said on Monday that further tariffs are expected to target pharmaceuticals and semiconductors.\n\nThen again, he also talked about an advantage for the broader Western hemisphere. He said several times that textile production could move closer to home, as Latin American countries mostly had a tariff of 10 per cent, while it was quadruple that in most Asian countries.\n\nBut his testimony was obsolete by the time he left the U.S. Capitol. While Greer was still on the witness stand, Trump eliminated that tariff differential, giving almost every country on Earth the same 10 per cent rate.\n\nAnd that's the messy middle. Our current unstable trading system, being scrambled from one minute to the next by an unpredictable U.S. president, with tariffs on certain products but not others; and it changes day to day.\n\nAs Democratic Sen. Ron Wyden of Oregon said, his voice rising: \"What. Is. The. Plan? In the last week the White House has been all over the map.\"\n\nIt could be worse. It could be a full-blown, ever-escalating crisis — the bad place. We already got glimpses of that between December and March.\n\nThe U.S. is unhappy with Canada's digital services tax and its supply-management system for dairy, eggs and poultry. (Shane Hennessey/CBC)\n\nFor about three months, Trump kept threatening Canada's economic and national survival, talking about immiserating it so severely it might plead to join the U.S.\n\nHe's recently stopped talking about crushing Canada's economy, or forcing it to accept U.S. annexation, or referring to the prime minister as \"governor.\"\n\nWe'll know soon whether he intends to resume this, after this month's federal election, when it will become clear whether Trump has changed his tune or has been biting his tongue for fear of influencing the vote.\n\nImpediments to a quick deal\n\nIn any case, it will take time to rebuild trust, says one Washington analyst. She likens the process to therapy — Canada and the U.S. will, first, need to air their grievances.\n\n\"Right now things are very hot, and we need to give it some time to cool down so that there can be a reset,\" said Jamie Tronnes, executive director of the Center for North American Prosperity and Security.\n\n\"Canada and the U.S. need some time to be able to come to the table and talk about the problems that we've had in the relationship.\"\n\nThe U.S. has longstanding complaints about Canada's failure to meet its defence commitments, from the Arctic to military spending, she noted. Canada, meanwhile, has been angered by these tariffs.\n\nSeveral other factors could drag this out.\n\nFor example, it might take over a year just to start reviewing the CUSMA, if the U.S. follows its own legal processes for the renegotiation. In theory, the U.S. could scale back tariffs while negotiating.\n\n\"The mechanisms to change [CUSMA] are not clear,\" said Carrillo, who wondered whether Trump will follow the formal process or seek a quicker deal.\n\nDelays could get worse thanks to a personnel issue: the U.S. trade team is stretched thin. They're juggling talks with dozens of countries — and Greer has been wearing multiple hats, holding different interim roles in the White House.\n\nWhen negotiations begin, the priorities are no mystery.\n\nEmployees work on an assembly line during the production launch of Chrysler vehicles in Brampton, Ont., in January 2011. (Darren Calabrese/Canadian Press)\n\nCanada's chief goal? Build legal guardrails to stop Trump from firing off tariffs at will — something a few U.S. lawmakers also favour .\n\nIt's a tall order. Trump won't be keen to surrender his go-to weapon. After all, he just threatened more tariffs against Mexico, in a dispute over water. He's also studying tariffs on semiconductors and pharmaceuticals.\n\nWhat the Americans want most\n\nThe U.S. has several objectives. It's unhappy with Canada's digital services tax. It will either seek adjustments to, or the end of, the supply-management system for dairy, eggs and poultry.\n\nBut its top priority? Scrubbing foreign parts from U.S. manufacturing — especially Chinese steel and auto components, although it could go farther.\n\nLighthizer was vague on the details in his Ottawa talk, but he called this priority No. 1. Autos are \"the biggest thing,\" he said. \"I hope we tighten it even more.\"\n\nBut he raised another sore spot. Tellingly, he veered off his usual trade lane to take a jab at Canada over defence spending. Canada \"does not pay its share.… It just doesn't,\" he said. \"And that has to be addressed.\"\n\nThose are likely the broad themes.\n\nThe U.S. will seek changes on autos, dairy, digital taxes, defence spending, and, just maybe, based on recent sniping from Trump, looser banking regulations.\n\nCanada's top priority? Stability. It may chase extra deals — think softwood lumber — but the main goal is locking in old ties in a world that's anything but stable.\n\n\"I think we get to the good place eventually,\" Tronnes said. She added a caveat, with a touch of graphic imagery.\n\nCUSMA 'is still alive. It is like, you know, many have said it's under a guillotine right now, just waiting to be sliced apart. But I'm optimistic.\""
            }
        ],
        "createdAt": "2025-04-15T19:38:44.486263+00:00",
        "updatedAt": "2025-04-15T19:38:44.486263+00:00",
        "articleCount": 1,
        "summary": "<img src='https://i.cbc.ca/1.7510259.1744678716!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/trump-tariffs.jpg' alt='A visitor to Washington wears a Donald Trump mask outside the White House, posing in front of a Canadian flag held by tourists last month. ' width='620' height='349' title='A visitor to Washington wears a Donald Trump mask outside the White House, posing in front of a Canadian flag held by tourists last month. '/><p></p>",
        "timeline": "- 2025-04-15T04:01:00+00:00: Three ways this Canada-U.S. dispute will end"
    },
    {
        "name": "Global Output Demand",
        "event_id": "2",
        "severity": 0.34,
        "articles": [
            {
                "title": "Global wine output and demand fall to lowest in decades",
                "description": "",
                "published_date": "2025-04-15T19:04:18+00:00",
                "source": "Channel NewsAsia",
                "source_country": "Singapore",
                "news_type": "Economics",
                "countries_mentioned": [
                    "United Kingdom",
                    "Singapore"
                ],
                "link": "https://www.channelnewsasia.com/business/global-wine-output-and-demand-fall-lowest-decades-5067956",
                "content": "PARIS - Global wine production and consumption fell in 2024 to their lowest in decades, as extreme weather and high prices weighed on the sector, the International Organisation of Vine and Wine, known as the OIV, said on Tuesday.\n\nAdding to the challenges, wine producers around the world are under threat from tariffs for sales into the United States, the world's largest importer of wine by value.\n\nWine consumption fell 3.3 per cent globally to an estimated 214 million hectolitres, the lowest since 1961, as inflation and reduced consumer spending power eroded demand.\n\nGenerational changes in consumer behaviour and a fall in Chinese consumption, once a major driver, have also played their part in reducing wine drinking since 2018, the OIV said.\n\nGlobal wine production dropped 4.8 per cent to 226 million hectolitres, the lowest level in over 60 years and below the OIV's initial estimate of between 227 mhl and 235 mhl projected in November last year.\n\nA hectolitre is the equivalent of 133 standard wine bottles.\n\nAs in 2023, reduced output, particularly in Europe and parts of the Southern Hemisphere, was caused by adverse weather and disease, OIV Director General John Barker told reporters.\n\nThe surface area of vineyards contracted by 0.6 per cent to 7.1 million hectares in 2024, the fourth consecutive year of decline. The reduction reflects ongoing structural changes, including the removal of vineyards, to grow grapes for wine and other products, in both hemispheres.\n\nAmong the seven countries with the largest areas of vineyards in the world, only Italy, the largest wine exporter by volume, recorded positive growth - at 0.8 per cent.\n\nDespite the reduced volumes, higher average prices supported the market in value terms.\n\nInternational wine trade was at its lowest level in volume since 2010, pressured by high prices and weakened demand, but it grew in value as premium segments proved more resilient.\n\nExports totalled 99.8 million hectolitres, matching 2023 levels but falling 5 per cent below the five-year average. Export value increased to 35.9 billion euros ($38.9 billion), driven by stable record-high prices averaging 3.60 euro per litre.\n\nOf this, wine import value in the United States totalled 6.3 billion euros last year, up 1.6 per cent on 2023, far ahead of the United Kingdom at 4.6 billion euros and Germany at 2.5 billion."
            }
        ],
        "createdAt": "2025-04-15T19:27:47.566281+00:00",
        "updatedAt": "2025-04-15T19:27:47.566281+00:00",
        "articleCount": 1,
        "summary": "",
        "timeline": "- 2025-04-15T19:04:18+00:00: Global wine output and demand fall to lowest in de..."
    },
    {
        "name": "Ausvotes Economic Facts",
        "event_id": "14",
        "severity": 0.15,
        "articles": [
            {
                "title": " AUSVOTES ECONOMIC FACTS #2: Energy prices are plummeting",
                "description": " <a href=\"https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-2-in-fact-energy-prices-are-plummeting,19608?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: AUSVOTES ECONOMIC FACTS #2: Energy prices are plummeting\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19608-thumb.jpg\" width=\"65\" height=\"65\" alt=\"AUSVOTES ECONOMIC FACTS #2: Energy prices are plummeting\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> The economy is a dominant issue in the Election. From now until polling day, Independent Australia will outline some key facts on the economy that put the kybosh on many of the myths, lies and distortions being peddled in the election campaign. <a href=\"https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-2-in-fact-energy-prices-are-plummeting,19608?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
                "published_date": "2025-04-09T00:00:00+00:00",
                "source": "Independent Australia",
                "source_country": "Australia",
                "news_type": "Politics",
                "countries_mentioned": [
                    "Australia"
                ],
                "link": "https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-2-in-fact-energy-prices-are-plummeting,19608?utm_source=rss&utm_medium=rss&utm_campaign=IA_Feed",
                "content": "The economy is a dominant issue in the Election. From now until polling day, Independent Australia will outline some key facts on the economy that put the kybosh on many of the myths, lies and distortions being peddled in the election campaign.\n\nThis is the second in a series of short articles by leading economist Stephen Koukoulas, which will be published daily up until the Federal Election on Saturday 3 May 2025.\n\nFACT TWO: AUSTRALIAN ENERGY PRICES ARE FALLING FOR CONSUMERS, RECORDING THE BIGGEST FALLS IN THE OECD\n\nThe Coalition is claiming that energy prices have surged under the Labor Government and are a key issue behind the cost of living “crisis” for consumers. It is a claim that is not supported by facts.\n\nAccording to the latest OECD estimates, energy prices paid by consumers in Australia have fallen by the most of the 38 countries included in the survey. According to the OECD, energy prices in Australia are 12 per cent lower over the past year, which compares with an OECD average for a 3.6 per cent rise.\n\nThe fall in prices is linked directly to the Federal Government’s $300 a year per household subsidy that will be in place from 1 July 2024 to 31 December 2025.\n\nA range of state government subsidies to households for their electricity use have also contributed to the fall in prices over the past year.\n\nIn a media environment of mis/disinformation, the facts have never been more important.\n\nOther facts in this series:\n\nStephen Koukoulas is one of Australia’s most respected economists, a past chief economist of Citibank and senior economic advisor to an Australian Prime Minister. You can follow Stephen on Twitter/X @TheKouk.\n\nRelated Articles"
            }
        ],
        "createdAt": "2025-04-15T19:02:41.923453+00:00",
        "updatedAt": "2025-04-15T19:02:41.923453+00:00",
        "articleCount": 1,
        "summary": " <a href=\"https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-2-in-fact-energy-prices-are-plummeting,19608?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: AUSVOTES ECONOMIC FACTS #2: Energy prices are plummeting\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19608-thumb.jpg\" width=\"65\" height=\"65\" alt=\"AUSVOTES ECONOMIC FACTS #2: Energy prices are plummeting\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> The economy is a dominant issue in the Election. From now until polling day, Independent Australia will outline some key facts on the economy that put the kybosh on many of the myths, lies and distortions being peddled in the election campaign. <a href=\"https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-2-in-fact-energy-prices-are-plummeting,19608?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
        "timeline": "- 2025-04-09T00:00:00+00:00:  AUSVOTES ECONOMIC FACTS #2: Energy prices are plu..."
    },
    {
        "name": "Delhi Issuing Economically",
        "event_id": "3",
        "severity": 0.12,
        "articles": [
            {
                "title": "Delhi Not Issuing Economically Weaker Section Certificates, Says AAP; BJP Denies",
                "description": "The AAP said access to education and healthcare is being affected.",
                "published_date": "2025-04-15T18:19:38+00:00",
                "source": "NDTV",
                "source_country": "India",
                "news_type": "Politics",
                "countries_mentioned": [
                    "India"
                ],
                "link": "https://www.ndtv.com/india-news/ews-delhi-not-issuing-economically-weaker-section-certificates-aap-bjp-denies-8171957#publisher=newsstand",
                "content": "AAP on Tuesday accused the BJP government here of halting the issuance of Economically Weaker Section (EWS) certificates, thereby affecting access to education and healthcare for eligible families.\n\nThe BJP rejected the allegation, clarifying that Chief Minister Rekha Gupta has only called for the framing of proper guidelines to prevent the misuse of the facility.\n\nCiting the minutes of an official meeting, the Aam Aadmi Party's (AAP's) Delhi unit chief Saurabh Bharadwaj claimed the government has decided to pause the issuance of new certificates.\n\n\"The government will examine the EWS certificates issued so far as there is an apprehension that a large number of ineligible people have been issued EWS certificates. No new EWS certificates will be issued by the revenue department till further orders,\" he said.\n\nThe former Delhi minister said the decision will immediately impact students applying to institutes such as Delhi University and Indraprastha University, where EWS certificates are required for the 10 per cent quota.\n\nHe also flagged concerns about patients being denied hospital beds and services reserved for the EWS category.\n\nMr Bharadwaj alleged that the move would deprive the poor of access to education, healthcare, and job opportunities under the EWS category and termed it a \"deliberate attempt\" to benefit private institutions.\n\nClaiming that thousands of students and job aspirants could be affected due to the \"halt\" in issuance of EWS certificates, the AAP leader said, \"This government is entirely anti-poor.\" Targeting Chief Minister Gupta, he questioned the rationale behind \"punishing the public\" instead of taking action against officials allegedly responsible for issuing certificates to ineligible persons.\n\n\"How many officials has she suspended? If the certificates were wrongly issued, why hasn't any Sub-Divisional Magistrate (SDM), Additional District Magistrate (ADM) or District Magistrate (DM) faced action?\" Mr Bharadwaj asked\n\nThe AAP leader also accused the BJP of trying to avoid accountability in what he called an attempt to shield private institutions and benefit them by curbing EWS access.\n\nDelhi BJP chief Virendra Sachdeva rejected the claims, saying the issuance of EWS certificates has not been stopped.\n\nHe clarified that the chief minister has only called for the formulation of proper guidelines to prevent the misuse of the certificates. The economically weaker sections would continue getting benefits, Mr Sachdeva asserted.\n\nHe accused AAP of spreading misinformation to avoid scrutiny of the alleged irregularities during its rule.\n\nFake EWS and caste certificates were issued between 2015 and 2024 under pressure from AAP leaders, resulting in their misuse in school admissions and availing of hospital facilities and other government benefits, the BJP leader claimed.\n\n\"The people of Delhi understand why Saurabh Bharadwaj is creating a controversy. He fears an investigation will expose a massive scam,\" Mr Sachdeva said.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"
            }
        ],
        "createdAt": "2025-04-15T19:02:39.237374+00:00",
        "updatedAt": "2025-04-15T19:02:39.237374+00:00",
        "articleCount": 1,
        "summary": "The AAP said access to education and healthcare is being affected.",
        "timeline": "- 2025-04-15T18:19:38+00:00: Delhi Not Issuing Economically Weaker Section Cert..."
    },
    {
        "name": "Russia Jails Journalists",
        "event_id": "1",
        "severity": 0.11,
        "articles": [
            {
                "title": "Russia jails four journalists who covered Navalny",
                "description": "",
                "published_date": "2025-04-15T19:08:39+00:00",
                "source": "Channel NewsAsia",
                "source_country": "Singapore",
                "news_type": "Politics",
                "countries_mentioned": [
                    "United Kingdom",
                    "Singapore"
                ],
                "link": "https://www.channelnewsasia.com/world/russia-jails-four-journalists-who-covered-navalny-5067951",
                "content": "MOSCOW: Russia on Tuesday (Apr 15) sentenced four journalists it said were associated with late opposition leader Alexei Navalny to five and a half years in a penal colony, intensifying a crackdown on press freedom and Kremlin critics.Navalny - Putin's main opponent- was declared an \"extremist\" by Russian authorities, a ruling that remains in force despite his death in an Arctic penal colony on Feb 16, 2024.Moscow also banned Navalny's organisations as \"extremist\" shortly before launching its 2022 Ukraine offensive and has ruthlessly targeted those it deems to have links to him.A judge sentenced the reporters - Antonina Kravtsova, Konstantin Gabov, Sergei Karelin, and Artem Kriger - who all covered Navalny, to \"five years and six months in a general-regime penal colony\", an AFP journalist heard.They were found guilty of \"participating in an extremist group\" after being arrested last year.The trial proceeded behind closed doors at Moscow's Nagatinsky district court with only the sentencing open to the media, as has become typical for political cases in Russia amid its Ukraine offensive.Around a hundred supporters, journalists and Western diplomats came to the court for the verdicts.Supporters cheered and clapped as the defendants were led in and out, and one shouted: \"You are the pride of Russia!\"\"They will all appeal\" their sentences, said Ivan Novikov, the lawyer defending Kriger.\"The sentence is unlawful and unjust,\" said a second lawyer for Kriger, Yelena Sheremetyeva.\"No evidence was presented that these guys committed any crimes; their guilt was not proven,\" Gabov's lawyer Irina Biryukova said."
            }
        ],
        "createdAt": "2025-04-15T19:27:47.504208+00:00",
        "updatedAt": "2025-04-15T19:27:47.504208+00:00",
        "articleCount": 1,
        "summary": "",
        "timeline": "- 2025-04-15T19:08:39+00:00: Russia jails four journalists who covered Navalny"
    },
    {
        "name": "Ausvotes Economic Facts",
        "event_id": "0",
        "severity": 0.11,
        "articles": [
            {
                "title": " AUSVOTES ECONOMIC FACTS #1: In fact, Labor has inflation back under control",
                "description": " <a href=\"https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-1-labor-has-inflation-back-under-control,19605?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: AUSVOTES ECONOMIC FACTS #1: In fact, Labor has inflation back under control\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19605-thumb.jpg\" width=\"65\" height=\"65\" alt=\"AUSVOTES ECONOMIC FACTS #1: In fact, Labor has inflation back under control\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> The economy is a dominant issue in the election. From now until polling day, Independent Australia will outline some key facts on the economy that put the kybosh on many of the myths, lies and distortions being peddled in the election campaign. <a href=\"https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-1-labor-has-inflation-back-under-control,19605?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
                "published_date": "2025-04-08T00:00:00+00:00",
                "source": "Independent Australia",
                "source_country": "Australia",
                "news_type": "Economics",
                "countries_mentioned": [
                    "Australia"
                ],
                "link": "https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-1-labor-has-inflation-back-under-control,19605?utm_source=rss&utm_medium=rss&utm_campaign=IA_Feed",
                "content": "The economy is a dominant issue in the election. From now until polling day, Independent Australia will outline some key facts on the economy that put the kybosh on many of the myths, lies and distortions being peddled in the election campaign.\n\nThis is the first in a series of short articles by leading economist Stephen Koukoulas, which will be published daily up until the Federal Election on Saturday, 3 May 2025.\n\nFACT ONE: INFLATION UNDER LABOR IS BACK UNDER CONTROL\n\nAt the time of the May 2022 election, the annual inflation rate was 6.1% (year to the June quarter 2022). In quarterly terms, inflation was 2.1% in the March quarter 2022 and 1.8% in the June quarter 2022. (Source: Australian Bureau of Statistics)\n\nThis inflation rate was crippling Australian consumers and business and forced the RBA to embark on an aggressive interest rate hiking cycle.\n\nInflation has fallen sharply, from a peak of 7.8% in the year to the December quarter 2022, to 2.4% in the year to the December quarter 2024 (latest ABS quarterly data). In quarterly terms, inflation was 0.2% in each of the September and December quarters of 2024, which are annualised increases under 1 per cent.\n\nIn reaction to this easing in cost of living pressures, the Reserve Bank has started an interest rate cutting cycle, with a rate cut on 18 February 2025 and, at the time of writing, expectations in financial markets were for interest rates to fall a further 110 basis points to 3.0% (the current official interest rate is 4.1%).\n\nDon't be misled. These are the facts.\n\nOther facts in this series:\n\nStephen Koukoulas is one of Australia’s most respected economists, a past chief economist of Citibank and senior economic advisor to an Australian Prime Minister. You can follow Stephen on Twitter/X @TheKouk."
            }
        ],
        "createdAt": "2025-04-15T19:02:41.031146+00:00",
        "updatedAt": "2025-04-15T19:02:41.031146+00:00",
        "articleCount": 1,
        "summary": " <a href=\"https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-1-labor-has-inflation-back-under-control,19605?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: AUSVOTES ECONOMIC FACTS #1: In fact, Labor has inflation back under control\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19605-thumb.jpg\" width=\"65\" height=\"65\" alt=\"AUSVOTES ECONOMIC FACTS #1: In fact, Labor has inflation back under control\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> The economy is a dominant issue in the election. From now until polling day, Independent Australia will outline some key facts on the economy that put the kybosh on many of the myths, lies and distortions being peddled in the election campaign. <a href=\"https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-1-labor-has-inflation-back-under-control,19605?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
        "timeline": "- 2025-04-08T00:00:00+00:00:  AUSVOTES ECONOMIC FACTS #1: In fact, Labor has in..."
    },
    {
        "name": "Tobacco Policy Season",
        "event_id": "1",
        "severity": 0.11,
        "articles": [
            {
                "title": " Tobacco policy hell sets open season for black market",
                "description": " <a href=\"https://independentaustralia.net/politics/politics-display/tobacco-policy-hell-sets-open-season-for-black-market,19625?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: Tobacco policy hell sets open season for black market\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19625-thumb.jpg\" width=\"65\" height=\"65\" alt=\"Tobacco policy hell sets open season for black market\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> Over the past month, major investigations have been conducted into Australia’s $5 billion tobacco black market and the criminal gangs who now dominate the industry. <a href=\"https://independentaustralia.net/politics/politics-display/tobacco-policy-hell-sets-open-season-for-black-market,19625?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
                "published_date": "2025-04-14T02:00:00+00:00",
                "source": "Independent Australia",
                "source_country": "Australia",
                "news_type": "Politics",
                "countries_mentioned": [
                    "Australia"
                ],
                "link": "https://independentaustralia.net/politics/politics-display/tobacco-policy-hell-sets-open-season-for-black-market,19625?utm_source=rss&utm_medium=rss&utm_campaign=IA_Feed",
                "content": "Over the past month, both Four Corners and 60 Minutes have done major investigations into Australia’s $5 billion tobacco black market and the criminal gangs who now dominate the industry.\n\nNick McKenzie’s 60 Minutes report began by squarely laying the blame for the crisis on the Commonwealth Health Department’s tobacco policies.\n\n‘Where there’s smoke, there’s firebombing,’ he began, describing the reality for tobacconists in Victoria and increasingly throughout Australia.\n\nMcKenzie continued:\n\nIn the last 18 months, as many as 200 shops have been destroyed as criminals try to wrest control of the lucrative illegal tobacco market. What's concerning, though, is not only the level of violence, but why this thuggery started in the first place by taxing cigarettes so exorbitantly in an attempt to stop people smoking. What the Government has inadvertently created is a thriving black market worth $5 billion a year.\n\nDan Oakes’ Four Corners report, ‘Tobacco Wars’, began on an equally critical note:\n\n“Bringing death and destruction to Australia's streets, it's costing the Federal Government billions in lost taxes, and threatening decades of hard-won progress in the fight against deadly tobacco.”\n\nFormer Australian Federal Police detective superintendent Rohan Pike, who created and led the Australian Border Force’s Tobacco Taskforce in 2015 but now works as a lobbyist for the Australian Association of Convenience Stores (AACS), followed.\n\nPike said:\n\n“People here are sick of firebombings every second day. And it just gives the impression that law and order is out of control. This policy is perhaps one of the biggest failures in Australian history.”\n\nAustralia’s tobacco policy also received a dishonourable mention in the 2025 Federal Budget with the revelation that the fall in the sale of legal cigarettes had led to a precipitous decline in the tobacco excise that was projected to blow a $10 billion hole in the Budget’s prediction of revenue collected over the next four years. The tobacco tax peaked at $16.8 billion in 2019, declined to $10 billion in 2023 and was projected to fall to $6.4 billion in 2028.\n\nFor comparison, the money required for supplementary funding to increase our Medicare billing rates over the next four years was estimated at $8.5 billion.\n\nCommenting on the tobacco tax decline in the Australian Financial Review, economist Chris Richardson labelled Australia’s tobacco tax a $10 billion policy mistake that has fuelled organised crime and worsened health outcomes.\n\nRichardson condemned the absurd increase in tobacco tax:\n\nThe politicians got greedy and tobacco taxes are already up by more than a factor of five since 2010. However, Australia has raised tobacco taxes so far and so fast that we’ve spawned a vast black market. The tax take is telling us that Australians jumped into the black market. That’s been a godsend for criminals. This is a market that is just as profitable as heroin, but with a fraction of the legal consequences if you’re caught.\n\nChris Richardson was largely correct, except that putting a heavy tax on smoking was done for two reasons: to raise revenue, as he said, but secondly to discourage people from smoking. When the health authorities saw the excise was down, they misinterpreted the data as proof that their tax policies were working, but wishful thinking is never a good basis for policy. The wastewater testing (below) showed the nicotine was still there, but it was masked by the black market.\n\nThe chief executive of the AACS, Theo Foukkare, called on the Federal Government to freeze the excise on tobacco products for four years, along with legalising and regulating smoking cessation tools such as vapes, and strengthening the crackdown on illegal tobacco:\n\n“The definition of insanity is doing the same thing over and over again and expecting a different outcome. The Government, with their policy around tobacco excise and vaping prohibition, is doing exactly that. If it is revenue that the Government is after, it should legalise and tax cannabis.”\n\nThe two sides of the nicotine debate\n\n‘...raising tobacco taxes is one of the most effective mechanisms for governments to reduce population consumption of tobacco.’ ~ ‘Tobacco in Australia’, Australian Department of Health.\n\nAustralia’s road to tobacco policy hell was paved with the very best of intentions, to reduce the consumption of tobacco, so how did it go so wrong?\n\nSince the Health Department regarded price as the best way to reduce tobacco use, it adopted the crazy policy of increasing the tobacco tax by 12.5% every year, starting in 2013 and ending in 2021. In 2023, in his second budget, Treasurer Jim Chalmers announced a further 15% increase in the tobacco tax, estimating it would bring in an extra $3.3 billion over the next three years.\n\nAs the graph indicates, the Treasurer’s prediction was out by about minus ten billion dollars, which shows how woefully ignorant our Treasurer is about how excise tax works.\n\nFor Bay FM, I interviewed Dr Alex Wodak, the tobacco harm reduction adviser to the Harm Reduction Australia Board, who explained excise tax in a way even Jim Chalmers might understand:\n\n“Economists talk about a Laffer curve. This occurs when trying to estimate what the optimal taxation rate for a commodity is. If the taxation rate is too low, government revenue is not optimised because the rate is too low. If it is too high, government revenue falls away and there is widespread noncompliance, and people go to the black market. That's the situation we are in with cigarette taxation in Australia.”\n\nHarm reduction relies on helping consumers choose safer methods of consumption. Unlike prohibitionists, harm reductionists avoid a judgemental approach to drug taking or drug takers but seek to educate consumers about how to avoid harms.\n\nLung cancer is a major cause of death for tobacco smokers, but this results from inhaling the tars caused by burning tobacco, not from the nicotine. So the harm reduction approach is to encourage other means of consumption like vaping, which is inhaling nicotine aerosols, nicotine patches and so on.\n\nProfessor Simon Chapman is arguably the chief architect of Australia’s disastrous tobacco policies. Interviewed by Four Corners, he argued against reducing the tobacco tax, asserting that big tobacco exaggerates the size of the black market.\n\nChapman said:\n\n“We have a principle called the scream test. Basically, this means that if you follow the media monitors and follow what the tobacco companies are saying, if they are screaming very loud you know that is a policy that is going to bite hard on their bottom line and the things that they have screamed loudest about throughout my career is probably tax number one.”\n\nDan Oakes then asked Simon Chapman the question many were pleased he did:\n\n“You have a deep-seated hatred of big tobacco. Do you think this risks blinding you to what people are saying in good faith?”\n\nChapman replied, dismissing sincere experts like Rohan Pike and Dr Alex Wodak with this insult:\n\n“I think they should look in the mirror and see that what they are asking for is exactly the same as what Big Tobacco is asking for. Political useful idiots.”\n\nIn our interview, Dr Wodak replied, not with an ad hominin attack, but with a policy-based disagreement:\n\nAustralia's response to tobacco since 2010, more and more resembles the way Australia and many other countries have responded to the war on drugs with extremism — with the intentional provision of misinformation and disinformation, refusal to have any discussion or debate in public or even in private with people who disagree with that policy, extreme hubris. Really, the long and the short of it is that Australia's response to tobacco since about 2010 has looked more and more like a war on nicotine.\n\nIn their commentary in the Australian Harm Reduction Journal, James Martin and Edward Jegasothy agreed with Dr Wodak, arguing that Australia’s intensified regulatory approach toward nicotine control revealed a shift that increasingly resembles a de facto war on nicotine.\n\nMartin and Jegasothy wrote:\n\n‘...recent policies – including increased tobacco taxation and a ban on consumer vapes – have inadvertently fuelled a burgeoning nicotine black market. This has resulted in serious unintended consequences, including increased criminal activity, systemic violence and health risks associated with the proliferation of unregulated nicotine products.’\n\nThe combination of sky-high cigarette prices and the Health Department’s overwhelming obsession with cutting smoking rates had combined in a perfect storm to fuel an explosion in Australia’s tobacco black market. Our tobacco policies were creating more harm than they mitigated, mirroring many of the unintended consequences historically associated with drug prohibition.\n\nDan Oakes also interviewed Health Minister Mark Butler and asked if the Government would consider pausing tobacco tax increases to freeze legal prices and starve the black market of customers.\n\nEchoing Simon Chapman, he replied that this was something the tobacco industry lobbied for, but that would be “raising the white flag” and letting criminals and the industry dictate government policy.\n\nHowever, he could not deny that organised crime was already controlling the market:\n\n“Well, that's right, they've been able to get a foothold and I regret that that's the case, but, you know, the best time to deal with this would've been five years ago. The second-best time is to deal with it now.”\n\nRohan Pike disagreed. The best time was a decade ago when he alerted Border Force and the Government to the problem, but denial reigned then as it does now, and his warnings were ignored. Mark Butler’s solution was too little and too late. The black market was so widespread and entrenched that average citizens no longer had any qualms about participating in the black market.\n\nPike said:\n\n“Given that excise rates are the primary driver of this problem, from the start we should be looking at reducing the excise rates to a level that doesn't encourage people to go to the illicit market.”\n\nHealth's response to the rise of vaping\n\nCould Australia’s disastrous tobacco policy possibly get any worse?\n\nGiven the geniuses we have running the Health Department, this proved no problem.\n\nAllow me to illustrate:\n\nThis is a graphic from the article titled Analysis of wastewater from 2013 to 2021 detected a recent increase in nicotine use in Queensland, Australia. It plots the levels of nicotine measured between 2013 and 2021 in a wastewater treatment plant serving over 100,000 people in southeast Queensland.\n\nTracing different metabolites, one measuring tobacco-based nicotine use from cigarettes, the other measuring non-tobacco nicotine use from vapes, nicotine patches and other nicotine replacement therapies, it shows the transformation in nicotine consumption between 2013 and 2021 as e-cigarettes or vapes replaced cigarette use. Vapes are recommended as safer than cigarettes because they are free from the tars released by burning tobacco, the major cause of lung cancer in tobacco smokers.\n\nThe graph shows how nicotine users’ concerns about lung cancer changed the pattern of nicotine use in Australia. However, the rise of vapes worried the nicotine prohibitionists in the Health Department, and they set about banning vapes and successfully driving vapes, which are comparable in size to the cigarette market, into the black market as well.\n\nNicotine vapes were made harder to obtain with an ‘enhanced regulatory approach to vaping’, according to the 2023 Budget Papers, which required vape users to obtain a prescription from their doctor to legally obtain vapes. Fruity flavours and colourful packaging were also abolished to make vapes less appealing.\n\nOverwhelmingly, this caused vapers to shift to the black market. The National Drug Strategy Household Survey 2022–2023 reported that 1.8 million Australians smoked tobacco, while 1.5 million used vapes, a figure that had tripled from 2019. A vast majority (87%) of people who had used e‑cigarettes with nicotine reported that they had obtained them without a prescription (from the black market).\n\nSaid Dr Wodak:\n\nWe have a policy rigidity problem with vaping. The customers, the people who vape, have gone to the black market. The problem with that is they're getting unregulated vapes over which governments have no control, so it it's a failed and futile policy which is unsustainable and sooner or later, I hope, the policy will collapse and the Government will have to introduce a much more realistic policy both for cigarette excise but also for vaping.\n\nOur interview ended with this bizarrely contrarian observation from Dr Wodak who said:\n\nIt is a curious situation that we're in, that we have to be grateful to the black market – run, of course, by criminals – but we have to be grateful to the criminals and for the black market that they have helped to accelerate the decline in smoking and switch people who enjoy nicotine to help them switch from high risk deadly cigarettes to low risk, safer vaping. So it's the criminals who have provided the market for people who want to keep on using nicotine.\n\nDr John Jiggens is a writer and journalist currently working in the community newsroom at Bay-FM in Byron Bay."
            }
        ],
        "createdAt": "2025-04-15T19:02:40.225816+00:00",
        "updatedAt": "2025-04-15T19:02:40.225816+00:00",
        "articleCount": 1,
        "summary": " <a href=\"https://independentaustralia.net/politics/politics-display/tobacco-policy-hell-sets-open-season-for-black-market,19625?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: Tobacco policy hell sets open season for black market\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19625-thumb.jpg\" width=\"65\" height=\"65\" alt=\"Tobacco policy hell sets open season for black market\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> Over the past month, major investigations have been conducted into Australia’s $5 billion tobacco black market and the criminal gangs who now dominate the industry. <a href=\"https://independentaustralia.net/politics/politics-display/tobacco-policy-hell-sets-open-season-for-black-market,19625?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
        "timeline": "- 2025-04-14T02:00:00+00:00:  Tobacco policy hell sets open season for black ma..."
    },
    {
        "name": "Among Three Worst",
        "event_id": "2",
        "severity": 0.1,
        "articles": [
            {
                "title": "R.N. Ravi among top three worst Governors of independent India: N. Ram",
                "description": "",
                "published_date": "2025-04-15T18:52:00+00:00",
                "source": "The Hindu",
                "source_country": "India",
                "news_type": "Politics",
                "countries_mentioned": [
                    "India"
                ],
                "link": "https://www.thehindu.com/news/national/tamil-nadu/rn-ravi-among-top-three-worst-governors-of-independent-india-n-ram/article69454020.ece",
                "content": "N. Ram, former Editor-in-Chief of The Hindu, on Tuesday said Tamil Nadu Governor R.N. Ravi would be among the top three worst Governors in the history of independent India.\n\nHe was speaking at an event organised by the Tamil Nadu Intellectuals’ Forum at Periyar Thidal on the recent Supreme Court verdict in the case regarding the Governor’s inaction on/withholding of assent to 10 Bills passed by the Tamil Nadu Assembly. “Today, there is a total attack on the concept of federalism. A Governor is the instrument. If we take a list of the worst Governors in the history of independent India, R.N. Ravi would be in the top three. Not just the BJP, but the Congress has also behaved badly in the Governor issue (in the past). The situation changed after the judgment in the S.R. Bommai case.”\n\nMr. Ram said the Supreme Court had previously been criticised by constitutional lawyers for becoming an ‘executive court’.\n\n“I have also participated in making that criticism...in the Kashmir issue, Citizenship Amendment Act...there has been no justice....these are fair questions. However, that the Supreme Court is not an executive court has been made clear (by the recent verdict on the Governor’s inaction),” he said, adding that even the BJP-ruled States should welcome the verdict.\n\nDMK Rajya Sabha member P. Wilson said the verdict had put a full-stop to the Governor’s tactics of delaying assent to Bills passed by elected State governments across India.\n\n“For the first time in India, a law has come into force without the assent of the Governor or the President. Ten Bills have become law, and we have won the case. The Supreme Court states that no constitutional authority is above the law. I hope that if the time limit for the Governor is reviewed, the Supreme Court will not reject it. The Constitution is a living document, and it cannot be misused,” he said.\n\nMr. Wilson said the verdict had fixed a time limit of 30 days for the Governor of a State to take action on a Bill, and had said the courts could be approached if no action is taken within 30 days.\n\n“If the Bill is sent to the President and withheld, a case can be filed in the court. If a Bill is re-enacted, a Governor should take a decision within 30 days. According to the verdict, Governors cannot delay. They don’t have any other work than signing Bills. The Governor’s office is operated with taxpayers’ money,” he said.\n\nDMK Rajya Sabha member N.R. Elango said Chief Minister M.K. Stalin had kept himself abreast of all the developments in the case. “As far as I know, Chief Minister Stalin didn’t file the case against the Union government or Governor R.N. Ravi. He filed the case because he wanted to protect State rights and Tamil Nadu’s interests,” he said.\n\nDravidar Kazhagam president K. Veeramani said the Supreme Court had not criticised any other Governor the way it had criticised Mr. Ravi."
            }
        ],
        "createdAt": "2025-04-15T19:02:39.471244+00:00",
        "updatedAt": "2025-04-15T19:02:39.471244+00:00",
        "articleCount": 1,
        "summary": "",
        "timeline": "- 2025-04-15T18:52:00+00:00: R.N. Ravi among top three worst Governors of indep..."
    }
]